[
{"text": "Full Stack Software Engineer", "date": "2019-08-23 11:41", "compensation": "Commensurate with experience", "link": "https://boston.craigslist.org/gbs/sof/d/cambridge-full-stack-software-engineer/6962929768.html", "address": ["\n        ", "\nApply here: ", "\n", "\nSuperpedestrian brings together a team of extraordinary people for one vision: transforming urban mobility. To work with us, you should possess a strong desire to change the way people everywhere move about cities. We're revolutionizing personal transit for a sustainable future. Superpedestrian is an equal opportunity employer, with women and minorities strongly encouraged to apply. We care about your skills and your character. If we think there's a good fit, we will get in touch. So please, no phone calls or recruiters.", "\n", "\nThe software team at Superpedestrian works on our scooter and electric bike fleet management and Vehicle Intelligence system. This includes backend and APIs to support the rich data we collect, communication and security for IoT, manufacturing integration, research and support tools, mobile SDKs and much more!  We’re a tight knit, industrious bunch and we are seeking a Senior Software Engineer to join the team. The ideal candidate has strong skills in backend development, optimizing algorithms and database structures, but can contribute on multiple levels.", "\n", "\nThere are currently several opportunities open in the software team, and we are looking for candidates at different stages of their career. Don't hesitate to apply if you only meet some of the preferred qualifications or if you feel you're overqualified. This is a position where you will have the opportunity to shape your responsibilities based on your skills and interests.", "\n", "\n", "\nWhat you'll do:", "\n - Create multiple database-backed API backends", "\n - Collaborate with cross-functional teams to define, design and ship new features", "\n - Contribute across the stack on developing web applications, data layers, and back end services", "\n - Unit-test code for robustness, including edge cases, usability and general reliability", "\n - Work on improving application performance and bug fixes", "\n - Continuously discover, evaluate, and implement new technologies to maximize development efficiency and application performance", "\n - Participate in cross-team peer code reviews", "\n - Participate in Agile Scrum sprint and release planning", "\n", "\nWhat we're looking for:", "\n - 2+ years of industry experience building scalable backend services", "\n - Significant experience with Python", "\n - Experience with Django, Rails, Node or similar web framework", "\n - Undergraduate degree in computer science or related field", "\n - Experience with RESTful web services, JSON", "\n - Working knowledge of database systems    "], "images": [], "type": "full-time"},
{"text": "Senior Software Engineer", "date": "2019-08-04 23:14", "compensation": "DOE", "link": "https://boston.craigslist.org/gbs/sof/d/boston-senior-software-engineer/6949690887.html", "address": ["\n        ", "\n", "PI112575454", "    "], "images": [], "type": null},
{"text": "Principal Software Engineer", "date": "2019-08-04 23:39", "compensation": "DOE", "link": "https://boston.craigslist.org/gbs/sof/d/boston-principal-software-engineer/6949698786.html", "address": ["\n        ", "\n", "PI112575457", "    "], "images": [], "type": "full-time"},
{"text": "Free Tech Job Training and Optional Job Placement  - Make 80,000 - 120,000 per y", "date": "2019-08-26 12:34", "compensation": "80,000 to 100,000", "link": "https://boston.craigslist.org/bmw/web/d/ashland-free-tech-job-training-and/6965009469.html", "address": ["\n        ", "\n", "    "], "images": [], "type": "contract"},
{"text": "Test Automation Engineer", "date": "2019-08-14 15:13", "compensation": "full-time", "link": "https://boston.craigslist.org/gbs/sof/d/boston-test-automation-engineer/6956649617.html", "address": ["\n        ", "\n\n        ", "\n    "], "images": [], "type": null},
{"text": "Implementation Engineer", "date": "2019-08-13 13:10", "compensation": "full-time", "link": "https://boston.craigslist.org/gbs/sof/d/boston-implementation-engineer/6955789282.html", "address": ["\n        ", "\n\n        ", "\n    "], "images": [], "type": null},
{"text": "Lead .NET Developer", "date": "2019-08-14 13:13", "compensation": null, "link": "https://boston.craigslist.org/gbs/sof/d/boston-lead-net-developer/6956537867.html", "address": ["\n        ", "\n\n        ", "\n    "], "images": [], "type": null},
{"text": "CIVIL ENGINEERS & Surveyors - All Levels", "date": "2019-08-14 02:52", "compensation": "Dependent on experience level; Full time with benefits, healthcare, 401k", "link": "https://boston.craigslist.org/gbs/egr/d/boston-civil-engineers-surveyors-all/6956264295.html", "address": ["\n        ", "\n", "  ", "\n ", "  ", "  \n  ", "\n\nWe have positions for: Civil CAD Designer, Civil Project Engineer, Licensed Civil Engineer, Civil Project Manager, Structural Engineers and Land Surveyors    ", " ", "\n\nPositions open for types of project disciplines: Land Development / Site Development, Transportation Engineering, Structural Engineering, Land Surveying and Water Resources   ", " ", "\n\nFor CONFIDENTIAL CONSIDERATION: ", "\nEmail your resume to: jobs@trabucogroup.com \n", " ", "\nFor full list of Engineering positions, visit us at: ", "    "], "images": ["https://images.craigslist.org/00101_3qprXDEeCRQ_600x450.jpg", "https://images.craigslist.org/00s0s_5ULF13MvOda_600x450.jpg", "https://images.craigslist.org/00q0q_e3jjxRHrFJG_600x450.jpg", "https://images.craigslist.org/00S0S_gg3BrssLVpY_600x450.jpg", "https://images.craigslist.org/00909_4npqDFanL7x_600x450.jpg", "https://images.craigslist.org/01111_aj23sDEOWmN_600x450.jpg", "https://images.craigslist.org/00u0u_eWrZMPd73KC_600x450.jpg", "https://images.craigslist.org/00Y0Y_7FbOIsehvH2_600x450.jpg", "https://images.craigslist.org/00A0A_k6oLYjPcwd5_600x450.jpg", "https://images.craigslist.org/00505_7Zcr1Kqq5WW_600x450.jpg", "https://images.craigslist.org/00p0p_3qJZnXkVFoz_600x450.jpg", "https://images.craigslist.org/00w0w_l5dazEcmdO0_600x450.jpg", "https://images.craigslist.org/01717_5OlyBmkOBuF_600x450.jpg", "https://images.craigslist.org/00808_gI1l6wPbXIx_600x450.jpg", "https://images.craigslist.org/00Y0Y_cEpigprK6xc_600x450.jpg", "https://images.craigslist.org/00g0g_kU2K4cAi2Xv_600x450.jpg"], "type": "full-time"},
{"text": "VP of Engineering for Growing Medical Device Company", "date": "2019-07-31 10:35", "compensation": "TBD", "link": "https://boston.craigslist.org/gbs/egr/d/roslindale-vp-of-engineering-for/6946326035.html", "address": ["\n        ", "\nWe are a four-year-old medical technology company founded by a team of accomplished entrepreneurs that have built multiple successful, multi-million dollar companies, including two that we took public on the NASDAQ.  ", "\nThis company is growing rapidly and has been well funded, having raised $14.5 million dollars to date.  ", "\n", "\nWe have created and patented a revolutionary orthopedic rehabilitation device.  Response to the new device has been very strong, with endorsement by 126 highly respected surgeons nationwide.  First versions of the device have been sold into more than 75 hospitals and clinics including many of the top 20 organizations in the country.  ", "\n", "\nWe are now nearing completion of our second product, a portable version of our first flagship device.  A growing list of surgeons are pre-ordering the product in anticipation of launch this spring.", "\n", "\nThe new product features wearable devices for measuring and tracking patient progress.", "\n", "\nWe are now seeking a full-time VP of Engineering (near Boston or surrounding area), with a proven track record of successfully bringing new medical devices from specs to market. This person will report directly to our CEO and manage a small team of mechanical, electrical, and software engineers, industrial designers, and fabricators which will turn pictures, drawings, specs, illustrations, directions and requirements into a working, market-ready device; and hand it off to manufacturing.", "\n", "\nThe company is located in western Connecticut.  This candidate must be located either in Boston or western Connecticut, or nearby enough that they can easily commute there for meetings.  Alternatively the company will consider relocating a very qualified candidate.", "\n", "\nThe current product is being finalized and tested for market readiness.  Another device is in early stages of engineering, and there are multiple additional products planned behind these.  For the right candidate, there are likely to be many years of engineering work ahead.", "\n", "\nThe desired candidate will oversee and manage each contributing engineer on timelines and budgets. The VP of Engineering drives the planning, design, prototyping, testing, and refinement of product development.", "\nThe highest quality we are seeking is the ability to make things go right to get high quality work done with very aggressive targets.  ", "\n", "\nThe ideal candidate has:", "\n", "\n an entrepreneurial, “guerilla warfare” mindset and style, i.e. builds things fast and cheap and demonstrates them quickly, versus big-company-big-budget-long-timeline; ", "\nan extreme sense of urgency; ", "\na high level of creativity and a vast knowledge of a wide variety of materials and methods of solving engineering problems; ", "\nan ability to plan activities and processes in parallel; ", "\nand a positive “get it done” “this will be easy” attitude; ", "\ncombining to push projects to completion at rapid speed.", "\nThe candidate should be familiar with and operate with lean and agile best practices with frequent builds, and with creating a minimum viable product as first priority.", "\n", "\nThe Engineering Manager will need to:", "\n", "\nAssess proposals and identify any additional partners/consultants needed for key aspects of the design, testing, and manufacturing processes", "\nManage diverse teams of engineers and designers", "\nKeep detailed and accurate records", "\nCooperate with and support quality management system for regulatory requirements", "\nUse your experience and expertise to take the lead while remaining flexible enough to implement and adapt to feedback and requirements from management and advisors", "\nContinue building a strong, lean, and talented Engineering team through the development of internal talent as well as external hiring", "\nBuild multiple teams over time for various projects, yet share intelligence between teams.", "\n", "\nKey Requirements:", "\n10+ years of experience engineering products", "\nExperience in medical devices, orthopedics, medical background / training / anatomy, medical regulatory agencies and procedures, are all a plus but not required", "\nCan demonstrate past success moving products from concept to market", "\nAbility to work well under pressure to meet aggressive deadlines", "\nSkilled at reading, processing, and working with technical writing and data", "\nAbility to interface effectively with engineers to complete work and achieve targets", "\nExperience using product management software, including ability to quickly learn how to use new management software", "\n", "\nQualified candidates, please respond and include:", "\nA cover letter detailing why you are the ideal fit for this job and your current pay requirements", "\nAn up-to-date resume", "\nA list of devices (medical or otherwise) which you have personally successfully led the charge in engineering from specs to showroom ", "\n", "\nPlease respond to this post only. Do not contact the company via phone or email outside of this post. ", "\n", "\nFor the right candidate, this is a long-term position with tremendous growth potential.  Compensation is competitive and is based on experience, accomplishments, and proven success.  The company is willing to compensate in the upper range for a candidate who demonstrate extraordinary productivity over time.", "\n", "\nFinally, openness, honesty, and candidness are qualities we respond to—as opposed to framing things in the right way with the right words. Please be who you are and let the dice roll.", "\n    "], "images": [], "type": "full-time"},
{"text": "Architectural Designer / Project Manager", "date": "2019-08-06 13:35", "compensation": "Commensurate with experience", "link": "https://boston.craigslist.org/gbs/egr/d/cambridge-architectural-designer/6950829549.html", "address": ["\n        ", "\nAmerica Dural, Inc. is a residential architecture and interior design firm, seeking designers across various levels. We are looking for qualified, self-motivated candidates with an established eye for design, that wants to part of a creative work environment and develop skills through experience within our firm.", "\n", "\nThe ideal candidate will have a passion for residential architecture and design and possess the ability to manage multiple phases of project development. Responsibilities will include (but not limited to):", "\n-Documenting and drafting existing conditions", "\n-Creation and development of AutoCAD floor plans, elevations, and millwork detailing", "\n-Preparation of furniture layouts, schematic floor plans, and design elements by hand sketching", "\n-Research and develop materials, furniture and finish selections for client presentations", "\n-Manage project schedules and budgets", "\n-Organize client files and document project correspondence", "\n-Attend site visits and oversee work across multiple phases of design through construction", "\n-Attend client meetings with principal", "\n-Source new products, materials and vendors and maintain positive relationships with established vendors", "\n", "\nQualifications:", "\n-Bachelor's degree in Interior Design or Architecture", "\n-Minimum of 3-5 years experience", "\n-Demonstrated proficiency in AutoCAD is required", "\n-Proficiency in Sketchup, Adobe Creative Suite, MS Office is desired", "\n-Familiarity with Quickbooks (or comparable software for invoicing, billing and tracking) is a plus.", "\n-Ability to execute development of design concepts from schematic design through construction", "\n-Excellent written and verbal communication skills", "\n-Ability to independently manage time and work schedule to meet project deadlines", "\n-Highly organized, detail oriented and self-sufficient", "\n-Experience working with vendors and contractors; having established vendor relationships in the area is a plus!", "\n-A valid driver's license with reliable transportation for visits to job sites, vendors, etc. is a plus but not a requirement", "\n", "\nCompensation will be commensurate with experience. We are looking for someone full-time, to join our team based out of our office in Cambridge, MA. If you feel like you would be a good fit please reach out with your resume and portfolio!    "], "images": [], "type": "full-time"},
{"text": "Construction Project Manager", "date": "2019-08-14 16:16", "compensation": "competitive", "link": "https://boston.craigslist.org/gbs/rej/d/wellesley-hills-construction-project/6956703459.html", "address": ["\n        ", "\nMaloney Properties – Voted “Best Place to Work” by its employees for 4 years!", "\nOur team is hard-working and motivated toward providing the best possible housing experience for our residents.  Our reputation for customer service and quality workmanship is exemplary in the industry.", "\nAn experienced Project Manager is needed for our Contracting Services, a Division of Maloney Properties, Inc.  The Division is responsible to oversee millions of dollars in residential and commercial development projects as well as projects owned or managed by Maloney Properties.  The ideal candidate will demonstrate the ability to professionally manage various projects from assisting in the development of scope and managing to completion.   Qualified applicants will have experience in all phases of construction management and owners’ representation services.", "\nSkills required:", "\n•\tExperience working on construction and renovation projects of varying size and complexity.", "\n•\tAbility to effectively manage architects, engineers and contractors.", "\n•\tThorough knowledge of construction documents and contracts.", "\n•\tExperience working with construction project software programs.", "\n•\tAbility to manage and monitor schedules to ensure projects stay on track.", "\n•\tAbility to conduct comprehensive plan and cost reviews.", "\n•\tEffective communication with owners, agents and project teams.", "\n•\tMotivated to manage projects to meet goals and expectations of the property owners, including those properties managed by Maloney under third party contracts as well as properties owned by Maloney and those under development by Maloney Development LLC.  ", "\nSome of the day to day responsibilities include: ", "\n•\tMeeting with and negotiating with clients, architects and consultants.", "\n•\tScheduling", "\n•\tPermitting", "\n•\tBidding and job estimating.", "\n•\tNegotiating with contractors and sub-contractors. ", "\n•\tBudgeting and Tracking job schedules.", "\nQualifications:", "\nA minimum of 5 years of construction management experience. The ability to organize and lead a team and track a project.  Area of responsibility includes from project development to bid stage and through project completion.  An unrestricted Construction Supervisor’s License for Massachusetts and a complete knowledge of construction methods and materials as well as codes and regulations pertaining to construction is required. A valid Driver’s License and access to a vehicle is required.    ", "\n", "\nCompensation & Benefits:", "\nMPI offers a family friendly workplace and healthy work-life balance.  In addition to a competitive salary and benefits package we also offer the following:", "\n•\tTraining programs and opportunities that lead to employee advancement and promotions. ", "\n•\tA flexible work schedule and the ability in many cases to work remotely. ", "\n•\tA generous Employee Referral Program with a bonus of up to $1,000 per hire.", "\n•\tVolunteer and fundraising opportunities for annual causes such as the AIDS Walk and Stand Against Racism, just to name a few.  ", "\n", "\n", "\nApply Now Via:", "\n", "\n    "], "images": [], "type": "full-time"},
{"text": "Mid-Level Software Engineer", "date": "2019-08-06 15:02", "compensation": "$100-110k", "link": "https://boston.craigslist.org/sob/sof/d/quincy-mid-level-software-engineer/6950913390.html", "address": ["\n        ", "\nThe Mid-Level Software Engineer designs and implements APIs and integration points between our company's SaaS application to customers' systems.  This role is critical for helping our customers utilize our workflow and leverage their existing applications.  This role supports all stages of software development lifecycle including gathering requirements, technical design, unit and integration testing, deployment, and post-production support. ", "\n", "\nDuties and Responsibilities", "\n•\tDesign, develop, test and prepare APIs for installation.", "\n•\tDesign, develop and conduct Systems Integration Testing (SIT) prior to launching the solutions.", "\n•\tDevelop and maintain technical documentation to support technical delivery and integrations with 3rd party software.", "\n•\tHelp in technical discussions with clients throughout project delivery and implementation of all integrations.", "\n•\tProvide post-installation and integration support.", "\n•\tTroubleshoot technical issues by confirming the validity of the problem and seeking known solutions.", "\n•\tWork with internal and external vendors and clients in a constructive and collaborative manner and on the integration of diverse technologies.", "\n•\tHelp technical leads in the development of project metrics on IT projects during the project planning phase, and after initiation.", "\n•\tExperience connecting both SaaS and On-Premise integration points.", "\n•\tWork on other tasks at the discretion of the Senior Director, Solution Architect. ", "\n", "\nQualifications", "\n•\tBachelor’s degree in Computer Sciences. Master’s degree is a plus.", "\n•\tTotal five to seven years of software development experience. Around two years of systems integration experience for large scale infrastructure and cloud transformation programs is a plus.", "\n•\tProven experience in software solutions development, software integration through analysis, design, development, implementation, test and evaluation of custom developed solutions.", "\n•\tProven experience in technical documentation and systems support.", "\n•\tStrong working knowledge of the Microsoft Technology Stack - .Net, C#, ASP.NET, .NET Core, REST APIs.", "\n•\tProven experience in design and development of Microsoft SQL Server database, SQL Scripts and other like MySQL, MongoDB.", "\n•\tFoundational knowledge of Microsoft SharePoint, Microsoft Dynamics is a plus.", "\n•\tExcellent .NET and SQL Server debugging and troubleshooting skills.", "\n•\tExperience in both web-based and traditional programs.", "\n•\tExperience with AWS or Azure based integrations.", "\n•\tUnderstanding of software security and secure systems.", "\n•\tExperience with Windows Active Directory environments is a plus.", "\n•\tExcellent oral and written communication skills.", "\n•\tExcellent analytical skills.", "\n•\tAbility to independently troubleshoot and debug customer reported issues.", "\n•\tAbility to work independently, demonstrate initiative, and work on tighter project deadlines.", "\n•\tExcellent ability to perform a variety of tasks.", "\n", "\n**Unable to provide H1B sponsorship at the present time**", "\n", "\nPhysical Requirements", "\n•\tSome physical requirements are needed for this position.", "\n•\tAbility to travel 10-20% both domestically and internationally", "\n", "\n    "], "images": [], "type": "full-time"},
{"text": "Civil/Site/Transportation Engineer", "date": "2019-08-28 10:19", "compensation": "We offer an excellent compensation and benefits package, including a health insurance plan, 401K plan, short- and long-term disability plans and profit bonus plan.", "link": "https://boston.craigslist.org/gbs/egr/d/woburn-civil-site-transportation/6966398755.html", "address": ["\n        ", "\nBRENNAN CONSULTING, INC. is a growing Civil/Site and Transportation Engineering and Land Surveying firm based in Massachusetts, north of Boston. We are looking to add a Site/Civil and Transportation Project Engineer to help with the current workload and in anticipation of some exciting new projects on the horizon.", "\n", "\nIDEAL CANDIDATE:", "\nApproximately 5 to 15+ years of experience", "\nRegistered Professional Engineer in Massachusetts, or anticipating licensure. ", "\n", "\nREQUIREMENTS:", "\n", "\nSITE/CIVIL ENGINEERING: ", "\n**Required to develop Site Layout, and Grading and Drainage Designs, as well as the development of Utility, Site Preparation and Demolition, Soil Erosion and Sedimentation Control, and Construction Detail Plans. ", "\nThe project types include: public municipal facilities, public and private school projects, and private development sites including multi residential, mixed use and commercial properties. ", "\n", "\n**Need to be intimately familiar with and able to design to the MA-DEP Storm Water Management Standards, as well as best management practices when the Standards are not applicable. ", "\n", "\n**Software requirements include AutoCAD Civil 3D version 2014 and HydroCAD version 9.", "\n", "\n", "\nTRANSPORTATION ENGINEERING:", "\n**Must be familiar with the development of Traffic Impact Assessments, Roadway Design, Traffic Signal Phasing and Timing, and the development of designs in accordance with MassDOT requirements. ", "\n", "\n**Software requirements include Synchro version 9.0.", "\n    "], "images": [], "type": "full-time"}
]