[
{"text": "Software Engineer - Embedded Linux", "date": "2019-08-30 12:19", "compensation": "DOE", "link": "https://sandiego.craigslist.org/csd/egr/d/san-diego-software-engineer-embedded/6968085459.html", "address": ["\n        ", "\nSoftware Engineer – Embedded Linux", "\n", "\nSeeScan is currently seeking an experienced software engineer to work on cutting edge software for our plumbing diagnostic and utility locating equipment. In this position, you will work on a team of engineers to develop new features and improve existing software, ensuring our customers receive top-of-the-line products we’re known for.", "\n", "\nOur ideal candidate is a self-starter with a sharp eye for detail and ability to stay flexible as requirements change. This is an exciting opportunity for someone who wants to create innovative solutions to real-world problems. A person who is eager to work on a team that regularly pushes the envelope of its technical capabilities will thrive in this position.", "\n", "\nResponsibilities", "\n", "\n•\tDesign and implement software of embedded devices and systems, spanning from requirements to production and commercial deployment.", "\n•\tTest and debug system software.", "\n•\tIntegrate and validate new product designs.", "\n•\tParticipate in design reviews.", "\n•\tStay current with latest best practices, and identify opportunities for technology, tool, and process improvement.", "\n", "\nQualifications", "\n", "\n•\tHighly proficient in Linux.", "\n•\tExperience building embedded software in a team environment.", "\n•\tThorough knowledge of OS coding techniques, IP protocols, interfaces, and hardware subsystems.", "\n•\tFamiliarity with software configuration management tools, defect tracking tools, and peer review.", "\n•\tStrong documentation and writing skills.", "\n•\tCapable of changing course quickly in a fast-paced development environment.", "\n", "\nOther Helpful Skills", "\n", "\n•\tExperience building IoT devices including a thorough understanding of full stack technologies.", "\n•\tExperience working with Yocto.", "\n", "\nEducation and Experience", "\n", "\n•\tBS degree in computer science, computer engineering, or similar with relevant experience.", "\n•\t2 years’ experience in hands-on development and troubleshooting using Linux on embedded systems.", "\n", "\nIf this application is of interest, please apply online at ", ". In your application, please include your resume and a thoughtful cover letter explaining why you are the ideal candidate for this position. We are looking for a long-term, in-house teammate to join us, not a contractor or consultant.", "\n", "\nAbout SeeScan", "\n", "\nModern life depends on the infrastructure that brings water, wastewater, electricity, gas, and communications to our homes and businesses. SeeScan’s mission is to deliver best-of-class products that protect these vital services. We are an original equipment manufacturer in San Diego, CA that builds diagnostic and utility locating equipment from the ground up, from initial product conception to prototyping, testing, and final assembly.", "\n", "\nAt SeeScan, you’ll be part of a group of people who bring passion and energy into everything they do. We value the individual contributions all of our employees make, and invest in the tools and training they need to find success and professional growth. We do our best to empower the right people to take on new opportunities, and our culture promotes transparency, integrity, and continuous learning.", "\n", "\nVisit us at www.SeeScan.com to learn more about why SeeScan is a great place to work!", "\n", "\nNotes", "\n", "\n•\tNo recruiters, contractors, or consultants, please.", "\n•\tNo relocation assistance or visa sponsorships available for this position.", "\n•\tSeeScan is an Equal Opportunity Employer.", "\n", "\n    "], "images": [], "type": "full-time"},
{"text": "Project Manager", "date": "2019-08-13 16:26", "compensation": "Competitive compensation with exceptional benefits", "link": "https://sandiego.craigslist.org/nsd/egr/d/carlsbad-project-manager/6956105060.html", "address": ["\n        ", "\nRuhnau Clarke Architects is currently in a growth mode and we are looking for employees who are driven and love a challenge.  We currently have a position available in our Carlsbad office for a Project Manager. We are architects specializing in K-12 and higher educational facilities, public use projects, medical facilities and retail projects.  Ruhnau Clarke Architects offers excellent benefits and compensation commensurate with experience. ", "\n", "\nTalent Summary:", "\nA Project Manager for Ruhnau Clarke Architects is a key position in the firm and is considered a critical position in managing all phases of a project from schematic design through construction and project closeout.  As the primary day to day contact to the client and governing agencies, a Project Manager has the primary responsibility for assisting in the development and monitoring of the project scope budget, project schedule, and planning of a project as well as lead the design team in the development of the design documents (drawings and specifications) on a given project. Project Managers are to be critical observers in assessing and coordinating with the Principal in Charge any potential changes in project scope, service, and/or potential project risks.", "\n", "\nMinimum Requirements:", "\n•\tEducation:  Architectural degree from an accredited university or equivalent demonstrated proficiency.", "\n•\tExperience:  Minimum of 7 years’ experience in production and coordination of design documents in all phases of an architectural project; minimum 5-8 years coordinating with state, county, and local governing agencies that have oversight on a project, DSA experience preferred;  Architectural License strongly recommended.", "\n•\tSoftware: Microsoft Office Suite Products (Outlook, Word, Excel, PowerPoint, Project, etc.) or demonstrated equivalent and proficiency; AutoCAD & Revit production software, and Bluebeam.", "\n", "\nExpectations:", "\n•\tEstablish productive working relationships, and listen, communicate, deal effectively and cooperatively with clients, team members, consultants, and government agencies.", "\n•\tCoach, mentor, and provide performance-enhancing feedback of assigned team members.", "\n•\tAbility to professionally communicate and delegate respectfully both verbally and in writing to give assignments to office support staff, consultants, and vendors.", "\n•\tBe proficient with all Ruhnau Clarke Architects’ documentation and office practice systems; provide input on ways to improve communication processes and practices.", "\n•\tWrite meeting minutes, AFO’s, change orders, RFI responses, and professional correspondence for self-managed projects.", "\n•\tAssist in review of scope of work and agreements with consultant are in alignment with project objectives.", "\n•\tWrite RFP’S and negotiate contracts and fees with clients and consultants as directed and supervised by the Principal in Charge.", "\n•\tHave a support role in marketing for new work, interviews and writing marketing proposals as directed by a Principal or other firm leader.", "\n•\tMaintain primary contact with client and have excellent follow-through with client to help get repeat work.", "\n•\tEstimate project schedule and project phase hours for assigned tasks and finish tasks within agreed upon budget hours for said task(s).", "\n•\tManage projects, budgets, schedules, staffing, and coordinate billing as requested.", "\n•\tCollaborate with design and production staff, construction administrator, and consultants.", "\n•\tWork to keep projects within designed work plans; contribute to firm profits and revenues, and use resources effectively.", "\n•\tUnderstand contractual liabilities as they relate to projects including fee calculations,", "\n•\tAssist in the preparation of plans of action with their supervisor for resolving project related problems.", "\n•\tEnsure that project conforms to contractual agreement with client, meeting all set budgets, goals, and work assignments for their project team that clearly defines project expectations.   ", "\n•\tParticipate in project design charrettes.", "\n•\tIntegrate design principles with project design team and maintain design integrity through all phases of the project. ", "\n•\tCoordinate with government agencies, utility companies, and resolve plan check and approval issues with all governing agencies that have jurisdictional authority over the project.", "\n•\tReview documents to ensure the clients’ and Ruhnau Clarke Architects’ minimum standard of quality, coordination, and compliance with the requirements of deliverables in all phases of a project.", "\n•\tGuide and direct project team and consultants for appropriate materials and systems.", "\n•\tReview documents for code compliance in all phases and issue code interpretations.", "\n•\tReview cost estimates and conduct value analysis.", "\n•\tReview and approve changes in collaboration with the project design team and client.", "\n•\tSupervise and resolve issues in preparation of construction documents.", "\n•\tDemonstrate capabilities to support Construction Manager during the Construction Administration phase of the project.", "\n•\tResponsible for the coordination and completeness of the construction drawings and specifications. ", "\n", "\nFor consideration please email cover letter, resume, and work samples including  construction documents", "\n    "], "images": [], "type": "full-time"},
{"text": "CIVIL ENGINEER & Surveyors - All Levels", "date": "2019-08-13 23:20", "compensation": "Dependent on experience; Full time w/ benefits, healthcare, 401k", "link": "https://sandiego.craigslist.org/csd/egr/d/san-diego-civil-engineer-surveyors-all/6956260438.html", "address": ["\n        ", "\n", "  ", "\n ", "  ", "  \n  ", "\n\nWe have positions for: Civil CAD Designer, Civil Project Engineer, Licensed Civil Engineer, Civil Project Manager, Land Surveyor   ", " ", "\n\nPositions open for types of project disciplines: Land Development / Site Development, Traffic / Transportation Engineering and Water Resources, Land Surveying   ", " ", "\n\nFor CONFIDENTIAL CONSIDERATION: ", "\nEmail your resume to: jobs@trabucogroup.com \n", " ", "\nFor full list of Engineering positions, visit us at: ", "\n\n", "\n\nKEYWORDS: civil engineering, site development, land development, grading, drainage, storwmwater, SWPPP, paving, striping, traffic control, transportation, signal, signage, railway, highway design, roadway, water, wastewater, hydrology, hydraulics, earthwork, utility design, water resources, wastewater, Autocad, Civil 3D, Microstation, inroads, ArcGIS, surveying, party chief, crew chief, robotic total station, leica, carlson,  topcon, topos, geotechnical, geotech, GIS, structural, ASCE, EIT, PE, TE\n\n\n    "], "images": ["https://images.craigslist.org/00q0q_e3jjxRHrFJG_600x450.jpg", "https://images.craigslist.org/00808_gI1l6wPbXIx_600x450.jpg", "https://images.craigslist.org/00g0g_kU2K4cAi2Xv_600x450.jpg", "https://images.craigslist.org/01111_aj23sDEOWmN_600x450.jpg", "https://images.craigslist.org/00N0N_iTQ1cFxkZwe_600x450.jpg", "https://images.craigslist.org/00S0S_gg3BrssLVpY_600x450.jpg", "https://images.craigslist.org/00Y0Y_7FbOIsehvH2_600x450.jpg", "https://images.craigslist.org/00909_4npqDFanL7x_600x450.jpg", "https://images.craigslist.org/00y0y_5SjTJpJNoEt_600x450.jpg", "https://images.craigslist.org/00J0J_cDVRVFQ1Jk8_600x450.jpg", "https://images.craigslist.org/01717_5OlyBmkOBuF_600x450.jpg", "https://images.craigslist.org/00G0G_jdOW9YQ43na_600x450.jpg", "https://images.craigslist.org/00p0p_3qJZnXkVFoz_600x450.jpg", "https://images.craigslist.org/00Y0Y_cEpigprK6xc_600x450.jpg", "https://images.craigslist.org/00A0A_k6oLYjPcwd5_600x450.jpg"], "type": "full-time"},
{"text": "SENIOR DRAFTERS & ARCHITECTS (Shoppes at Carlsbad)", "date": "2019-08-05 19:51", "compensation": "Salary plus commission", "link": "https://sandiego.craigslist.org/nsd/egr/d/carlsbad-senior-drafters-architects/6950467147.html", "address": ["\n        ", "\nSENIOR DRAFTERS & ARCHITECTS ", "\n", "\nAre you a senior drafter or Architect with at least 15 years of experience? We have a great opportunity for you! ", "\n", "\nIntroducing SKSI PLANS & PERMITS, the first national brand in Architectural plans & building permits. ", "\n", "\nSKSI innovated a structure fusing the benefits and pride of being self-employed with security of working for a big company. We give you the most attractive high profile office, promote you, pay competitive wages and give you commissions on customers we supply you with. Your fully equipped high tech office will be inside the front entrance to the SHOPPES AT CARLSBAD, and you will have use of any of our other offices and network of colleagues at 18+ fashion malls throughout the Southeast Region (we are quickly growing nationally). ", "\n", "\nVideo of an SKSI location: ", "\n", "\nLOCATIONS", "\n", "\n•\tValley Plaza Mall in Bakersfield", "\n•\tOtay Ranch Town Center in Chula Vista", "\n•\tGlendale Galleria", "\n•\tThe Shoppes at Carlsbad in Carlsbad", "\n•\tGalleria at Tyler in Riverside", "\n•\tVisalia Mall in Visalia", "\n•\tSouthland Mall in Hayward", "\n•\tStonestown Mall in San Francisco", "\n•\tNorthridge Mall in Northridge", "\n•\tMeadows Mall in Las Vegas ", "\n", "\nREQUIREMENTS", "\n", "\n•\tMin 15 years’ Experience", "\n•\tDrafting of complete construction plan sets (excluding Title 24 and engineering calcs)", "\n•\tDrafting MEP's (bonus but not required)", "\n•\tResidential: Renovation, Additions, New Construction, ADUs", "\n•\tCommercial: Tenant Improvements, Additions, New Construction", "\n•\tWork with clients", "\n•\tSelling / closing new agreements ", "\n•\tDesign sessions", "\n•\tEngineering details", "\n•\tSite Inspections", "\n•\tPermit Expediting / working with building departments", "\n•\tAutoCAD / Revit / Sketchup / Chief Architect", "\n", "\nEXPECTATIONS", "\n", "\n•\tIntegrity", "\n•\tCreativity", "\n•\tCompletion", "\n•\tCompetence", "\n•\tCollaboration", "\n•\tProfessionalism", "\n", "\nCOMPENSATION", "\n", "\n•\tSalary (competitive based on experience and skill)", "\n•\tCommissions", "\n", "\nABOUT SKSI", "\n", "\nVideo about SKSI: ", "\n", "\nSKSI Plans and Permits (SKSI), the first National brand offering construction plans and permit expediting services announced nine new stores in California and Los Vegas for its innovative retail concept chain by the end of the year.", "\n", "\nSKSI Plans & Permits provides expert, fast, affordable and extremely accessible construction plans, engineering, Title 24 and permit expediting services for residential & commercial projects. SKSI helps builders, contractors, developers and property owners and managers save money and time without sacrificing quality by expediting planning and permitting for construction and property development. SKSI’s proprietary processes include the use of custom-developed software that streamlines the design and permit processes. ", "\n", "\nSKSI makes the process of creating and approving construction plans and permits extraordinary accessible and efficient for contractors, realtors and real estate investors, leasing companies and property managers, business and retail store owners, commercial landlords and homeowners. SKSI’s proprietary processes include the use of custom-developed software that streamlines the design and permit processes. ", "\n", "\nCLIENT LIST INCLUDES", "\n", "\n•\tHomeowners", "\n•\tLeasing & management companies", "\n•\tBrookfield Properties", "\n•\tWestfield Malls", "\n•\tApple Stores", "\n•\tAMC Theaters", "\n•\tBloomingdales", "\n•\tMacy’s", "\n•\tVan’s", "\n•\tStarbucks", "\n•\tVictoria’s Secret", "\n•\tGold’s Gym", "\n•\tPanda Express", "\n•\t… about 500 other top brands    "], "images": ["https://images.craigslist.org/01414_aMVU8tcrT1v_600x450.jpg", "https://images.craigslist.org/00D0D_7d8ndQMf7JD_600x450.jpg", "https://images.craigslist.org/00o0o_7XGTlue7XLh_600x450.jpg", "https://images.craigslist.org/00303_a1KfF4pnRCa_600x450.jpg", "https://images.craigslist.org/00303_gjwE28OZ3Lr_600x450.jpg", "https://images.craigslist.org/00W0W_52IsrwbYO0X_600x450.jpg"], "type": "full-time"},
{"text": "Manufacturing Technician", "date": "2019-08-28 12:20", "compensation": "$17-$21", "link": "https://sandiego.craigslist.org/nsd/mnu/d/san-diego-manufacturing-technician/6966668944.html", "address": ["\n        ", "\nPOSITION IS A 12-18 MONTH CONTRACT!! Not a long term opportunity.", "\n", "\nBuilds and tests laser sub-system prototypes and validates manufacturing processes.  Sub-system assembly, optical alignment, functional test, equipment calibration, station setup and process development support.  Recommend changes in design, methods, and procedures to enhance product quality.", "\n•\tUses standardized tools and electronic equipment (i.e., torque wrenches, electric and pneumatic screwdrivers and ball drivers, lifting equipment, computers, oscilloscopes) to assemble/install/remove or perform testing and troubleshooting. ", "\n•\tSolders small wires under microscope", "\n•\tTrains others on areas of test processes and troubleshooting when required.", "\n•\tPerforms a variety of moderately complex technical service/support duties requiring specialized knowledge (i.e., sub-assembly, assembly, build, test, R&D, QA).", "\n•\tUtilizes functional area databases to run reports and analyze/trend data; Makes recommendations to management in order to meet production needs.", "\n•\tInterfaces with engineers to support special tests and experiments with detailed instructions.", "\n•\tDocuments and monitors safety or security violations critical to product quality or operations.", "\n•\tUses specialized test equipment such as leak testing, Hi - Pot and alignment instruments. ", "\n•\tPressurizes Gas, and Water systems with Helium and troubleshoot failures.", "\n•\tReads and understands business documents such as Bill of Materials, routing sheets, inventory records and work instructions.", "\n•\tApplies labels to panels, modules, and doors to cleanliness and workmanship standards.", "\n•\tUses cleaning cloths with Acetone, Methanol, and Isopropyl alcohol to wipe surfaces prior to shipping product.", "\n•\tMaintains a clean work area, and is responsible for designated tools (routine maintenance and calibration).", "\n•\tInstalls electrical connectors to modules.", "\n•\tPerforms other duties as assigned.", "\n•\tExcellent written and verbal communication skills.", "\n•\tAbility to translate, statistically analyze data, and effectively report problems through written and/or graphical formats.", "\n•\tExcellent customer service skills, with an advanced understanding of customer relationship building.", "\n•\tAbility to use MS Word, Excel, PowerPoint, and electronic e-mail systems.", "\n•\tAbility to read and interpret schematics/drawings. ", "\n•\tBasic understanding of laser systems is required.", "\n•\tAbility to apply advanced knowledge of Company policies and technical skills in support of multiple products, services and components.", "\n•\tStrong electrical/ electronic background.", "\n•\tAbility to troubleshoot, identify and correct problems in complex software-driven electronic systems, (not circuit-board troubleshooting).", "\n•\tFamiliarity with cleanroom protocol is preferred.", "\n•\tAbility to calculate figures and amounts such as proportions, percentages, basic algebra.", "\n•\tFull to advanced proficiency with a wide variety of tools and equipment (e.g., oscilloscopes, voltage and current probes, multi-meters, chart recorders,  and Helium Sniffers).", "\nKnowledge base generally requires AS or related degree.  Requires minimum of six (6) years of experience; may have fewer years of experience with a Bachelor's degree.", "\n•\tRequires a High School Diploma or equivalent.", "\n•\tAssociate's Degree in technical or scientific field is highly desired.", "\n•\tExperience in using all electronic/pneumatic tools.", "\nPHYSICAL DEMANDS AND WORK ENVIRONMENT", "\nThe physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.", "\n•\tWhile performing the duties of this job, the employee routinely is required to sit; walk; talk; hear; use hands to keyboard, finger, handle, and feel; stoop, kneel, crouch, twist, reach, and stretch.", "\n•\tThe employee is occasionally required to move around the campus. ", "\n•\tThe employee may occasionally lift and/or move up to 50 pounds.", "\n•\tMay require travel dependent on business needs.", "\n•\tSpecific vision abilities required by this job include close vision, color vision, peripheral vision, depth perception, and ability to adjust focus.", "\n•\tCan work under deadlines.", "\n•\tThe environment generally is moderate in temperature and noise level.", "\n•\tMust wear disposable rubber gloves for entire duration of shift.", "\n•\tWearing of eye protection in manufacturing areas is required.", "\n•\tMust be able to read and interpret data, information, and documents.", "\n•\tCan observe and respond to people and situations and interact with others encountered in the course of work. ", "\n•\tCan learn and apply new information or skills.", "\n", "\n    "], "images": ["https://images.craigslist.org/00A0A_6eEeKciRnnV_600x450.jpg", "https://images.craigslist.org/00X0X_9ZMoEnsYyx1_600x450.jpg", "https://images.craigslist.org/00W0W_hhvJn6asYhh_600x450.jpg"], "type": "contract"},
{"text": ".NET Developer", "date": "2019-08-02 16:35", "compensation": "competitive", "link": "https://sandiego.craigslist.org/csd/sof/d/rancho-santa-fe-net-developer/6948277461.html", "address": ["\n        ", "\n***Please, no third parties***", "\n***Only Southern California candidates will be considered***", "\n", "\n", "\n", "\nThis is a contract/contract-to-hire opportunity for a .NET Developer at an industry leading company. The Software Engineer will be responsible for new development on next generation enterprise web and mobile applications, as well as occasional maintenance and enhancements of existing applications and legacy. Technologies include, but are not limited to: .NET 3.5/4.0/4.5, ASP.NET, MVC, .NET Core, Microservices, WebAPI, Angular, jQuery, VB.NET, C#, SQL Server 2005/2008, Azure/cloud, DHTML, JavaScript, CSS, HTML5, and Classic ASP.  A highly skilled Developer is desired to make an immediate and lasting impact on the core systems of this nationwide organization. This is a fun and flexible work environment and a chance to collaborate with a talented team.", "\n", "\nSkills and Requirements:", "\n- 5+ years of experience of .NET web development experience leveraging ASP.NET, C#/VB.NET, and related experience.", "\n- 5+ years of experience developing with SQL Server including writing SQL stored procedures.", "\n- Advanced level skills with jQuery and/or JavaScript experience.", "\n- Production experience with .NET Core and WebAPI.", "\n- Strong analytical and communication skills.", "\n", "\nPreferred Skills:", "\n- Bachelors or Masters Degree in Computer Science or related field is preferred.", "\n- Experience developing Microservices is preferred.", "\n- Knowledge of various design patterns a plus such as CQS, CQRS, etc.", "\n- MVC, cloud development, Agile/Scrum, SSRS, and Bootstrap are all preferred.", "\n", "\n", "\n", "\ntags: software engineer, sw engineer, programmer analyst, web application developer, web applications developer, web developer     "], "images": [], "type": "full-time"},
{"text": "Senior Level Audio Visual Technician / Engineer", "date": "2019-08-13 15:32", "compensation": "Open Salary, dependent upon experience and will be negotiated", "link": "https://sandiego.craigslist.org/csd/trd/d/senior-level-audio-visual-technician/6956069573.html", "address": ["\n        ", "\n", "\n", "\n", "\n", "\nYou’re a well-rounded audiovisual tech with experience working on commercial construction job sites and in professional business environments. \n ", "\n ", "You have a strong knowledge of audiovisual best practices, as well as killer customer service skills, and you pay attention to the details. \n", "\n ", "\nYour excellent troubleshooting skills make you the perfect person to provide service and support to our existing AV clients, but you are also able to test and commission new, high-level AV systems. \n ", "\n ", "\nYou’re internally motivated, a self-starter, personable, and able to prioritize responsibilities in order to meet deadlines.  \n", "\n ", "\n", "\n", "\n ", "\n•\tTroubleshooting high-level technical issues and supporting existing clients’ AV systems via phone, remote computer connection, or in person\n", "\n•\tTesting and commissioning, loading and editing code for new AV projects that include Crestron control systems and various digital signal processor platforms\n", "\n•\tMentoring other technicians and team members to help grow their skill sets\n", "\n", "\n", "\n ", "\n", "\n•\tMinimum of 4 years of experience in the AV industry that includes working in a customer service/end-user support role\n", "\n•\tAbility to read and interpret electronic and hard copy schematics and architectural blue prints\n", "\n•\tHands-on experience with the Crestron software suite, Toolbox, VTPro, SIMPL\n", "\n•\tExperience loading, modifying code to various Digital Signal Processors for Biamp, BSS, London, Polycom, Peavey, etc.\n", "\n•\tDemonstrated knowledge of computer networking and information technology skills\n", "\n•\tCTS Certification preferred\n", "\n•\tCollege-level education preferred\n", "\n", "\n", "\n ", "\n", "\n•\tValid Driver’s License (travel within Southern California is required)\n•\tAbility to work in the United States without sponsorship\n", "\n", "\n", "\n", "\n ", "\n ", "\nWe offer a competitive salary that’s heavily based on experience, as well as a comprehensive benefits package, which includes medical and dental.  We also provide company funded training programs to advance your AV skill set.\n", "\n ", "\n ", "\n", "\n ", "\n ", "\nFluid Sound (", ") is an Audio Video Systems Design & Installation company based in San Diego, California.\n", "\nAs a team membe, you’ll get the opportunity to work on some of the most exciting commercial AV projects in Southern California! You’ll be working with the latest technologies on projects that will be both challenging and interesting in corporate, entertainment, hospitality, and retail environments. We promise you’ll never be bored!\n", "\n ", "\nGood ideas are heard, appreciated, recognized, and able to be implemented quickly. Team members who prove themselves reliable are given the freedom and flexibility to control their work day to complete their tasks in a way that works best for them. \n", "\n ", "\nWe don’t micromanage, but our supervisors are still readily available for support and guidance. There are no “corporate politics” to deal with here—we work hard to minimize daily distractions to make the workplace productive and enjoyable for everyone.\n ", "\n ", "\n We have a small, tight-knit team made up of professionals who are diverse, unique, and respectful of the differences and skills of others.\n ", "\n ", "\nFluid Sound invests in the growth and professional development of our team members and offers ample opportunities for advancement within our company.\n", "\n ", "\n", "\n", "\n ", "\nFluid Sound provides equal employment opportunities to all team members and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, or any other characteristic protected by federal, state, or local laws.\n ", "\n ", "\nThis policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation, and training.\n", "\n", "\n", "\n", "\n", "\nPlease reply with ", " in the subject line of your email along with a copy of your RESUME to be considered for this position.", "    "], "images": [], "type": "full-time"},
{"text": "Cloud Services Engineer", "date": "2019-08-13 11:26", "compensation": "DOE", "link": "https://sandiego.craigslist.org/csd/sad/d/san-diego-cloud-services-engineer/6955862325.html", "address": ["\n        ", "\nOverview ", "\n", "\nScaleMatrix is currently seeking a full-time Cloud Engineer to support the continued design, planning, management, development and support of its internal and client facing Cloud and Data Protection solutions. ScaleMatrix is a growing company with a dynamic and exciting work environment. This person must be able to work in an environment focusing on products and services that enable our clients to utilize cloud services and technologies, and to integrate those offerings with existing infrastructure solutions. This role requires a senior resource with excellent communication skills and an ability to understand a broad range of technical solutions and issues. This person must be able to work independently, as well as part a cross functional team. Teamwork, organizational skills and flexibility are crucial attributes to bring to this position. ", "\n", "\nThis Cloud Engineer will be involved in projects utilizing a wide range of applications, operating systems, hosting environments and virtualization platforms within the datacenter environment. Tasking will include building, securing, and maintaining a large variety of servers and hosted solutions. The Cloud Engineer must be skilled at using a broad collection of applications, operating systems, Cloud environments and virtualization platforms to meet client requirements ranging from hosting small websites to complex load balanced clusters for Enterprise customers.  ", "\n", "\nRequired Skillsets: ", "\n", "\n· Ability to evaluate current Cloud environments and make recommendations for performance and architecture improvements. ", "\n", "\n· Support technical initiatives, ensuring solutions remain current as industry-changing technologies arise. ", "\n", "\n· Design and build secure, highly available solutions, utilizing Change Management so production systems have undergone peer review prior to implementation on the live system.  ", "\n", "\n· Extensive experience with architecting Cloud solutions, SAN, corporate, and virtualized environments. ", "\n", "\n· Hands on experience building enterprise grade production SAN environments. ", "\n", "\n· Development Operations experience supporting internal and external programmers and engineers. ", "\n", "\n· Experince with building and supporting corporate backup solutions, including multi-site environments ", "\n", "\n· Maintain very high uptime of critical corporate and client facing infrastructure. ", "\n", "\n· Excellent communication skills and the ability to learn a broad range of technical solutions and issues.  ", "\n", "\n· Collaborate with the Sales, Technology and Operation teams to understand and deliver the best possible technical solution from our broad range of products and services. ", "\n", "\n· Responsible for the proper maintenance and upkeep of multiple operating systems including corporate VDI and Terminal Services servers, ESXi hosts, vCenter servers, and backup solutions. ", "\n", "\n· Build, secure, and maintain a wide variety of fault tolerant Cloud and Data Protection solutions in multiple datacenters. ", "\n", "\n· Provide high level support to both clients and corporate solutions and systems.  ", "\n", "\n· Investigate and respond to all reports of systems issues for internal and client systems. ", "\n", "\n· Provide hardware and software recommendations to senior management for cost effective infrastructure upgrades. ", "\n", "\n· Must have demonstrated development and support skills in a fast-paced environment ", "\n", "\n· Willingness to work flexible schedule if necessary. ", "\n", "\n· Excellent verbal and written communication skills. ", "\n", "\nPluses: ", "\n", "\n· Hands on experience with Nimble, VDI and external Cloud solutions. ", "\n", "\n· Understanding of the VMware administrative platform including ESXi. ", "\n", "\n· Previous project management or sales engineer experience. ", "\n", "\n· IT certifications in Cloud, Storage, Windows Server, Active Directory, and VMware. ", "\n", "\n· Experience with open source technology, scripting languages ", "\n", "\n· Familiar with programming languages including Java, Python and Ruby. ", "\n", "\n· Skills in API usage, command line interfaces and SDKs for writing applications. ", "\n", "\n  ", "\n", "\nQualifications: ", "\n", "\n· Minimum three years of experience in a datacenter or similar computing environment. ", "\n", "\n· Experience with enterprise grade Cloud solutions, including both internal and external hosted systems. ", "\n", "\n· Extensive experience with cloud-based applications hosted on AWS, Azure, Google or similar solutions. ", "\n", "\n· Ability to communicate complex technical concepts in a simple and straightforward business fashion. ", "\n", "\n", "\n", "\nApply here -", "\n", "    "], "images": [], "type": "full-time"},
{"text": "Intermediate Drafter/Designer II", "date": "2019-08-02 13:55", "compensation": "Competitive compensation with exceptional benefits", "link": "https://sandiego.craigslist.org/nsd/egr/d/carlsbad-intermediate-drafter-designer/6948159363.html", "address": ["\n        ", "\nRuhnau Clarke Architects is currently in a growth mode and we are looking for employees who are driven and love a challenge.  We currently have a position available in our Carlsbad office for an Intermediate Drafter/Designer II. We are architects specializing in K-12 and higher educational facilities, public use projects, medical facilities and retail projects.  Ruhnau Clarke Architects offers excellent benefits and compensation commensurate with experience. ", "\n", "\nSummary:", "\nPrepares design and construction documents.  Requires general knowledge of design development and production of construction documents. ", "\n", "\nMinimum Requirements:", "\nEducation: A degree from an accredited university in architecture, interior design, civil engineering or construction management or a degree in CAD drafting from a technical institute is desired. Minimum of three (3) years experience in Revit modeling and AutoCAD drafting of architectural plans preferred.", "\n ", "\nCommunication and Collaboration:", "\n•\tListen and communicate effectively and professionally.", "\n•\tAsks questions about assignments when unclear.", "\n•\tHas working knowledge and understanding for use of Ruhnau Clarke Architects’ equipment and software.", "\n•\tCoordinate projects with team members and consultants for conflicts and discrepancies.", "\n•\tAbility to apprise supervisor for status of work.", "\nSupervision and Delegation:", "\n•\tAbility to professionally communicate both verbally and in writing to give assignments to office support staff, consultants and vendors.", "\n•\tAbility to effectively communicate with supervisor. ", "\n•\tAbility to delegate assignments to support staff and always be respectful.", "\n•\tSupport project leader and/or technical leader and project manager in supervision and delegation of work. ", "\nDesign:", "\n•\tParticipate in office design charettes.", "\n•\tProficient in the use of software to support in project design including three dimensional modeling, 2d & 3d. rendering, and presentation material.", "\n•\tFollow the design intent of graphic and verbal directions during all phases of project.", "\n•\tAssist in development of project documents during all phases of project.", "\nTechnical:", "\n•\tAssist in organization and generation of working drawings.", "\n•\tDemonstrate Revit and AutoCAD competency through the use of advanced commands and software specific tools.", "\n•\tPossess knowledge of modeling and drawing setup through the use of families, layers, blocks, views, parametric elements and referenced objects. ", "\n•\tPrepare complex plans, elevations and details under guidance of supervisor.", "\n•\tAssist in all aspects of the plan check process.", "\n•\tUnderstand technical terminology of the architectural and construction industry.", "\n•\tCoordinate drawings with consultant drawings and specifications.", "\n•\tApply building code concepts of accessibility, occupant loads, egress, exit widths, fire rated walls and doors, ramps, stairs, and handrails.", "\n•\tUnderstanding of basic construction systems of walls, roofs, doors, and windows.", "\n•\tSupport the construction administration phase of a project by assisting in review of submittals, shop drawings, response to RFI's, and preparation of instruction bulletins for changes.", "\n•\tBe proficient with Ruhnau Clarke Architects’ documentation and office practice systems.", "\n•\tAssist in preparing instruction bulletins, change orders, RFI responses. ", "\n", "\nTo apply please send cover letter, resume, and work samples including construction documents", "\n    "], "images": [], "type": "full-time"},
{"text": "Systems Engineer", "date": "2019-08-13 11:28", "compensation": "DOE", "link": "https://sandiego.craigslist.org/csd/sad/d/san-diego-systems-engineer/6955864815.html", "address": ["\n        ", "\nOverview ", "\n", "\nScaleMatrix is currently seeking a full-time Systems Engineer to support the continued development and support of its internal and client facing applications and systems. ScaleMatrix is a growing company with a dynamic and exciting work environment. This person must be able to work in an environment focusing on products and services that enable our clients to utilized cloud services and technologies, and to integrate those offerings with existing infrastructure solutions. This role requires a senior resource with excellent communication skills and an ability to understand a broad range of technical solutions and issues. This person must be able to work independently, as well as part a cross functional team. Teamwork, organizational skills and flexibility are crucial attributes to bring to this position. ", "\n", "\nThis Systems Engineer will be involved in projects utilizing a wide range of applications, operating systems, and virtualization platforms within the datacenter environment. Tasking will include building, securing, and maintaining a large variety of servers. The Systems Engineer must be skilled at using a broad collection of applications, operating systems, and virtualization platforms to meet client requirements ranging from hosting small websites to complex load balanced clusters for Enterprise customers.  ", "\n", "\nRequired Skillsets: ", "\n", "\n· Ability to evaluate current environments and make recommendations for performance and architecture improvements. ", "\n", "\n· Support technical initiatives, ensuring solutions remain up to date as industry-changing technologies arise. ", "\n", "\n· Design and build secure, highly available solutions, utilizing Change Management so production systems have undergone peer review prior to implementation on the live system.  ", "\n", "\n· Experience with Cloud, SAN, corporate, and virtualized environments. ", "\n", "\n· Maintain very high uptime of critical corporate and client facing infrastructure. ", "\n", "\n· Excellent communication skills and the ability to learn a broad range of technical solutions and issues.  ", "\n", "\n· Collaborate with the Sales, Technology and Operation teams to understand and deliver the best possible technical solution from our broad range of products and services. ", "\n", "\n· Responsible for the proper maintenance and upkeep of Linux-based systems including corporate web servers, ESXi hosts, vCenter servers, DNS servers, syslog servers and internally hosted Exchange. ", "\n", "\n· Build, secure, and maintain a wide variety of servers in use in multiple datacenters. ", "\n", "\n· Provide high level support to both clients and corporate solutions and systems.  ", "\n", "\n· Investigate and respond to all reports of systems issues for internal and client systems. ", "\n", "\n· Provide hardware and software recommendations to senior management for infrastructure upgrades. ", "\n", "\n· Must have demonstrated development and support skills in a fast-paced environment ", "\n", "\n· Willingness to work flexible schedule if necessary. ", "\n", "\n· Excellent verbal and written communication skills. ", "\n", "\nPluses: ", "\n", "\n· Understanding of the VMware administrative platform including ESXi. ", "\n", "\n· Previous project management experience. ", "\n", "\n· IT certifications in Cloud, Storage, Exchange, Windows Server, Active Directory, VMware and Linux. ", "\n", "\n  ", "\n", "\nQualifications: ", "\n", "\n· Minimum five years of experience in a datacenter or similar computing environment. ", "\n", "\n· Experience with back-office solutions and IT architecture. ", "\n", "\n· Experience with cloud-based offerings, including AWS, Azure, Google or similar solutions. ", "\n", "\n· Ability to communicate complex technical concepts in a simple and straightforward business fashion. ", "\n", "\n", "\nApply here-", "\n", "    "], "images": [], "type": "full-time"},
{"text": "Project Manager/Engineer of Millwork", "date": "2019-08-12 12:08", "compensation": "$20-$30 hour depending on experience.  Room to increase quickly.", "link": "https://sandiego.craigslist.org/csd/lab/d/san-diego-project-manager-engineer-of/6955147709.html", "address": ["\n        ", "\nProject Manager/Engineer", "\n", "\nIn this position you will lead a team responsible for numerous construction millwork jobs from pre-construction through final punch lists.", "\n", "\nThe ideal candidate will be responsible for planning, coordinating, and implementing projects within the decided-upon budget, timeline, and scope. This team member will also effectively monitor and present project updates to relevant clients, or project team members. ", "\n", "\n", "\nResponsibilities", "\n", "\nSet project timelines and manpower to insure timely and accurate completion of all jobs", "\nIdentify and focus on critical issues related to the build", "\nMonitor/verify project deliverable's", "\nUpdate relevant team members on the project progress", "\nCoach and support project team members with tasks you assign them", "\nReview labor hours with supervisors", "\nReview architectural drawing and shop drawings; provide input", "\nReview drawings with contractor to verify all dimensions prior to fabrication", "\nMonitor shop fabrication/production with Shop Production Manager", "\nReview/order/receive/organize samples", "\nUpdate project spreadsheets", "\nCoordinate project resources", "\nWork with Team members to identify, source, and manage materials", "\nIdentify and communicate project challenges and brainstorm solutions with other departments", "\nCoordinate all change orders into project timeline", "\nRun weekly team and safety meetings", "\n", "\n", "\nQualifications", "\n", "\nBachelor's Degree or equivalent professional experience", "\nMinimum 4-6 years millwork experience or related", "\n2+ years managing professional commercial projects", "\nMust have prior experience in project coordination, contracts, design process, construction timelines, building codes, project development and management", "\nDesign / Build and/or Fabrication experience", "\nKnowledge of fabrication and install", "\nStrong business acumen in project planning and management", "\nProficient in BlueBeam and the ability to read and interpret plan specifications", "\nMust demonstrate excellent organization and decision-making skills", "\nMust be willing to work some long hours or weekends if job crunch time is required", "\nExperience in Excel and other Microsoft software", "\nStrong verbal, written, and organizational skills", "\nAbility to manage and assign priorities to multiple projects", "\nOSHA 10 or 30 preferred", "\n", "\nWe are looking for that perfect team member to show us what you have.  Salary will increase accordingly.", "\nIf you think you have what it takes then email us your resume and cover letter.", "\n    "], "images": [], "type": "full-time"},
{"text": "Digital Electrical Engineer", "date": "2019-08-17 11:32", "compensation": "depending upon expertise and experience", "link": "https://sandiego.craigslist.org/nsd/tch/d/vista-digital-electrical-engineer/6958770660.html", "address": ["\n        ", "\nRaveon Technologies is a small High-Tech company doing RF product development and is a manufacturing firm that provides wireless solutions to OEMs as well as marketing its own brand of data communication and GPS tracking products. See our products at www.raveon.com.  Our GPS tracking products are shown here:  www.ravtrack.com and   ", "\n", "\nWe undergo design efforts to continue our role as a leader in the RF Modem industry", "\n•\tSCADA and telemetry remote terminal units with wireless access", "\n•\tInnovating on our already industry-leading GPS tracking technologies", "\n•\tApplying our efficient protocols and networking knowledge to design and build new IoT devices and gateways. ", "\n•\tDesign new long-range narrow-band RF radios for secure and remote data communications. ", "\n", "\nPosition available:", "\nA position is available for a Hardware and Software Engineer to join the Engineering Team. The successful candidate will be a self-motivated engineer with knowledge of :", "\n    Embedded C code, Hardware design, CPUs, Voltage Regulators, Analog circuits, digital circuits, Mechanical Design ", "\n", "\nThis person can work in a self-guided agile development environment and thrives on overcoming challenges.", "\n", "\nOur Engineers take over a large variety of responsibility.  You will design new products and help update previous products with new features. Sometimes engineers work on improving previous features, both software and hardware.  ", "\n", "\nIn addition to superior software development knowledge, you should have a good understanding of electronics. It is expected that you will learn some concepts of RF communication and learn RF hardware circuit design. As such you will need to be a fast-learner, articulate and a good communicator. We do business with the DOD; therefore you must be a US citizen.", "\n", "\nResponsibilities include:", "\n•\tSoftware development for our products and Apps we sell. ", "\n•\tHardware development. Schematic design. Researching and finding great components. ", "\n•\tSystem testing design and implementing new features and hardware options. ", "\n•\tSoftware documentation and writing user manuals for products you work on", "\n•\tAssisting sales personnel with technical issues as needed ", "\n", "\nCandidate must have these skills, or please do not apply:", "\n•\tWriting documentation in English. ", "\n•\tWriting and compiling C  code. ", "\n•\tEmbedded CPU hardware design and software development. ", "\n•\tSelf-motivation and taking initiative. High functioning personality.", "\n•\tEnjoys engineering and product development. ", "\n", "\nOur other Desired Engineering Experience. If you have that will be great for us to utilize:", "\n•\t3+ years of software engineering is desired, but college graduate with experience is OK. ", "\n•\tC++ especially with a focus on web, networking, and Linux OS.", "\n•\tCAD design for simulation and drawing designs. ", "\n", "\nThese technologies are not mandatory, but", "\nif you have any of the following knowledge, that will help of and make it more likely we want to hire you:", "\n•\tEmbedded C code for ARM processors ", "\n•\tLinux Operating system expert. ", "\n•\tLoRa RF communications technology", "\n•\tAttractive and functional user interface design", "\n•\tDesign involving IP networking", "\n•\tFreeRTOS operating system expertise. ", "\n•\tVisual Basic ", "\n•\t.NET software (C++ or VB)", "\n•\tRF circuit design. RF data communications. ", "\n•\tSCADA, MODBUS, DNP3 protocols. ", "\n•\tTCPIP Data communications and software in STM32 processors. ", "\n•\tElectronic test equipment", "\n•\tMilitary wireless communications.", "\n•\tGIS and mapping technologies", "\n•\tSCADA system design and terminology", "\n•\tTechnical sales", "\n", "\nIf this opportunity excites you, please email a response with information about your expertise and career goals.", "\n    "], "images": [], "type": "full-time"},
{"text": "Electrical Designer", "date": "2019-08-20 10:09", "compensation": "salary range $75,000 - $100,000", "link": "https://sandiego.craigslist.org/csd/egr/d/san-diego-electrical-designer/6960779311.html", "address": ["\n        ", "\nMichael Wall Engineering", "\nJob Opening – Bankers Hill Office", "\nELECTRICAL DESIGNER", "\n", "\nJOB DESCRIPTION", "\nElectrical Designer at Michael Wall Engineering, you will provide design/engineering support for construction projects in the Commercial, Military, Education, Hospitality, Science, and Technology sectors. ", "\n", "\nOpportunities: MWE is growing! Your career, knowledge and experience will thrive here at MWE.", "\n", "\nBenefits: MWE offers competitive compensation (salary range $75,000 - $100,000), and a robust benefits package (Medical, Dental, 401k with company contributions, PTO, etc.).   ", "\n", "\nSUMMARY OF QUALIFICATIONS", "\n", "\n•\tCreate electrical design documents using REVIT 2019 & AutoCAD 2019, Design Master, BIM360, Adobe Acrobat and Bluebeam.", "\n•\tAssist with singleline diagram design, electric room layout and sizing, and load calculations.", "\n•\tBranch lighting circuit design, including controls and switching.", "\n•\tBranch power circuit design, including panel schedule loading.", "\n•\tTitle-24 calculations.", "\n•\tPhotometric calculations.", "\n•\tSubmittal review and RFI responses.", "\n•\tLighting fixture schedule.", "\n•\tShort circuit current and voltage drop calcs.", "\n•\tUtility coordination.", "\n•\tCreate “cartoon” set and sheet index for set-up.", "\n•\tCoordinate with Project Engineer and/or Team Leadership in regard to project design responsibilities.", "\n•\tDemonstrate proficiency in basic NEC design requirements.", "\n•\tDemonstrate an understanding of electrical construction practices and standards.", "\n", "\nESSENTIAL DUTIES AND RESPONSIBILITIES ", "\n", "\n•\tWritten and verbal communication skills to function with all levels of management and staff.", "\n•\tReasoning development to apply principles of rational systems to solve problems and deal with a variety of concrete variables and to interpret instructions presented in various forms.", "\n•\tProficient in computer skills that includes software knowledge in Windows, Microsoft Word, Microsoft Excel, REVIT 2019 & AutoCAD 2019, Design Master, BIM360, Adobe Acrobat and Bluebeam, Microsoft Outlook, AGI 32 Photometric software, and SKM Dapper/Captor.", "\n•\tStrong organizational and excellent communications skills.", "\n•\tDetail oriented and problem solver.", "\n•\tAbility to work effectively in team-oriented, fast-paced environment.", "\n•\tGeneral computer skills in Windows, Microsoft Word, Microsoft Excel, Adobe Acrobat, Blue Beam and Microsoft Outlook.", "\n•\tStrong organizational and excellent communications skills.", "\n•\tDetail-oriented problem solver.", "\n•\tAbility to work effectively in team-structured, fast-paced environment.", "\n•\tCapable of implementing new software, if needed. ", "\n", "\n", "\nABOUT THIS COMPANY", "\nMichael Wall Engineering is a fast-growing full-service consulting electrical engineering firm with four (4) offices in Southern California:  San Diego (Sorrento Valley and Bankers Hill), Inland Empire, and Orange County. Since 1996, we have been dedicated to providing excellence in engineering services to the design and construction industry (A/E/C). We offer full-service design through registered Professional Engineers, in-house Lighting Design staff, and in-house Registered Communication Distribution Designers. Michael Wall Engineering is certified as a Small Business Enterprise (Caltrans and Federal). www.mwalleng.com.", "\n", "\n    "], "images": [], "type": "full-time"},
{"text": "SENIOR ANDROID AUDIO FRAMEWORK ENGINEER", "date": "2019-08-20 13:52", "compensation": "DOE", "link": "https://sandiego.craigslist.org/nsd/sof/d/carlsbad-senior-android-audio-framework/6960985110.html", "address": ["\n        ", "\n\n\n\n", "\n    "], "images": [], "type": "full-time"},
{"text": "Remote Full-Stack Ninja Developer", "date": "2019-08-02 11:44", "compensation": "DOE", "link": "https://sandiego.craigslist.org/csd/sof/d/san-diego-remote-full-stack-ninja/6948042578.html", "address": ["\n        ", "\n", "    "], "images": [], "type": "full-time"},
{"text": "CMM Programmer", "date": "2019-08-02 12:51", "compensation": "Competitive salary according to experience and excellent benefit package", "link": "https://sandiego.craigslist.org/esd/mnu/d/santee-cmm-programmer/6948104345.html", "address": ["\n        ", "\nPosition Summary  ", "\nThe CMM Programmer is a valuable member of the team that engineer great solutions for our customers. This position creates, maintains, and improves software programs for Coordinate Measurement Machines (CMMs) and other automated measurement equipment. This team member is also responsible for validating software programs by verifying measurement results using a secondary method so it is important they the CMM Programmer be able to understand GD&T and effectively use manual inspection methods using calipers, micrometers, optical comparators, etc.   ", "\n  ", "\nPosition Duties and Responsibilities  ", "\n  ", "\n1. Uses drawings, solid models, procedures, and specifications to create robust programs for contact and non-contact CMMs. Programs are used by Inspectors, Machine Operators, and other personnel.   ", "\n2. Perform periodic system verifications.  ", "\n3. Maintain 6S standards in the work area.  ", "\n4. Sets up and performs automated inspections of fabricated parts and tooling, using a coordinate measurement machine or other automated inspection equipment.  ", "\n  ", "\n5. Set-ups and performs mechanical and electronic dimensional inspection of various products.  ", "\n  ", "\n6. Performs in-process and final visual inspection of all product lines.  ", "\n  ", "\n7. Performs various laboratory tests including, but not limited to, surface roughness and hardness testing.  ", "\n  ", "\n8. Performs routine maintenance of equipment and tooling, including preventive maintenance and maintaining cleanliness of equipment and work area.  ", "\n  ", "\n9. Leads the development of new methods and techniques to improve processes and quality of products. Independently performs development activities to establish methods to produce a required product and material quality.  ", "\n  ", "\n10. Trains others in various inspection methods and techniques. ", "\n  ", "\nEducation: High school diploma or equivalent.  ", "\n  ", "\nExperience: 2 or more years experience programming DCC coordinate measurement machines to perform an automatic inspection of parts, based on GD&T drawings.  ", "\n2 or more years experience measuring components with manual dimensional measurement devices.  ", "\n  ", "\nKnowledge:  Able to read and understand 2D drawings and 3D solid models.  ", "\nUnderstand and apply GD&T  ", "\nShop Math  ", "\n  ", "\nSkills: Programming languages and CMMs.  ", "\n1. Hexagon Brown & Sharpe w/ TP-20 probe w/ PC-DMIS CAD++ 2014.1   ", "\n2. Hexagon Optiv Vision multi-sensor systems w/ PC-DMIS CAD++ 2016  ", "\n3. Zeiss Carmet with TP-6 probe w/ Calypso 4.2.   ", "\n4. Mycrona multi-sensor system w/ Geomatic  ", "\n5. QVI Smartscope w/ Measuremind 3.2 routines   ", "\n6. Keyence IM6000   ", "\n7. Oasis Optical Profile inspection system  ", "\n  ", "\nAbilities: Highly organized, self-motivated, and able to work under minimal supervision.  ", "\n Operate a computer workstation and related hardware and software.  ", "\n Set up and operate applicable machines, tools, and equipment.  ", "\n Read and interpret GD&T symbols and dimensional tolerances on drawings  ", "\n 20/20 Vision (uncorrected or corrected).   ", "\n Perform work in accordance with established procedures.  ", "\n Read, write, speak and comprehend the English.  ", "\n Manage multiple priorities, prioritize tasks, and adapt to frequently changing priorities and deadlines, and accept feedback.  ", "\n Stand, walk, climb stairs and travel throughout the facility on a regular basis  ", "\n Able to stand and bend to move product in and out of testing equipment. Able to lift 50lbs.   ", "\n Able to wear appropriate PPE, specifically hearing and/or eye protection, as needed    "], "images": ["https://images.craigslist.org/00A0A_8Ni6VFb007Z_600x450.jpg", "https://images.craigslist.org/00x0x_cw4bROXsTAP_600x450.jpg", "https://images.craigslist.org/01717_lsZhNKk8lJp_600x450.jpg", "https://images.craigslist.org/00M0M_10yi8WkawHs_600x450.jpg"], "type": "full-time"},
{"text": "Senior Systems Engineer", "date": "2019-08-19 13:36", "compensation": "DOE", "link": "https://sandiego.craigslist.org/csd/sad/d/san-diego-senior-systems-engineer/6960204314.html", "address": ["\n        ", "\nSummary: FIT Solutions is a fast-growing, highly successful CyberSecurity and IT Services firm based in San Diego, California, we partner with organizations nation wide. Our secret sauce is to couple state of the art technology and the best technical professionals to create the highest level of service in the industry. We make it our aim to create the best engineer environment possible so that everyone thrives and loves their job. ", "\n", "\nIn each of the last 7 years, we have doubled our size. How we deliver service is completely unique and changing our industry. We have leveraged our reputation and talent to help expand our services nationally. We have a knack for finding great people who want enjoyable, fulfilling, and competitively paid work.", "\n", "\nInterested in joining our Team? ", "\n", "\nApply Here: ", " ", "\n", "\nWhat You Get To Do:", "\n• Clearly and succinctly consult on all technical levels with decision makers. ", "\n• Expand existing relationships through proactive engineering consulting and problem-solving. ", "\n• Work with some of the most experienced engineers in the industry. ", "\n• Be a part of one of the fastest growing IT services companies in the US.", "\n", "\nWhat You Need To Succeed:", "\n• Self-starter and be able to work independently ", "\n• Must have excellent high-level engineering skills. ", "\n• Experienced in FIT Solutions minimum skill set (below)", "\n• Customer oriented, solid business acumen and excellent communication skills", "\n• Proven track record of performance against goals year over year.", "\n", "\nWhat's In It For You:", "\nOur culture is performance-oriented, goals driven, collaborative and fun. Our Engineers work together on all levels of challenges across dozens of clients, which provides each engineer full exposure to different environments and projects. We offer an industry leading salary that is based on experience and generous benefits including health, dental, and vision.", "\n ", "\nSpecific Responsibilities include, but are not limited to:", "\nAct as a subject matter expert for client environments and applications", "\nManage day-to-day IT initiatives ", "\nOnboard new clients according to standard procedures, documenting the clients' infrastructure for review and use by all engineering team members", "\nMake recommendations for improved processes, documentation and training to enhance client experience ", "\nAnalyze, troubleshoot and resolve technical problems (including networking/server, desktop support, etc.), both onsite and remote", "\nInstall, configure and maintain network elements, computer systems and other related equipment", "\nComplete monthly assessment on assigned clients", "\nConfigure and utilize monitoring tools to ensure uptime for client environments", "\nDocument daily work through ConnectWise ticketing system ", "\nParticipate in the on-call rotation with team", "\nProvide desk engineer services ", "\nSupport and assist assigned desk engineer on tickets and calls", "\nPerform sales engineering by designing solutions and technology business plans for clients", "\nPerform other duties as assigned ", "\nTechnical Skills/Competencies:", "\nExperience with mixed Windows and Mac desktop, and laptops with Windows Server and Active Directory 2008R2 or higher.", "\nVirtualization Technologies (VMWare 6.x or higher, Hyper-V, Citrix Xen server virtualization, etc.)", "\nExperience with NetApp, Nimble, Equallogic or similar", "\nNetworking Solutions including Cisco, HP Procure, Meraki, Dell, Rukus, and Sonicwall", "\nWindows Server 2008, 2012, and 2016", "\nCloud Solutions (vCloud, Azure, AWS)", "\nBackup solutions such as VEEAM, Zerto, and Datto", "\nExperience with Office 365, Sharepoint and OneDrive Business ", "\nChat solutions such as Slack and Lync", "\nExperience and exposure with various client line-of-business apps: ERP and accounting systems; financial services applications; medical and patient-care applications; document management systems; software development toolsets; engineering and 2D/3D CAD applications", "\nExperience with ConnectWise Manage, ConnectWise Automate (f.k.a. “Labtech”), IT Glue secure storage and knowledgebase, Cisco/Jabber voice communications, Slack chat, ZOOM conferencing, BOOMR time tracking, Smartsheet project planner, and Brightgauge performance monitoring", "\nDesktop support and user support ", "\nQualifications Include: ", "\nBachelor’s degree in Computer Science or related field and a minimum of 5 years of experience or Associate degree plus 7+ years of experience or (equivalent experience in lieu of education)", "\nCertifications preferred: MCSA, MCP, A+, Network+, CCNA, VCP (recent certification or recertification)", "\nAbility to work independently ", "\nKnowledge of IT best practices and ability to use best judgement to service clients’ needs", "\nRelationship building skills with customers and business partners", "\nAdaptability in various business cultures and environments", "\nAbility to effectively communicate both orally and in writing, with all levels of internal and external professionals, especially professionals with non-technical understanding ", "\n ", "\nTravel: Ability to travel up to 50%+ of the time to local client sites", "\nPhysical Demands:", "\nThe physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.  ", "\nEssential functions may require maintaining the physical condition necessary for sitting, walking or standing for prolonged periods of time; operating a computer and keyboard; near visual acuity to review written documentation; ability to hear and understand speech at normal room levels and on the telephone; manual dexterity to operate process equipment; lifting 25 pounds, bending and stooping; lifting computers; running network cables; connecting and testing networking; traveling to client sites; and walking and carrying devices on stairs and crawl spaces.", "\nWork Environment:", "\nThe work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this job. The noise level in the work environment is usually moderate. Employee may be exposed to heat, cold, sharp edges, metal racks, high voltage outlets, and normal electrical cabling in the office and closet environments. ", "\nEEO Statement", "\nFIT Solutions is an Equal Opportunity Employer and prohibits discrimination and harassment of any kind. We are committed to the principle of equal employment opportunity for all employees and to providing employees with a work environment free of discrimination and harassment. All employment decisions are based on business needs, job requirements and individual qualifications, without regard to race, color, religion or belief, national, social or ethnic origin, sex (including pregnancy), age, physical, mental or sensory disability, HIV status, sexual orientation, gender identity and/or expression, marital, civil union or domestic partnership status, past or present military service, family medical history or genetic information, family or parental status, or any other status protected by the laws or regulations in the locations where we operate. We will not tolerate discrimination or harassment based on any of these characteristics.    "], "images": [], "type": "full-time"},
{"text": "Structural Design Engineer I & II", "date": "2019-08-19 14:06", "compensation": "Based on Experience", "link": "https://sandiego.craigslist.org/csd/egr/d/san-diego-structural-design-engineer-ii/6960230190.html", "address": ["\n        ", "\nRA Structural Engineering of San Diego, Inc. is a design and consulting firm that has been delivering innovative, cost-effective engineering solutions for southern California's toughest small to mid-size structural and foundation projects since 2010. We specialize in analysis and design for commercial, mixed-used, and single/multi-family residential projects, as well as site and structural development projects, and have supported more than 700 projects at the design and planning stages of development.", "\n", "\nWe are seeking a Civil/Structural Engineering for full time position. ", "\nMinimum requirements are:", "\n", "\n- EIT ", "\n- Analysis and design of steel, concrete, wood, and masonry building structures and components", "\n- Communication of structural design through construction documents utilizing AutoCAD", "\n- Reading and understanding building codes, construction drawing and specification", "\n- Excellent Communication skills to work with clients, co-workers and other members of the design team", "\n", "\nCandidates must have a Bachelor of Science degree in Structural Engineering/Civil Engineering with an emphasis in structural from an ABET accredited institution with 0~4 years of experience in designing building structures, and must be able to legally work in the United States.", "\n", "\nAdditionally, candidates should have a strong working knowledge of and proficiency with AutoCAD,Microsoft Excel and building analysis and design software for steel, concrete, wood and masonry structural elements. Candidates should also have communication and organization skills, and should exhibit a high level of self-motivation and productivity.", "\n", "\nPlease submit a resume", "\n    "], "images": ["https://images.craigslist.org/00l0l_hNeCdo5BGjE_600x450.jpg", "https://images.craigslist.org/00Z0Z_c6iDNKYMeU7_600x450.jpg", "https://images.craigslist.org/01717_dAC9nUg0cZ3_600x450.jpg"], "type": "full-time"},
{"text": "SQL DBA / Developer", "date": "2019-08-22 10:59", "compensation": "competitive", "link": "https://sandiego.craigslist.org/csd/sof/d/san-diego-sql-dba-developer/6962329005.html", "address": ["\n        ", "\n***Please, no third parties***", "\n***There is no relocation assistance or employment sponsorship available***", "\n", "\n", "\nMain Duties and Responsibilities: ", "\n- Play an integral role with the development of new and maintenance of existing SQL Server database solutions (complex queries, stored procedures, triggers, etc.).", "\n- Build datawarehouse/reporting databases to better support queries that do not need real-time data.", "\n- Database administration tasks including backup/recovery, archiving, merge replication design and management, installing, configuring, and patching database servers.", "\n- Query performance management and tuning, dealing with performance problems, proactively monitor the database environment and to make changes to data structures, SQL, application logic or the DBMS subsystem to optimize performance.", "\n- Write SQL scheduled jobs to automate data driven tasks.", "\n- Identify, collect and integrate external data sources into data warehouse or other databases as appropriate.", "\n- Business intelligence (BI) and reports development.", "\n- Data access layer development and optimization.", "\n- Tools development including productivity tools, reports, and dashboards.", "\n- Other miscellaneous SQL production support and development tasks.", "\n", "\nSkills and Requirements:", "\n- 5+ years of experience with database development and administration leveraging SQL Server 2012 and higher.", "\n- Advanced reports development skills using SSRS.", "\n- Data integration experience using SSIS.", "\n- Experience with database schema creation and management.", "\n- Ability to translate a data model or logical database design into an actual physical database implementation.", "\n- Ability to analyze and recommend database improvements.", "\n- Ability to debug database issues on live data.", "\n- Ability to write complex database code including stored procedures, views, functions, etc.", "\n- Proven ability writing SQL scheduled jobs to automate data driven tasks.", "\n- Experience with Spotlight or other database monitoring tool.", "\n- Experience with PowerBI and/or Tableau is preferred.", "\n- Bachelors or Masters Degree in Computer Science or related field is preferred.", "\n", "\n", "\n", "\n", "\ntags: sql dba, sql database administrator, sql database engineer, database developer, sql developer, etl developer, bi developer    "], "images": [], "type": "contract"},
{"text": "Junior Designer", "date": "2019-08-22 14:52", "compensation": "paid internship or full time position, D.O.E", "link": "https://sandiego.craigslist.org/csd/egr/d/san-diego-junior-designer/6962525835.html", "address": ["\n        ", "\nEQUITY BUILDERS, INC - Junior Designer ", "\n", "\nThe Junior Designer, while working under the direct supervision of a Lead Design and Project Manager, performs a broad variety of tasks.", "\n", "\nSpecific Responsibilities: ", "\n", "\n- Under supervision, build and/or make updates to existing drawings and SketchUp Model(s)", "\n- Work with design team to develop design ideas and produce fabrication drawings", "\n- May assist Lead Designer in selecting fixtures, finishes, and equipment", "\n- Under supervision, develops conceptual design component/fabrication details", "\n- Assists in the development of drawings: layouts, fabrication specs, details, cut files, etc", "\n- Assists in the development of design packages complete with some cost estimating", "\n- Assists with the verification of site details to support design", "\n- Assists in sourcing & modeling fixtures, finishes, and equipment and their specifications to support design", "\n- Supports the team throughout construction process: may attend client meetings, provide documentation support, quickly drawing/modeling updates/changes, etc.", "\n", "\nQualifications:", "\n", "\n- Degree in Architecture, Interior Design, or related field (equivalent professional experience may be substituted)", "\n- 1+ year experience or equivalent educational experience related to restaurant interior design projects, tenant improvement, or custom fabrication.", "\n- Intermediate SketchUp skills - or willingness to learn", "\n- Ability to learn SketchUp (with strong AutoCAD/Revit/3DS Max or other modeling software skills, it's possible to quickly gain proficiency with our SketchUp process under some direction)", "\n- Ability to produce shop drawings (fabrication specs, .DWG/.DXF exports, PDF, vector, etc.", "\n- Adobe Creative Suite skills ( Illustrator, InDesign, Photoshop)", "\n- Excellent verbal and written communication skills in a Team Environment", "\n- Familiarity with Commercial Kitchen Sourcing & Specs.", "\n- Basic interior architecture detailing skills", "\n- Commitment to support projects in a fast-paced work environment", "\n- Please submit a portfolio or work examples with your application", "\n", "\n- Working Conditions:", "\n", "\n- In the Design/Build world trained designers must become familiar with processes of fabrication, installation, and progression of design through its' actual construction.  This fast-paced environment will require organizational skills and strong follow-through", "\n- Most of the time the Junior Designer will be sitting in an office with limited physical requirements.  this may require individuals to bend, stretch, twist or reach.  Occasionally, the Junior Designer will be required to visit a job site to perform site-verifications, measurements, and field surveys.    "], "images": [], "type": "full-time"},
{"text": "Digital Electrical Engineer", "date": "2019-08-26 08:15", "compensation": "depending upon expertise and experience", "link": "https://sandiego.craigslist.org/nsd/egr/d/vista-digital-electrical-engineer/6964932083.html", "address": ["\n        ", "\nRaveon Technologies is a small High-Tech company doing RF product development and is a manufacturing firm that provides wireless solutions to OEMs as well as marketing its own brand of data communication and GPS tracking products. See our products at www.raveon.com.  Our GPS tracking products are shown here:  www.ravtrack.com and   ", "\n", "\nWe undergo design efforts to continue our role as a leader in the RF Modem industry", "\n•\tSCADA and telemetry remote terminal units with wireless access", "\n•\tInnovating on our already industry-leading GPS tracking technologies", "\n•\tApplying our efficient protocols and networking knowledge to design and build new IoT devices and gateways. ", "\n•\tDesign new long-range narrow-band RF radios for secure and remote data communications. ", "\n", "\nPosition available:", "\nA position is available for a Hardware and Software Engineer to join the Engineering Team. The successful candidate will be a self-motivated engineer with knowledge of :", "\n    Embedded C code, Hardware design, CPUs, Voltage Regulators, Analog circuits, digital circuits, Mechanical Design ", "\n", "\nThis person can work in a self-guided agile development environment and thrives on overcoming challenges.", "\n", "\nOur Engineers take over a large variety of responsibility.  You will design new products and help update previous products with new features. Sometimes engineers work on improving previous features, both software and hardware.  ", "\n", "\nIn addition to superior software development knowledge, you should have a good understanding of electronics. It is expected that you will learn some concepts of RF communication and learn RF hardware circuit design. As such you will need to be a fast-learner, articulate and a good communicator. We do business with the DOD; therefore you must be a US citizen.", "\n", "\nResponsibilities include:", "\n•\tSoftware development for our products and Apps we sell. ", "\n•\tHardware development. Schematic design. Researching and finding great components. ", "\n•\tSystem testing design and implementing new features and hardware options. ", "\n•\tSoftware documentation and writing user manuals for products you work on", "\n•\tAssisting sales personnel with technical issues as needed ", "\n", "\nCandidate must have these skills, or please do not apply:", "\n•\tWriting documentation in English. ", "\n•\tWriting and compiling C  code. ", "\n•\tEmbedded CPU hardware design and software development. ", "\n•\tSelf-motivation and taking initiative. High functioning personality.", "\n•\tEnjoys engineering and product development. ", "\n", "\nOur other Desired Engineering Experience. If you have that will be great for us to utilize:", "\n•\t3+ years of software engineering is desired, but college graduate with experience is OK. ", "\n•\tC++ especially with a focus on web, networking, and Linux OS.", "\n•\tCAD design for simulation and drawing designs. ", "\n", "\nThese technologies are not mandatory, but", "\nif you have any of the following knowledge, that will help of and make it more likely we want to hire you:", "\n•\tEmbedded C code for ARM processors ", "\n•\tLinux Operating system expert. ", "\n•\tLoRa RF communications technology", "\n•\tAttractive and functional user interface design", "\n•\tDesign involving IP networking", "\n•\tFreeRTOS operating system expertise. ", "\n•\tVisual Basic ", "\n•\t.NET software (C++ or VB)", "\n•\tRF circuit design. RF data communications. ", "\n•\tSCADA, MODBUS, DNP3 protocols. ", "\n•\tTCPIP Data communications and software in STM32 processors. ", "\n•\tElectronic test equipment", "\n•\tMilitary wireless communications.", "\n•\tGIS and mapping technologies", "\n•\tSCADA system design and terminology", "\n•\tTechnical sales", "\n", "\nIf this opportunity excites you, please email a response with information about your expertise and career goals.", "\n    "], "images": [], "type": "full-time"},
{"text": "IT FIELD TECHNICIAN (Managed Services Engineer)", "date": "2019-08-27 08:45", "compensation": "Salaried position", "link": "https://sandiego.craigslist.org/csd/tch/d/san-diego-it-field-technician-managed/6965728065.html", "address": ["\n        ", "\nPlease apply through this link:  ", " ", "\n", "\nLogically (formally Winxnet and K & R Network Solutions) is a vibrant, growing and fast paced IT consulting firm. With over 140 employees and offices in four states we are seeking a candidate to join our field service team. If you have technical experience, a positive can-do attitude, and are customer-focused, this may be the right position for you. This position is located out of our San Diego, California office and will be servicing our customers in the San Diego area.", "\n", "\nThe Managed Services Engineer II (Field Technician) provides a wide range of technical support for client computing and information systems by performing installation, repair, and preventative maintenance on desktops, laptops, servers, networking devices, and related software. The Field Technician diagnoses mechanical, hardware, software and systems failures, using established procedures. He/she interacts with clients in a professional manner while addressing issues and concerns. As part of a team of field technicians, individuals document processes, procedures, and system baselines to provide consistent service to all clients. Technical Support Specialists work directly with the Tier 3 staff to support and facilitate project implementations. Responsibilities will include being assigned to support a specific client, group of clients, or multiple client sites as needed.", "\n", "\nThis position will provide advice and consultation to customers and management on individual requests for assistance, advice, and recommendations relating to application, computer, and network issues. Additionally, Technical Support Specialists employ systems analysis techniques and procedures, including consultation with clients, to determine hardware, software or system functional needs and, at times, address problems with those systems. Technical Support Specialists will assist, as various projects may dictate, in the design, development, documentation, analysis, creation, testing or modification of computer systems or programs, including the creation of pilot systems, based on client or system design specifications.", "\n", "\nResponsibilities", "\n• Provide regular maintenance and support for assigned clients.", "\n• Provide phone, onsite, and remote customer support as needed.", "\n• Work with dispatch for escalation on emergencies and tickets from Tier 1 or escalations to Tier 3 level support as needed.", "\n• Communicate and strategize with account managers on high priority problems, critical status changes, client matters, call aging and training.", "\n• Oversee status information updates based upon customer matters in the incident management system.", "\n• Communicate with and advise customers: informing them of progress and notifying them of impending changes or agreed outages, etc.", "\n• Manage status of all open tickets.", "\n• Update ticket with client response and time entry, per Logically policy.", "\n• Complete operational and procedural tasks supporting technical aspects of customer relationship.", "\n", "\nOccasionally, based upon client need and staff availability, all staff are expected to work after hours and weekends on scheduled projects and in emergency situations. This position also participates in a regular after hours on-call rotation schedule.", "\n", "\nThere will be driving involved-candidates must have their own car, valid driver's license, and insurance and must be willing to work at various customer locations.", "\n", "\nDesired Skills and Experience", "\nGeneral:", "\n• Have a positive attitude, be self-motivated, reliable and customer-focused.", "\n• Have excellent written and oral communication and interpersonal skills.", "\n• Ability to multi-task and adapt to changes quickly.", "\n• Proactively address customer needs using technical expertise, while understanding the scope and nature of the customers' engagement with Logically. ", "\n", "\nTechnical Experience:", "\n• High-level diagnostic and analytical skills with the ability identify and address an array of technical issues.", "\n• 3 - 5 years of IT technical experience", "\n• Support services for Microsoft-related technologies: Windows Server, Exchange, SQL, SharePoint, etc.", "\n• Technical services and support at the network level: WAN and LAN connectivity, routers, firewalls, and security.", "\n• Remote access solution implementation and support: VPN, Terminal Services, and Citrix.", "\n• Windows Desktop Operating Systems, including Windows XP, Windows 7, and Windows 8.", "\n• Workstation and laptop hardware support.", "\n• Backup software -- configuration experience with common data protection applications, including StorageCraft, Backup Exec, DPM, Windows NT Backup, etc.", "\n• Anti-Virus -- configuration experience with more than one A/V solution, including Sophos, MacAfee, Trend, Norton, etc.", "\n• Working knowledge of Active Directory.", "\n• Experience with Exchange is a plus.", "\n• Experience with virtualization is a plus.", "\n", "\nPhysical Demands", "\nThe following physical demands are required for this job with or without reasonable accommodations:", "\nLifting: Raising or lowering an object from one level to another (includes upward pulling) 25-50 lbs.", "\nCarrying: Transporting an object, usually holding it in the hands or arms, or on the shoulder", "\nStooping: Bending body downward and forward by bending spine at the waist, requiring full use of the lower extremities and back muscles", "\n", "\nLogically offers competitive benefits including medical/dental/vision, life insurance, tuition reimbursement, 401K plan with a match, paid holidays, paid vacation and much more.    "], "images": [], "type": "full-time"},
{"text": ".NET Developer", "date": "2019-08-27 13:34", "compensation": "competitive", "link": "https://sandiego.craigslist.org/nsd/sof/d/carlsbad-net-developer/6965994564.html", "address": ["\n        ", "\n***Please, no third parties***", "\n***Only Southern California candidates will be considered***", "\n", "\n", "\nMain Duties and Responsibilities:", "\n- Full-stack development leveraging Microsoft .NET web technologies, including ASP.NET, C#, SQL Server, JavaScript, etc.", "\n- Develop enterprise, commercial web applications for a dynamic and entrepreneurial company.", "\n- Participate in all tasks related to requirements gathering, risk analysis, unit testing, software implementation, maintenance, trouble-shooting, and deployment.", "\n- Collaborate with multiple teams throughout the organization, mentor less experienced team members, and participate in continual investigation of process improvement strategies.", "\n- Evaluation of emerging technologies and development recommendations for future product development.", "\n", "\nSkills and Requirements:", "\n- 4+ years of experience developing commercial software applications.", "\n- 2+ years of experience using C#, ASP.NET, and SQL Server.", "\n- Familiarity with AJAX, JavaScript, and HTML.", "\n- Strong knowledge of object-oriented programming (OOP) and engineering best practices.", "\n- Interest in collaborative development using Agile/Scrum methodologies", "\n- Proven ability and success making significant contributions throughout the software development lifecycle (SDLC).", "\n- Excellent written and verbal communication skills.", "\n- Ability to remain professional and effective while handling multiple tasks.", "\n- Bachelors or Masters Degree in Computer Science or related field is preferred.", "\n", "\n", "\n", "\ntags: .net developer, software engineer, sw engineer, programmer analyst, web developer, web application developer, web applications developer    "], "images": [], "type": "full-time"},
{"text": "Navigation and Positioning Engineer", "date": "2019-08-30 12:25", "compensation": "DOE", "link": "https://sandiego.craigslist.org/csd/sof/d/san-diego-navigation-and-positioning/6968090565.html", "address": ["\n        ", "\nAbout this Position", "\n", "\nSeeScan is searching for an experienced Navigation and Positioning Engineer to help drive the development of our next-generation utility locating and plumbing diagnostic equipment. With your extensive knowledge of MEMS sensors, you will help build our inertial navigation system for real-time use on utility locating devices, cameras, and other hardware. Working within Software Engineering, you will create shared libraries of navigation and positional algorithms.", "\n", "\nThis is an exciting opportunity for someone who thrives on challenge and is motivated to develop cutting-edge technology that solves real-world problems.", "\n", "\nResponsibilities", "\n", "\n•\tDevelop position estimation and inertial navigation algorithms for deployment on embedded and non-embedded systems", "\n•\tCollaborate with a team of engineers to develop ideas at a systems level", "\n•\tWork with MEMS sensors on our hardware", "\n•\tPost-process positions and orientations into our custom GIS system", "\n•\tCreate shared libraries of positional and navigational algorithms", "\n", "\nQualifications", "\n", "\n•\tStrong grasp of C/C++, including C++ 11 and 14", "\n•\tDemonstrated ability to leverage math against real-world problems using statistical techniques", "\n•\tExperience using MEMS sensors", "\n•\tKnowledge of common techniques like complementary filters and Kalman filters", "\n•\tExperience with neural networks / machine learning", "\n•\tAbility and drive to understand the root of problems ", "\n•\tScientific mindset and approach", "\n•\tHands-on attitude towards testing and data collection", "\n•\tExcellent communication skills and ability to collaborate", "\n", "\nOther Helpful Skills", "\n", "\n•\tExperience using Python and Matlab", "\n•\tFamiliarity with embedded platforms such as ARM", "\n•\tLinux experience", "\n", "\nEducation and Experience", "\n", "\n•\tPrior experience in navigation and positioning", "\n•\tBS, MS, or PhD in EE, CS, CE, or similar", "\n", "\nIf this application is of interest, please apply online at ", ". In your application, please include your resume and a thoughtful cover letter explaining why you are the ideal candidate for this position. We are looking for a long-term, in-house teammate to join us, not a contractor or consultant.", "\n", "\nAbout SeeScan", "\n", "\nModern life depends on the infrastructure that brings water, electricity, gas, and communications to our homes and businesses. SeeScan’s mission is to deliver best-of-class products that protect these vital services. We are an original equipment manufacturer in San Diego, CA that builds diagnostic and utility locating equipment from the ground up, from initial product conception to prototyping, testing, and final assembly.", "\n", "\nAt SeeScan, you’ll be part of a group of people who bring passion and energy into everything they do. We value the individual contributions all of our employees make, and invest in the tools and training they need to find success and professional growth. We do our best to empower the right people to take on new opportunities, and our culture promotes transparency, integrity, and continuous learning.", "\n", "\nVisit us at www.SeeScan.com to learn more about why SeeScan is a great place to work!", "\n", "\nNotes", "\n", "\n•\tNo recruiters, contractors, or consultants, please", "\n•\tNo relocation assistance or visa sponsorships available for this position", "\n•\tSeeScan is an Equal Opportunity Employer", "\n", "\n    "], "images": [], "type": "full-time"},
{"text": "Navigation and Positioning Engineer", "date": "2019-08-30 12:24", "compensation": "DOE", "link": "https://sandiego.craigslist.org/csd/egr/d/san-diego-navigation-and-positioning/6968090013.html", "address": ["\n        ", "\nAbout this Position", "\n", "\nSeeScan is searching for an experienced Navigation and Positioning Engineer to help drive the development of our next-generation utility locating and plumbing diagnostic equipment. With your extensive knowledge of MEMS sensors, you will help build our inertial navigation system for real-time use on utility locating devices, cameras, and other hardware. Working within Software Engineering, you will create shared libraries of navigation and positional algorithms.", "\n", "\nThis is an exciting opportunity for someone who thrives on challenge and is motivated to develop cutting-edge technology that solves real-world problems.", "\n", "\nResponsibilities", "\n", "\n•\tDevelop position estimation and inertial navigation algorithms for deployment on embedded and non-embedded systems", "\n•\tCollaborate with a team of engineers to develop ideas at a systems level", "\n•\tWork with MEMS sensors on our hardware", "\n•\tPost-process positions and orientations into our custom GIS system", "\n•\tCreate shared libraries of positional and navigational algorithms", "\n", "\nQualifications", "\n", "\n•\tStrong grasp of C/C++, including C++ 11 and 14", "\n•\tDemonstrated ability to leverage math against real-world problems using statistical techniques", "\n•\tExperience using MEMS sensors", "\n•\tKnowledge of common techniques like complementary filters and Kalman filters", "\n•\tExperience with neural networks / machine learning", "\n•\tAbility and drive to understand the root of problems ", "\n•\tScientific mindset and approach", "\n•\tHands-on attitude towards testing and data collection", "\n•\tExcellent communication skills and ability to collaborate", "\n", "\nOther Helpful Skills", "\n", "\n•\tExperience using Python and Matlab", "\n•\tFamiliarity with embedded platforms such as ARM", "\n•\tLinux experience", "\n", "\nEducation and Experience", "\n", "\n•\tPrior experience in navigation and positioning", "\n•\tBS, MS, or PhD in EE, CS, CE, or similar", "\n", "\nIf this application is of interest, please apply online at ", ". In your application, please include your resume and a thoughtful cover letter explaining why you are the ideal candidate for this position. We are looking for a long-term, in-house teammate to join us, not a contractor or consultant.", "\n", "\nAbout SeeScan", "\n", "\nModern life depends on the infrastructure that brings water, electricity, gas, and communications to our homes and businesses. SeeScan’s mission is to deliver best-of-class products that protect these vital services. We are an original equipment manufacturer in San Diego, CA that builds diagnostic and utility locating equipment from the ground up, from initial product conception to prototyping, testing, and final assembly.", "\n", "\nAt SeeScan, you’ll be part of a group of people who bring passion and energy into everything they do. We value the individual contributions all of our employees make, and invest in the tools and training they need to find success and professional growth. We do our best to empower the right people to take on new opportunities, and our culture promotes transparency, integrity, and continuous learning.", "\n", "\nVisit us at www.SeeScan.com to learn more about why SeeScan is a great place to work!", "\n", "\nNotes", "\n", "\n•\tNo recruiters, contractors, or consultants, please", "\n•\tNo relocation assistance or visa sponsorships available for this position", "\n•\tSeeScan is an Equal Opportunity Employer", "\n", "\n    "], "images": [], "type": "full-time"},
{"text": "Data Fusion Engineer", "date": "2019-08-30 12:27", "compensation": "DOE", "link": "https://sandiego.craigslist.org/csd/egr/d/san-diego-data-fusion-engineer/6968092247.html", "address": ["\n        ", "\nSeeScan is looking for a Data Fusion Engineer to play a critical role in the development of our utility locating equipment and custom utility mapping GIS system. You will be responsible for implementing innovative solutions that make our hardware and custom mapping system work together seamlessly, taking noisy data collected from our locating equipment and synthesizing it into useful forms. You will also work collaboratively on a team of engineers and develop ideas at a systems level.", "\n", "\nOur ideal candidate is a data expert with real-world experience using data fusion to solve problems.", "\n", "\nResponsibilities", "\n", "\n•\tWork alongside specialists in positioning and navigation, radio-based locating, web development, and embedded sensing to build software that integrates into a complete system", "\n•\tRefine raw data on the position, orientation, and other measurements of buried utilities into representations on our mapping platform", "\n•\tDevelop algorithms that calculate estimations of accuracy for utility positional information based on data from multiple sensors", "\n•\tIdentify problems with our data processing, and propose and help implement solutions", "\n", "\nQualifications", "\n", "\n•\tStrong grasp of C/C++, including C++ 11 and 14, is ideal", "\no\tAlternatively, strong grasp of another object-oriented programming language with the ability to quickly learn and begin developing with C/C++", "\n•\tExpert in statistics with a proven track record of problem solving using mathematics", "\n•\tSolid understanding of optimization techniques and/or clustering", "\n•\tWorks well in groups and highly self-motivated to solve problems", "\n•\tCapable of adapting quickly to changes", "\n", "\nOther Helpful Skills", "\n", "\n•\tExperience with Python and Matlab", "\n", "\nEducation and Experience", "\n", "\n•\tPrior experience working in data fusion", "\n•\tBS, MS, or PhD in EE, CS, CE, or similar", "\n", "\nIf this application is of interest, please apply online at ", ". In your application, please include your resume and a thoughtful cover letter explaining why you are the ideal candidate for this position. We are looking for a long-term, in-house teammate to join us, not a contractor or consultant.", "\n", "\nAbout SeeScan", "\n", "\nModern life depends on the infrastructure that brings water, electricity, gas, and communications to our homes and businesses. SeeScan’s mission is to deliver best-of-class products that protect these vital services. We are an original equipment manufacturer in San Diego, CA that builds diagnostic and utility locating equipment from the ground up, from initial product conception to prototyping, testing, and final assembly.", "\n", "\nAt SeeScan, you’ll be part of a group of people who bring passion and energy into everything they do. We value the individual contributions all of our employees make, and invest in the tools and training they need to find success and professional growth. We do our best to empower the right people to take on new opportunities, and our culture promotes transparency, integrity, and continuous learning.", "\n", "\nVisit us at www.SeeScan.com to learn more about why SeeScan is a great place to work!", "\n", "\nNotes", "\n", "\n•\tNo recruiters, contractors, or consultants, please", "\n•\tNo relocation assistance or visa sponsorships available for this position", "\n•\tSeeScan is an Equal Opportunity Employer", "\n", "\n    "], "images": [], "type": "full-time"},
{"text": "Data Fusion Engineer", "date": "2019-08-30 12:28", "compensation": "DOE", "link": "https://sandiego.craigslist.org/csd/sof/d/san-diego-data-fusion-engineer/6968092922.html", "address": ["\n        ", "\nSeeScan is looking for a Data Fusion Engineer to play a critical role in the development of our utility locating equipment and custom utility mapping GIS system. You will be responsible for implementing innovative solutions that make our hardware and custom mapping system work together seamlessly, taking noisy data collected from our locating equipment and synthesizing it into useful forms. You will also work collaboratively on a team of engineers and develop ideas at a systems level.", "\n", "\nOur ideal candidate is a data expert with real-world experience using data fusion to solve problems.", "\n", "\nResponsibilities", "\n", "\n•\tWork alongside specialists in positioning and navigation, radio-based locating, web development, and embedded sensing to build software that integrates into a complete system", "\n•\tRefine raw data on the position, orientation, and other measurements of buried utilities into representations on our mapping platform", "\n•\tDevelop algorithms that calculate estimations of accuracy for utility positional information based on data from multiple sensors", "\n•\tIdentify problems with our data processing, and propose and help implement solutions", "\n", "\nQualifications", "\n", "\n•\tStrong grasp of C/C++, including C++ 11 and 14, is ideal", "\no\tAlternatively, strong grasp of another object-oriented programming language with the ability to quickly learn and begin developing with C/C++", "\n•\tExpert in statistics with a proven track record of problem solving using mathematics", "\n•\tSolid understanding of optimization techniques and/or clustering", "\n•\tWorks well in groups and highly self-motivated to solve problems", "\n•\tCapable of adapting quickly to changes", "\n", "\nOther Helpful Skills", "\n", "\n•\tExperience with Python and Matlab", "\n", "\nEducation and Experience", "\n", "\n•\tPrior experience working in data fusion", "\n•\tBS, MS, or PhD in EE, CS, CE, or similar", "\n", "\nIf this application is of interest, please apply online at ", ". In your application, please include your resume and a thoughtful cover letter explaining why you are the ideal candidate for this position. We are looking for a long-term, in-house teammate to join us, not a contractor or consultant.", "\n", "\nAbout SeeScan", "\n", "\nModern life depends on the infrastructure that brings water, electricity, gas, and communications to our homes and businesses. SeeScan’s mission is to deliver best-of-class products that protect these vital services. We are an original equipment manufacturer in San Diego, CA that builds diagnostic and utility locating equipment from the ground up, from initial product conception to prototyping, testing, and final assembly.", "\n", "\nAt SeeScan, you’ll be part of a group of people who bring passion and energy into everything they do. We value the individual contributions all of our employees make, and invest in the tools and training they need to find success and professional growth. We do our best to empower the right people to take on new opportunities, and our culture promotes transparency, integrity, and continuous learning.", "\n", "\nVisit us at www.SeeScan.com to learn more about why SeeScan is a great place to work!", "\n", "\nNotes", "\n", "\n•\tNo recruiters, contractors, or consultants, please", "\n•\tNo relocation assistance or visa sponsorships available for this position", "\n•\tSeeScan is an Equal Opportunity Employer", "\n", "\n    "], "images": [], "type": "full-time"},
{"text": "Software Engineer, Windows OS", "date": "2019-08-26 14:15", "compensation": "DOE", "link": "https://sandiego.craigslist.org/csd/sof/d/san-diego-software-engineer-windows-os/6965275345.html", "address": ["\n        ", "\n", "    "], "images": [], "type": "full-time"},
{"text": "Senior Software Engineer, C#", "date": "2019-08-26 14:21", "compensation": "DOE", "link": "https://sandiego.craigslist.org/csd/sof/d/san-diego-senior-software-engineer/6965280057.html", "address": ["\n        ", "\n", "    "], "images": [], "type": "full-time"},
{"text": "Java Software Engineer", "date": "2019-08-30 09:49", "compensation": "DOE", "link": "https://sandiego.craigslist.org/csd/sof/d/san-diego-java-software-engineer/6967949483.html", "address": ["\n        ", "\nPEAK Technical Staffing is looking for a Java Software Engineer in San Diego, CA! ", "\n", "\nApplicants should have some of the following:", "\n•\tFour-year college degree in computer science, computer engineering or other related technical discipline, plus a minimum of five years of related experience or a master’s degree with at least three years of related experience.", "\n•\tExperience to include specification, design and development of software systems. Requires proficiency using programming languages such as Java, “C/C++/C#,” Product Lifecycle Management, graphics or other developmental software. ", "\n•\tMay require ability to develop software in a Unix, Windows Server 2003/2008/Vista/XP/Windows 7 and up, Integrated Development Environments (IDEs) or other PC environment. ", "\n", "\nFor immediate consideration, email resume to SteveGonzales@PEAKTechnical.com and then call Steve Gonzales at 760-696-9782. PEAK Technical pays a referral fee if you refer someone who gets hired and works for 30 days!", "\n    "], "images": [], "type": "full-time"},
{"text": "Software Engineer - Embedded Linux", "date": "2019-08-30 12:18", "compensation": "DOE", "link": "https://sandiego.craigslist.org/csd/sof/d/san-diego-software-engineer-embedded/6968084854.html", "address": ["\n        ", "\nSoftware Engineer – Embedded Linux", "\n", "\nSeeScan is currently seeking an experienced software engineer to work on cutting edge software for our plumbing diagnostic and utility locating equipment. In this position, you will work on a team of engineers to develop new features and improve existing software, ensuring our customers receive top-of-the-line products we’re known for.", "\n", "\nOur ideal candidate is a self-starter with a sharp eye for detail and ability to stay flexible as requirements change. This is an exciting opportunity for someone who wants to create innovative solutions to real-world problems. A person who is eager to work on a team that regularly pushes the envelope of its technical capabilities will thrive in this position.", "\n", "\nResponsibilities", "\n", "\n•\tDesign and implement software of embedded devices and systems, spanning from requirements to production and commercial deployment.", "\n•\tTest and debug system software.", "\n•\tIntegrate and validate new product designs.", "\n•\tParticipate in design reviews.", "\n•\tStay current with latest best practices, and identify opportunities for technology, tool, and process improvement.", "\n", "\nQualifications", "\n", "\n•\tHighly proficient in Linux.", "\n•\tExperience building embedded software in a team environment.", "\n•\tThorough knowledge of OS coding techniques, IP protocols, interfaces, and hardware subsystems.", "\n•\tFamiliarity with software configuration management tools, defect tracking tools, and peer review.", "\n•\tStrong documentation and writing skills.", "\n•\tCapable of changing course quickly in a fast-paced development environment.", "\n", "\nOther Helpful Skills", "\n", "\n•\tExperience building IoT devices including a thorough understanding of full stack technologies.", "\n•\tExperience working with Yocto.", "\n", "\nEducation and Experience", "\n", "\n•\tBS degree in computer science, computer engineering, or similar with relevant experience.", "\n•\t2 years’ experience in hands-on development and troubleshooting using Linux on embedded systems.", "\n", "\nIf this application is of interest, please apply online at ", ". In your application, please include your resume and a thoughtful cover letter explaining why you are the ideal candidate for this position. We are looking for a long-term, in-house teammate to join us, not a contractor or consultant.", "\n", "\nAbout SeeScan", "\n", "\nModern life depends on the infrastructure that brings water, wastewater, electricity, gas, and communications to our homes and businesses. SeeScan’s mission is to deliver best-of-class products that protect these vital services. We are an original equipment manufacturer in San Diego, CA that builds diagnostic and utility locating equipment from the ground up, from initial product conception to prototyping, testing, and final assembly.", "\n", "\nAt SeeScan, you’ll be part of a group of people who bring passion and energy into everything they do. We value the individual contributions all of our employees make, and invest in the tools and training they need to find success and professional growth. We do our best to empower the right people to take on new opportunities, and our culture promotes transparency, integrity, and continuous learning.", "\n", "\nVisit us at www.SeeScan.com to learn more about why SeeScan is a great place to work!", "\n", "\nNotes", "\n", "\n•\tNo recruiters, contractors, or consultants, please.", "\n•\tNo relocation assistance or visa sponsorships available for this position.", "\n•\tSeeScan is an Equal Opportunity Employer.", "\n", "\n    "], "images": [], "type": "full-time"}
]