[
{"text": "Sr. Software Engineer", "date": "2019-08-31 17:54", "compensation": "DOE", "link": "https://losangeles.craigslist.org/wst/tch/d/santa-monica-sr-software-engineer/6968956126.html", "address": ["\n        ", "\n\n\n\n", "\n    "], "images": [], "type": "full-time"},
{"text": "Developers Needed (Startup)", "date": "2019-08-08 21:39", "compensation": "1-2% Equity", "link": "https://losangeles.craigslist.org/lac/sof/d/los-angeles-developers-needed-startup/6952748053.html", "address": ["\n        ", "\nSTRYD is an early-stage start-up looking for a talented, results-oriented, and passionate developer to join our team! Our developers are building next-gen, game-changing SAAS platforms for event team management.", "\n", "\nThis is an entry-level position to grow as a software developer with experienced engineers at an exciting new company! You will learn the ins and outs of how our custom CRM, team management app and web portal system works, with the goal of both supporting and contributing to the development of these systems.", "\n", "\nAs a developer, you will be the focal point for venue and sales team experiences on both mobile and web platforms. You will work closely with senior management to understand business requirements that drive the analysis, design, integration, and development of quality technical solutions. You will be involved in the full systems life cycle and responsible for designing, coding, testing, implementing, maintaining and supporting application software, delivered on time.", "\n", "\n", "\nWhat You Will Be Doing", "\n- Work alongside the senior development team to build a fantastic product.", "\n- Build the foundation and execution for web and mobile back end.", "\n- Build real-time user interfaces", "\n- Be attentive to performance using tools to increase stability.", "\n", "\nWhat We're Looking For", "\n- 2+ Years development experience with web & mobile products", "\n- Experience in JavaScript, Angular", "\n- A plus - Experience with Azure, ReactNative, Ionic 3+, .NET / C#", "\n- Experience with REST APIs", "\n- Experience working with a team", "\n- Experience using GitHub", "\n- Works well in a fast-paced environment", "\n", "\nWhat's In It for You", "\n- Stock/equity options", "\n- Periodic team lunches", "\n- Flexible working hours", "\n- Exponential room for growth ", "\n- Start-up culture", "\n- Mentoring and on-going support ", "\n* Reminder, this is not a paid position. You will be compensated with equity in the company. Once we close our round of funding this will become a salaried position. ", "\n", "\nIf you're a team player with a strong Development understanding; looking to get in at the early stages of a disruptive new start-up, then STRYD is the place for you! As a team, we'll replace old customs with a new platform built around speed, reliability, and fairness. Help us reinvent the events industry!", "\n", "\nAt STRYD we value and respect all our team members, and we love people with grand ideas, passion, and dedication. If this sounds like you, and you're ready to embark on an exciting new journey, then we would love to hear from you today!", "\n", "\n*** If you have less experience then required above, but want to join our team, we are also looking for developer interns. Please reply with your resume and explain you are looking for the intern position    "], "images": ["https://images.craigslist.org/00R0R_8sftxiCKojl_600x450.jpg", "https://images.craigslist.org/00Z0Z_5lnlPHufhH1_600x450.jpg"], "type": "part-time"},
{"text": "QA Engineer (Burbank)", "date": "2019-08-09 10:29", "compensation": "D.O.E", "link": "https://losangeles.craigslist.org/lac/sof/d/burbank-qa-engineer-burbank/6953068420.html", "address": ["\n        ", "\nOur premier client is a top digital/online brands in the entertainment industry. Our Client's business dive deep into the things people care about across entertainment, technology, news, games, business and sports.", "\n", "\nQualifications needed:", "\n1. Strong knowledge of QA processes and concepts including test case preparation and testing methodologies ", "\n2. Experience working closely with a development team ", "\n3. Should be proficient in SQL and scripting complex SQL query. ", "\n4. Proficient in data migrations, integrations, functional testing ", "\n5. Strong knowledge of software QA methodologies, tools and processes ", "\n6. Experience working in an Agile/Scrum development process ", "\n7. Ability to work in a fast-paced, quickly changing environment ", "\n8. Strong Analytical skills - Cause and Effect Analysis ", "\n9. Hands-on experience with automated testing tools like selenium, junit and coding languages is a plus", "\n", "\nPreferred Qualifications\t", "\n* BA/BS Degree or equivalent experience", "\n* Experience functional QA engineer with experience rewriting SQL queries", "\n* Testing web based applications, writing SQL code", "\n* Testing tools in Selenium and Junit experience will be required ", "\n ", "\nThis a contract position upto 18 months and potentially can extend longer. Please submit resume with hourly rate requirements and NO H1B candidates at this time.    "], "images": [], "type": "contract"},
{"text": "QA Engineer (Selenium/SQL Exp)", "date": "2019-08-09 10:36", "compensation": "D.O.E", "link": "https://losangeles.craigslist.org/wst/sad/d/burbank-qa-engineer-selenium-sql-exp/6953074642.html", "address": ["\n        ", "\nQA Engineer with experience with automated testing tools like selenium, junit and coding languages is our choice of candidates. ", "\n", "\nOur premier client is a top digital/online brands in the entertainment industry. Our Client's business dive deep into the things people care about across entertainment, technology, news, games, business and sports.", "\n", "\nQualifications needed:", "\n1. Strong knowledge of QA processes and concepts including test case preparation and testing methodologies ", "\n2. Experience working closely with a development team ", "\n3. Should be proficient in SQL and scripting complex SQL query. ", "\n4. Proficient in data migrations, integrations, functional testing ", "\n5. Strong knowledge of software QA methodologies, tools and processes ", "\n6. Experience working in an Agile/Scrum development process ", "\n7. Ability to work in a fast-paced, quickly changing environment ", "\n8. Strong Analytical skills - Cause and Effect Analysis ", "\n9. Hands-on experience with automated testing tools like selenium, junit and coding languages is a plus", "\n", "\nPreferred Qualifications\t", "\n* BA/BS Degree or equivalent experience", "\n* Experience functional QA engineer with experience rewriting SQL queries", "\n* Testing web based applications, writing SQL code", "\n* Testing tools in Selenium and Junit experience will be required ", "\n", "\nThis a contract position upto 18 months and potentially can extend longer. Please submit resume with hourly rate requirements and NO H1B candidates at this time.    "], "images": [], "type": "contract"},
{"text": "Android Developer", "date": "2019-08-01 11:38", "compensation": "TBD", "link": "https://losangeles.craigslist.org/wst/sad/d/burbank-android-developer/6947283833.html", "address": ["\n        ", "\n*NO REMOTE CANDIDATES WILL BE CONSIDERED, THIS POSITION IS FOR IN OFFICE ONLY", "\n", "\n*NO RECRUITERS PLEASE", "\n", "\n", "\nOur team at MOBILE STYLES consists of headphone-slinging and dog walking developers, copywriters, artists, and designers who thrive on communication, openness, and bottomless cups of coffee and dirty chai. ", "\n", "\nResponsibilities:", "\n-\tWorking with our team of engineers to build and design mobile applications", "\n-\tBug fixing and improving application performance", "\n-\tContinuously evaluate and implement new technologies to maximize development efficiency.", "\n", "\nWe're looking for:", "\n-       Proven working experience in software development", "\n-       Must have experience in backend maintenance and deployment to be considered", "\n-       Working knowledge of the general mobile landscape, trends, architectures and emerging technologies", "\n-       4 years minimum of Java , Android SDK , Android Studio, experience.", "\n-       Strong OOP experience.", "\n-       RESTful API development experience.", "\n-       Experience with Stripe or similar payment SDK", "\n-       Experience with XML", "\n-       Experience with responsive UI (Constraint Layout preferred)", "\n-       At least one app in app store", "\n", "\n- Bonus points if you have:", "\n- Android NDK", "\n- Video/Image processing", "\n-Push notification", "\n-Swift experience", "\n- AWS", "\n- SQL and relation databases", "\n- Git", "\n", "\nPLEASE USE THE LINK BELOW TO APPLY:", "\n", "\n", "\n    "], "images": [], "type": "full-time"},
{"text": "IOS Developer", "date": "2019-08-01 11:39", "compensation": "TBD", "link": "https://losangeles.craigslist.org/lac/web/d/burbank-ios-developer/6947284946.html", "address": ["\n        ", "\n*NO REMOTE CANDIDATES WILL BE CONSIDERED; THIS POSITION IS FOR IN OFFICE ONLY.", "\nNO RECRUITERS PLEASE", "\n", "\nOur team consists of headphone-slinging and dog walking developers, copywriters, artists, and designers who thrive on communication, openness, and bottomless cups of coffee and dirty chai. We are looking for an IOS Developer with the following criteria:", "\n", "\nResponsibilities:", "\n", "\n-\tWorking with our team of engineers to build and design mobile applications", "\n-\tBug fixing and improving application performance", "\n-\tContinuously evaluate and implement new technologies to maximize development efficiency.", "\n", "\nWe're looking for:", "\n", "\n-\tProven working experience in software development", "\n-\tMust have experience in backend maintenance and deployment to be considered", "\n-\tWorking knowledge of the general mobile landscape, trends, architectures and emerging technologies", "\n-       4 years minimum of Swift, X-Code experience", "\n-       Strong OOP experience. Knowledge of Java", "\n-       RESTful API development experience.", "\n-       Experience with Stripe or similar payment SDK", "\n-       Ability to build UI without storyboard (in code)", "\n-       Experience with developing responsive UI", "\n-       At least one app in app store", "\n", "\nBonus points if you have:", "\n", "\n-\tVideo/Image processing", "\n-\tPush notification", "\n-\tObjective-C experience", "\n-\tAWS", "\n-\tSQL and relation databases", "\n-\tGit", "\n", "\nPLEASE USE THE LINK BELOW TO APPLY:", "\n", "\n", "\n    "], "images": [], "type": "full-time"},
{"text": "Free Tech Training and Optional Job Placement  - Make 80,000 - 120,000 per year,", "date": "2019-08-01 15:23", "compensation": "70,000 to 100,000", "link": "https://losangeles.craigslist.org/lac/web/d/los-angeles-free-tech-training-and/6947467443.html", "address": ["\n        ", "\n", "    "], "images": [], "type": "contract"},
{"text": "Technical Project Manager", "date": "2019-08-01 15:13", "compensation": "determined by experience and certifications", "link": "https://losangeles.craigslist.org/lac/sad/d/los-angeles-technical-project-manager/6947460967.html", "address": ["\n        ", "\nThe Technical Project Manager role is a technical leadership position that requires strong technical expertise in the full life cycle desktop development and deployment, including creating project plans, user interface planning, QA, testing and production deployment. The position requires excellent technical writing and communication skills. This role will interface directly with existing clients as well as new and prospective clients. It is expected that much of this role's day-to-day will be spent on-site at clients' offices either interfacing with client technical personnel or directing firm resources towards completion of project milestones. The Company has clients in greater LA and San Diego areas.", "\n", "\nResponsibilities:", "\n• Responsible for maintaining project schedule, milestones and tasks.", "\n• Documenting policy guidelines for Active Directory Group Policy structure over Desktops and Laptops", "\n• Documenting policies and procedures for the company desktop imaging solution", "\n• Participate in the development of long-term strategic goals for company application delivery systems, software and physical end point clients in collaboration with Desktop Infrastructure team members.", "\n• Document the planning, Implementation, management and support of application delivery systems that enable profile management and management of end user state application information to enhance an end user's productivity and provide an exceptional user experience.", "\n• Continually improve knowledge of current and latest technologies", "\n• Provide project milestones timelines for all desktop engineers", "\n• Coordinate with network engineering, business application, and database administration functions to implement, manage and support desktop/application delivery systems, such as SCCM, AppSense, Active Directory, Citrix XenApp/XenDesktop, Microsoft Terminal Services, etc. that utilize industry best practices to meet corporate objectives.", "\n• Review procedures, plans and implementation upgrade schedules to enterprise servers, Active Directory servers, desktop patches, network operating systems and LAN/WAN based applications that tie into the desktop image.", "\n• Review and document the deployment scheduling of new desktop/application delivery systems patches and software updates according to best practices.", "\n• Leverage existing change and problem management processes and tools to ensure accurate measurements and proper reporting are attainable. Generate monthly metrics / reports for operational review.", "\n• Work with the team to recommend hardware or software changes needed to optimize desktop delivery system deployments, configuration, or maintenance.", "\n", "\nQualifications:", "\n• At least 5 years' experience in a technical consulting or project management role.", "\n• Bachelor's degree or equivalent education in Information Technology, Computer Science, Software Development, or Engineering discipline.", "\n• 5-7 years' experience implementing, managing and supporting enterprise server based desktop computing platforms", "\n• Lead technical projects with elapsed time greater that 6-8 months", "\n• Ability to influence network, server, application and desktop support engineering peers and front line engineering management, service desk personnel and front line service desktop management, front line technical support personnel and management, vendor support personnel and end user", "\n• Ability to communicate effectively verbally and in writing to all levels of audience, both internal and external", "\n• Experience supporting large enterprise server based desktop computing environments, > 2,000 clients", "\n• Extensive knowledge of PC & Mac troubleshooting and network fundamentals", "\n• Extensive knowledge of Windows 7 operating systems", "\n• Thorough knowledge of Active Directory", "\n• 2-3 years' experience managing System Center Configuration Manager", "\n", "\nCertifications Preferred:", "\n• MCSE/MCITP", "\n• CCNA", "\n• PMP Certification", "\n• VMWare EXS (VCP)", "\n", "\nAbout the Company:", "\nWe are a technical consulting firm with offices in Los Angeles, San Diego, Omaha, Honolulu and Reno, with the main office in San Jose. We provide on-site tech support for a number of clients in real estate, education, health plans, county agencies and hi-tech industries.", "\n", "\nOur company offers 120 hours of PTO annually, company activities for fun and relaxation and 8 holidays per year. Our field staff wears sharp-looking shirts with our company logo and we provide the equipment and supervision needed for individual jobs. There is a large support infrastructure of meetings and conference calls, and company-paid training and certification is both expected and a benefit of employment. Medical, dental, chiropractic and vision benefits are offered after a probationary period of 30 days, with the company paying a fixed portion of the combined benefits. At company expense we offer life and disability insurance coverage. We temper hard work with off-site activities and a holiday event. Technical employees have opportunity for training, at company expense, for a variety of industry certifications.", "\n", "\nInitial interviewing for this position will be by telephone, followed by an in-person interview. On acceptance of an offer from the company, the candidate will be sent for live-scan fingerprinting as part of a company-paid state- and federal-level background check.  ", "\n", "\nWe honor and welcome our veterans and encourage applications from them.", "\n    "], "images": [], "type": "full-time"},
{"text": "SENIOR DRAFTERS & ARCHITECTS (LA & Valley)", "date": "2019-08-01 13:22", "compensation": "Competitive Salary + Commissions", "link": "https://losangeles.craigslist.org/sfv/egr/d/glendale-senior-drafters-architects-la/6947374700.html", "address": ["\n        ", "\nSENIOR DRAFTERS & ARCHITECTS (Multiple locations throughout California)", "\n", "\n•\tMin 15 years’ Experience", "\n•\tDrafting of complete construction plan sets (excluding Title 24 and engineering calcs)", "\n•\tDrafting MEP's (bonus but not required)", "\n•\tResidential:  Renovation, Additions, New Construction, ADUs", "\n•\tCommercial:  Tenant Improvements, Additions, New Construction", "\n•\tWork with clients", "\n•\tSelling / closing new agreements ", "\n•\tDesign sessions", "\n•\tEngineering details", "\n•\tSite Inspections", "\n•\tPermit Expediting / working with building departments", "\n•\tAutoCAD / Revit / Sketchup / Chief Architect", "\n", "\nLOCATIONS", "\n", "\nVideo of an SKSI location:  ", "\n", "\n•\tGlendale Galleria", "\n•\tOtay Ranch Town Center in Chula Vista", "\n•\tThe Shoppes at Carlsbad in Carlsbad", "\n•\tGalleria at Tyler in Riverside", "\n•\tValley Plaza Mall in Bakersfield", "\n•\tVisalia Mall in Visalia", "\n•\tSouthland Mall in Hayward", "\n•\tStonestown Mall in San Francisco", "\n•\tNorthridge Mall in Northridge", "\n•\tMeadows Mall in Las Vegas  ", "\n", "\nEXPECTATIONS", "\n", "\n•\tCreativity", "\n•\tCompletion", "\n•\tCompetence", "\n•\tCollaboration", "\n", "\nCOMPENSATION", "\n", "\n•\tSalary (competitive based on experience and skill)", "\n•\tCommissions", "\n", "\nABOUT SKSI", "\n", "\nVideo about SKSI:  ", "\n", "\nSKSI Plans and Permits (SKSI), the first National brand offering construction plans and permit expediting services announced nine new stores in California and Los Vegas for its innovative retail concept chain by the end of the year.", "\n", "\nSKSI Plans & Permits provides expert, fast, affordable and extremely accessible construction plans, engineering, Title 24 and permit expediting services for residential & commercial projects. SKSI helps builders, contractors, developers and property owners and managers save money and time without sacrificing quality by expediting planning and permitting for construction and property development.  SKSI’s proprietary processes include the use of custom-developed software that streamlines the design and permit processes.  ", "\n", "\nSKSI makes the process of creating and approving construction plans and permits extraordinary accessible and efficient for contractors, realtors and real estate investors, leasing companies and property managers, business and retail store owners, commercial landlords and homeowners. SKSI’s proprietary processes include the use of custom-developed software that streamlines the design and permit processes.  ", "\n", "\nCLIENT LIST INCLUDES", "\n", "\n•\tHomeowners", "\n•\tLeasing & management companies", "\n•\tBrookfield Properties", "\n•\tWestfield Malls", "\n•\tApple Stores", "\n•\tAMC Theaters", "\n•\tBloomingdales", "\n•\tMacy’s", "\n•\tVan’s", "\n•\tStarbucks", "\n•\tVictoria’s Secret", "\n•\tGold’s Gym", "\n•\tPanda Express", "\n•\t… about 500 other top brands", "\n", "\n", "\n    "], "images": ["https://images.craigslist.org/00W0W_52IsrwbYO0X_600x450.jpg", "https://images.craigslist.org/00303_gjwE28OZ3Lr_600x450.jpg", "https://images.craigslist.org/00o0o_7XGTlue7XLh_600x450.jpg", "https://images.craigslist.org/00D0D_7d8ndQMf7JD_600x450.jpg", "https://images.craigslist.org/00303_a1KfF4pnRCa_600x450.jpg"], "type": "full-time"},
{"text": "Senior Construction Project Manager", "date": "2019-08-12 10:15", "compensation": "$90,000 - 100,000 per annum base salary, full health care, performance bonus, flexible working.", "link": "https://losangeles.craigslist.org/lac/egr/d/marina-del-rey-senior-construction/6955042849.html", "address": ["\n        ", "\nWho are we?", "\n", "\nRooftop Cinema Club was founded in London, England in 2011, and since then we've travelled over to the United States and built alternative outdoor film experience venues on rooftops across New York, California, and Texas. \u2028", "\n", "\nWhy do we do what we do?", "\n", "\nWe believe that all experiences should be memorable, which is why we are on a mission to transform nights at the movies into cinematic events like no other. Driven by our love of film in alternative settings, our Rooftops promise a handpicked curation of cult classics, and new releases. We stand for Social Cinema because we believe it’s the future. Join our movement.", "\n", "\nWho we're looking for!", "\n", "\nWe’re seeking a Senior Project Manager with at least 5 years’ experience in a similar position to come and join our small team. A sound understanding of commercial/retail/hospitality architectural construction and permitting for indoor-outdoor hybrid spaces will be essential to this role. This is a full time role, in a 9am-6pm weekday office setting when not traveling or working remotely on projects. ", "\n ", "\nYour role will be to manage the end-to-end process of venue pitching and acquisition, to structural planning, permitting, to the management and overseeing of a team of architects, design, and production managers, through construction to completion on budget and within timeline scope. We have 8 concurrent projects spaces for 2020-21 that require a highly developed sense of how to plan and co-ordinate project resources and exceptional attention to detail. ", "\n", "\nYou must be presentable, smart, energetic, and proactive, and enjoy working in a close-knit team. Your base will be in our office working alongside the entire company and your schedule needs to be flexible and will require up to 40% travel in the year. It will also require some late nights and/or weekends coming close to opening. You must be local to Los Angeles.", "\n ", "\nWhat can we offer you for joining our small but mighty team?", "\n", "\nWe promise you a warm and enthusiastic environment with great team members who enjoy communicating and innovating together, plenty of creativity, and genuinely enjoy working with one another to build the best outdoor cinema experience possible.", "\n", "\n\u2028Compensation", "\n", "\nIn addition to your base salary of $90-100,000 per annum we offer performance related bonuses, full healthcare, paid time off, and flexible working initiatives.", "\n ", "\nYou will be responsible for:", "\n ", "\n- Conducting Site Planning and Compliance – oversee various site due diligence items leading up to acquisition of site.Client Management - meeting with and working with the city and potential landlords/clients to facilitate the agreement of new sites. You will manage all relationships between our business, the site, and all associated clients/people.", "\n- Permitting/Approvals – ensure timely obtainment of any and all required project permitting and approvals.", "\n- Developing and Reviewing Building Plans - review drawings, specs, and other project Documents – familiarization of all project documents.", "\n- Contract Administration – help ensure all contractual and permitting obligations are realized.", "\n- Project Scheduling – development, implementation, and management.", "\n- Project Coordination – source key team members per project in different locations (permit teams, architects, construction workers, designers, contractor/subcontractors, sub-consultants, vendors, etc.) Once the project is underway, you will visit our sites to monitor progress, oversee contractor activities, and work to eliminate delays and stay on budget.", "\n- Risk Management – anticipate and mitigate risks that arise during project execution phase.", "\n- Budget Development – work with the Real Estate Acquisitions Team to develop capital expenditure budgets for new projects.", "\n- Project Reporting – produce project specific reports in accordance with project demands and milestones.", "\n- Project Cost Control – track all committed, pending, and anticipated cost events while maintaining project budget.", "\n- Cost Event Negotiations – help ensure highest and best value is realized from design and construction professionals.", "\n- Invoice Review and Processing – review monthly pay apps to ensure all costs are fully substantiated and supported.", "\n- Quality Control and Assurance – help to ensure excellence in delivered product by ensuring conformance to project documents, company standards and branding.", "\n ", "\nOur ideal Senior Project Manager will possess:", "\n ", "\n* At least 5 of experience in project management for architectural projects, construction management, or similar", "\n* Drafting and engineering – experience with drafting building plans and blueprints", "\n* Extensive Project Management skills, with excellent high-level planning skills and understanding of best practices", "\n* experience with Architecture software (AutoCAD, ArchiCAD, Revit, SketchUP)", "\n* Proficiency with Project management tools (BQE Core, Asana, Deltek Ajera)", "\n* the attitude of a smart team-player.", "\n* High emotional intelligence with the ability to thrive in fast-paced, dynamic environments.", "\n    "], "images": [], "type": "full-time"},
{"text": "SENIOR DRAFTERS & ARCHITECTS (Glendale Galleria)", "date": "2019-08-06 05:09", "compensation": "Competitive Salary + Commission", "link": "https://losangeles.craigslist.org/sfv/egr/d/glendale-senior-drafters-architects/6950571496.html", "address": ["\n        ", "\nSENIOR DRAFTERS & ARCHITECTS ", "\n", "\nAre you a senior drafter or Architect with at least 15 years of experience? We have a great opportunity for you! ", "\n", "\nIntroducing SKSI PLANS & PERMITS, the first national brand in Architectural plans & building permits. ", "\n", "\nSKSI innovated a structure fusing the benefits and pride of being self-employed with security of working for a big company. We give you the most attractive high profile office, promote you, pay competitive wages and give you commissions on customers we supply you with. Your fully equipped high tech office will be inside the front entrance to the GLENDALE GALLERIA, and you will have use of any of our other offices and network of colleagues at 18+ fashion malls throughout the Southeast Region (we are quickly growing nationally). ", "\n", "\nVideo of an SKSI location: ", "\n", "\nLOCATIONS", "\n", "\n•\tValley Plaza Mall in Bakersfield", "\n•\tOtay Ranch Town Center in Chula Vista", "\n•\tGlendale Galleria", "\n•\tThe Shoppes at Carlsbad in Carlsbad", "\n•\tGalleria at Tyler in Riverside", "\n•\tVisalia Mall in Visalia", "\n•\tSouthland Mall in Hayward", "\n•\tStonestown Mall in San Francisco", "\n•\tNorthridge Mall in Northridge", "\n•\tMeadows Mall in Las Vegas ", "\n", "\nREQUIREMENTS", "\n", "\n•\tMin 15 years’ Experience", "\n•\tDrafting of complete construction plan sets (excluding Title 24 and engineering calcs)", "\n•\tDrafting MEP's (bonus but not required)", "\n•\tResidential: Renovation, Additions, New Construction, ADUs", "\n•\tCommercial: Tenant Improvements, Additions, New Construction", "\n•\tWork with clients", "\n•\tSelling / closing new agreements ", "\n•\tDesign sessions", "\n•\tEngineering details", "\n•\tSite Inspections", "\n•\tPermit Expediting / working with building departments", "\n•\tAutoCAD / Revit / Sketchup / Chief Architect", "\n", "\nEXPECTATIONS", "\n", "\n•\tIntegrity", "\n•\tCreativity", "\n•\tCompletion", "\n•\tCompetence", "\n•\tCollaboration", "\n•\tProfessionalism", "\n", "\nCOMPENSATION", "\n", "\n•\tSalary (competitive based on experience and skill)", "\n•\tCommissions", "\n", "\nABOUT SKSI", "\n", "\nVideo about SKSI: ", "\n", "\nSKSI Plans and Permits (SKSI), the first National brand offering construction plans and permit expediting services announced nine new stores in California and Los Vegas for its innovative retail concept chain by the end of the year.", "\n", "\nSKSI Plans & Permits provides expert, fast, affordable and extremely accessible construction plans, engineering, Title 24 and permit expediting services for residential & commercial projects. SKSI helps builders, contractors, developers and property owners and managers save money and time without sacrificing quality by expediting planning and permitting for construction and property development. SKSI’s proprietary processes include the use of custom-developed software that streamlines the design and permit processes. ", "\n", "\nSKSI makes the process of creating and approving construction plans and permits extraordinary accessible and efficient for contractors, realtors and real estate investors, leasing companies and property managers, business and retail store owners, commercial landlords and homeowners. SKSI’s proprietary processes include the use of custom-developed software that streamlines the design and permit processes. ", "\n", "\nCLIENT LIST INCLUDES", "\n", "\n•\tHomeowners", "\n•\tLeasing & management companies", "\n•\tBrookfield Properties", "\n•\tWestfield Malls", "\n•\tApple Stores", "\n•\tAMC Theaters", "\n•\tBloomingdales", "\n•\tMacy’s", "\n•\tVan’s", "\n•\tStarbucks", "\n•\tVictoria’s Secret", "\n•\tGold’s Gym", "\n•\tPanda Express", "\n•\t… about 500 other top brands    "], "images": ["https://images.craigslist.org/01414_aMVU8tcrT1v_600x450.jpg", "https://images.craigslist.org/00o0o_7XGTlue7XLh_600x450.jpg", "https://images.craigslist.org/00303_a1KfF4pnRCa_600x450.jpg", "https://images.craigslist.org/00D0D_7d8ndQMf7JD_600x450.jpg", "https://images.craigslist.org/00303_gjwE28OZ3Lr_600x450.jpg", "https://images.craigslist.org/00W0W_52IsrwbYO0X_600x450.jpg"], "type": "full-time"},
{"text": "Jr. Interior Designer/Drafting/3D Modeling", "date": "2019-08-13 00:27", "compensation": "$20/hour", "link": "https://losangeles.craigslist.org/wst/egr/d/beverly-hills-jr-interior-designer/6955520627.html", "address": ["\n        ", "\nWe are a Development and Construction Company specializing in high end custom homes and multi-family projects.", "\nLooking for a part time designer to work with our team and clients to do interior design, drafting, 3D modeling, and creating presentation quality renderings. ", "\nGreat gig for an architecture/interior design student or new graduate.  ", "\n", "\nRequirements:", "\nProficient with AutoCAD and at least 1 modeling software. Revit, 3D Studio, and Sketchup a big plus.", "\nFunctioning vehicle, valid CA driver’s license & insurance", "\nAbility to read architectural drawings", "\nWork in Los Angeles and Beverly Hills area. ", "\n", "\nThe position is currently as an independent contractor. Hours are flexible.", "\nIf interested, please forward a Portfolio and work samples along with your Resume", "\n    "], "images": [], "type": "part-time"},
{"text": "Technical Project Manager", "date": "2019-08-01 15:13", "compensation": "determined by experience and certifications", "link": "https://losangeles.craigslist.org/lac/bus/d/los-angeles-technical-project-manager/6947460965.html", "address": ["\n        ", "\nThe Technical Project Manager role is a technical leadership position that requires strong technical expertise in the full life cycle desktop development and deployment, including creating project plans, user interface planning, QA, testing and production deployment. The position requires excellent technical writing and communication skills. This role will interface directly with existing clients as well as new and prospective clients. It is expected that much of this role's day-to-day will be spent on-site at clients' offices either interfacing with client technical personnel or directing firm resources towards completion of project milestones. The Company has clients in greater LA and San Diego areas.", "\n", "\nResponsibilities:", "\n• Responsible for maintaining project schedule, milestones and tasks.", "\n• Documenting policy guidelines for Active Directory Group Policy structure over Desktops and Laptops", "\n• Documenting policies and procedures for the company desktop imaging solution", "\n• Participate in the development of long-term strategic goals for company application delivery systems, software and physical end point clients in collaboration with Desktop Infrastructure team members.", "\n• Document the planning, Implementation, management and support of application delivery systems that enable profile management and management of end user state application information to enhance an end user's productivity and provide an exceptional user experience.", "\n• Continually improve knowledge of current and latest technologies", "\n• Provide project milestones timelines for all desktop engineers", "\n• Coordinate with network engineering, business application, and database administration functions to implement, manage and support desktop/application delivery systems, such as SCCM, AppSense, Active Directory, Citrix XenApp/XenDesktop, Microsoft Terminal Services, etc. that utilize industry best practices to meet corporate objectives.", "\n• Review procedures, plans and implementation upgrade schedules to enterprise servers, Active Directory servers, desktop patches, network operating systems and LAN/WAN based applications that tie into the desktop image.", "\n• Review and document the deployment scheduling of new desktop/application delivery systems patches and software updates according to best practices.", "\n• Leverage existing change and problem management processes and tools to ensure accurate measurements and proper reporting are attainable. Generate monthly metrics / reports for operational review.", "\n• Work with the team to recommend hardware or software changes needed to optimize desktop delivery system deployments, configuration, or maintenance.", "\n", "\nQualifications:", "\n• At least 5 years' experience in a technical consulting or project management role.", "\n• Bachelor's degree or equivalent education in Information Technology, Computer Science, Software Development, or Engineering discipline.", "\n• 5-7 years' experience implementing, managing and supporting enterprise server based desktop computing platforms", "\n• Lead technical projects with elapsed time greater that 6-8 months", "\n• Ability to influence network, server, application and desktop support engineering peers and front line engineering management, service desk personnel and front line service desktop management, front line technical support personnel and management, vendor support personnel and end user", "\n• Ability to communicate effectively verbally and in writing to all levels of audience, both internal and external", "\n• Experience supporting large enterprise server based desktop computing environments, > 2,000 clients", "\n• Extensive knowledge of PC & Mac troubleshooting and network fundamentals", "\n• Extensive knowledge of Windows 7 operating systems", "\n• Thorough knowledge of Active Directory", "\n• 2-3 years' experience managing System Center Configuration Manager", "\n", "\nCertifications Preferred:", "\n• MCSE/MCITP", "\n• CCNA", "\n• PMP Certification", "\n• VMWare EXS (VCP)", "\n", "\nAbout the Company:", "\nWe are a technical consulting firm with offices in Los Angeles, San Diego, Omaha, Honolulu and Reno, with the main office in San Jose. We provide on-site tech support for a number of clients in real estate, education, health plans, county agencies and hi-tech industries.", "\n", "\nOur company offers 120 hours of PTO annually, company activities for fun and relaxation and 8 holidays per year. Our field staff wears sharp-looking shirts with our company logo and we provide the equipment and supervision needed for individual jobs. There is a large support infrastructure of meetings and conference calls, and company-paid training and certification is both expected and a benefit of employment. Medical, dental, chiropractic and vision benefits are offered after a probationary period of 30 days, with the company paying a fixed portion of the combined benefits. At company expense we offer life and disability insurance coverage. We temper hard work with off-site activities and a holiday event. Technical employees have opportunity for training, at company expense, for a variety of industry certifications.", "\n", "\nInitial interviewing for this position will be by telephone, followed by an in-person interview. On acceptance of an offer from the company, the candidate will be sent for live-scan fingerprinting as part of a company-paid state- and federal-level background check.  ", "\n", "\nWe honor and welcome our veterans and encourage applications from them.", "\n    "], "images": [], "type": "full-time"},
{"text": "QA Engineer (Selenium/SQL Exp)", "date": "2019-08-14 08:08", "compensation": "D.O.E", "link": "https://losangeles.craigslist.org/wst/sad/d/burbank-qa-engineer-selenium-sql-exp/6956420288.html", "address": ["\n        ", "\nQA Engineer with experience with automated testing tools like selenium, junit and coding languages is our choice of candidates. ", "\n", "\nOur premier client is a top digital/online brands in the entertainment industry. Our Client's business dive deep into the things people care about across entertainment, technology, news, games, business and sports.", "\n", "\nQualifications needed:", "\n1. Strong knowledge of QA processes and concepts including test case preparation and testing methodologies ", "\n2. Experience working closely with a development team ", "\n3. Should be proficient in SQL and scripting complex SQL query. ", "\n4. Proficient in data migrations, integrations, functional testing ", "\n5. Strong knowledge of software QA methodologies, tools and processes ", "\n6. Experience working in an Agile/Scrum development process ", "\n7. Ability to work in a fast-paced, quickly changing environment ", "\n8. Strong Analytical skills - Cause and Effect Analysis ", "\n9. Hands-on experience with automated testing tools like selenium, junit and coding languages is a plus", "\n", "\nPreferred Qualifications\t", "\n* BA/BS Degree or equivalent experience", "\n* Experience functional QA engineer with experience rewriting SQL queries", "\n* Testing web based applications, writing SQL code", "\n* Testing tools in Selenium and Junit experience will be required ", "\n", "\nThis a contract position upto 18 months and potentially can extend longer. Please submit resume with hourly rate requirements and NO H1B candidates at this time.    "], "images": [], "type": "contract"},
{"text": "Full-Stack VP Software Engineering (Blockchain)", "date": "2019-08-14 16:23", "compensation": "DOE", "link": "https://losangeles.craigslist.org/lac/sof/d/los-angeles-full-stack-vp-software/6956838252.html", "address": ["\n        ", "\nOur Mission: ", "\nOur team is passionate about using technology to advance local sustainable manufacturing supply chains increasing accessibility and transparency working to solve a variety of new and unique challenges, creating new products. We move quickly, use data to drive our decisions, and deliver products and analytics to manufacturing professionals around the world.", "\n", "\nAbout You:", "\nYou need to be passionate about leveraging blockchain and software technology solutions to help solve the problems of manufacturers Large , Medium and Small from C-Suite executives to the Shop Floor assembly line. ", "\n", "\nThe Expertise We’re Looking For", "\nMust be a Full Stack Software and ideally Blockchain Engineer as well fluent in Javascript, C++, Node.js, React, Ethereum, Solidity, Hyperledger, GoLang. Must have impeccable technical documentation skills. A degree in Computer Science / Information Science or equivalent work experience ideally also with mechanical engineering background. Have practical experience developing on public blockchain platforms such as Bitcoin or Ethereum, and/or experience with private blockchain platforms Hyperledger Fabric. Experience working with cryptographic protocols and Contributions to open source projects (especially Blockchain-related ones) using smart contracts.", "\n", "\nThe Purpose of Your Role", "\n", "\nWe are looking for a talented Senior Software Engineer to develop supply chain applications using Blockchain technology like Ethereum, Hyperledger and other leading public or private blockchain solutions along with the web application interface and interlay.", "\n", "\nThe Skills You Bring", "\nMastery of JavaScript, Node.JS, React, C++, Rust, Go, Golang, and Python", "\nFirm grasp of the cryptographic principles underpinning Ethereum", "\nHave exceptional written and verbal communication skills", "\nHave a passion for blockchain development", "\nHave an adversarial mindset: be just as good at breaking code as creating it", "\nExperience of working with design thinking techniques in iterative sprints (Agile)", "\nHave a collaborative mind set and enjoy sharing knowledge with other developers", "\nOne or more of:", "\nKnowledge or experience with technologies using state/payment channels or Sidechains", "\nExperience with private blockchain projects (permissioned distributed ledgers)", "\n", "\nThe Value You Deliver", "\nWrite Blockchain scripts and Ethereum smart contracts", "\nRapidly develop enterprise software applications and platforms using Blockchain technologies. Provide technical leadership on Blockchain technologies.", "\nWork across peer groups to develop Blockchain solutions for the business", "\n", "\nTeam player who is a fast learner with a strong work ethic. Self starter, interest in manufacturing and product development, avid reader, thoughtful and creative! Former founders are especially welcome to apply! This position has room for growth.", "\n", "\nIf you join our team, you will work on projects that really matter to real people, while developing your own potential, and having a lot of fun.", "\n", "\nDescription:", "\n", "\nWe are specifically looking for \"mid-senior\" (5-7 years) full-stack blockchain software Javascript, C++, Node.js, Ethereum, Hyperledger engineers in Los Angeles. Ideal candidates will have some exposure to Manufacturing ERP environments and be comfortable working across the front and backend of the platform with JavaScript, Node.js/Node/NodeJS, React, Redux, Mongo/MongoDB and AWS. While ideally seeking engineers experienced in all of these technologies, we are open to agnostic, dynamic developers who’ve developed consumer-facing applications with other modern, web-based, object-oriented technologies. Successful candidates will have phenomenal communication skills and have worked successfully as part of an established engineering team.", "\n", "\nMust Have:", "\n", "\n5-7+ years of professional engineering experience", "\n", "\nTech: C++, JavaScript, React, Redux, Node.JS, RUST, GoLang, Ethereum, Hyperledger and MongoDB", "\n", "\nFull Stack Experience", "\n", "\nB.S in Computer Science or related", "\n", "\nPlus:", "\n", "\nExperience with Amazon Web Services (AWS)", "\n", "\nM.S. in Computer Science or related", "\n", "\nIdeally you have worked in an ERP environment and are thoroughly familiar with manufacturing ERP. You will collaborate closely with product and vendors and customers to improve the end product and assist the Team to increase revenue based on user feedback, as well as soliciting and managing product enhancement requests from Sales, Business Development and Operations. Our platform will be securely pooling and collateralizing data for analytics optimization and MLAI for Smart Manufacturing across industry and product.", "\n", "\nWhat’s in it for you:", "\n", "\nBe part of building the engineering department within an innovative company.", "\nBuild a product from the ground up.", "\nWork with a highly motivated and passionate team to build the future of the Manufacturing and Aerospace industry. Awesome work environment!    "], "images": ["https://images.craigslist.org/00z0z_154hMDWGa0k_600x450.jpg", "https://images.craigslist.org/00303_f4zClSFbfP1_600x450.jpg", "https://images.craigslist.org/00u0u_krwCRNoI49e_600x450.jpg"], "type": "contract"},
{"text": "Android Developer", "date": "2019-08-29 14:56", "compensation": "TBD", "link": "https://losangeles.craigslist.org/wst/sad/d/burbank-android-developer/6967502056.html", "address": ["\n        ", "\n*NO REMOTE CANDIDATES WILL BE CONSIDERED, THIS POSITION IS FOR IN OFFICE ONLY", "\n", "\n*NO RECRUITERS PLEASE", "\n", "\n", "\nOur team at MOBILE STYLES consists of headphone-slinging and dog walking developers, copywriters, artists, and designers who thrive on communication, openness, and bottomless cups of coffee and dirty chai. ", "\n", "\nResponsibilities:", "\n-\tWorking with our team of engineers to build and design mobile applications", "\n-\tBug fixing and improving application performance", "\n-\tContinuously evaluate and implement new technologies to maximize development efficiency.", "\n", "\nWe're looking for:", "\n-       Proven working experience in software development", "\n-       Must have experience in backend maintenance and deployment to be considered", "\n-       Working knowledge of the general mobile landscape, trends, architectures and emerging technologies", "\n-       4 years minimum of Java , Android SDK , Android Studio, experience.", "\n-       Strong OOP experience.", "\n-       RESTful API development experience.", "\n-       Experience with Stripe or similar payment SDK", "\n-       Experience with XML", "\n-       Experience with responsive UI (Constraint Layout preferred)", "\n-       At least one app in app store", "\n", "\n- Bonus points if you have:", "\n- Android NDK", "\n- Video/Image processing", "\n-Push notification", "\n-Swift experience", "\n- AWS", "\n- SQL and relation databases", "\n- Git", "\n", "\nPLEASE USE THE LINK BELOW TO APPLY:", "\n", "\n", "    "], "images": [], "type": "full-time"},
{"text": "SENIOR DRAFTERS & ARCHITECTS (Glendale Galleria)", "date": "2019-08-15 19:19", "compensation": "Competitive Salary + Commission", "link": "https://losangeles.craigslist.org/sfv/egr/d/glendale-senior-drafters-architects/6957639547.html", "address": ["\n        ", "\nSENIOR DRAFTERS & ARCHITECTS ", "\n", "\nAre you a senior drafter or Architect with at least 15 years of experience? We have a great opportunity for you! ", "\n", "\nIntroducing SKSI PLANS & PERMITS, the first national brand in Architectural plans & building permits. ", "\n", "\nSKSI innovated a structure fusing the benefits and pride of being self-employed with security of working for a big company. We give you the most attractive high profile office, promote you, pay competitive wages and give you commissions on customers we supply you with. Your fully equipped high tech office will be inside the front entrance to the GLENDALE GALLERIA, and you will have use of any of our other offices and network of colleagues at 18+ fashion malls throughout the Southeast Region (we are quickly growing nationally). ", "\n", "\nVideo of an SKSI location: ", "\n", "\nLOCATIONS", "\n", "\n•\tValley Plaza Mall in Bakersfield", "\n•\tOtay Ranch Town Center in Chula Vista", "\n•\tGlendale Galleria", "\n•\tThe Shoppes at Carlsbad in Carlsbad", "\n•\tGalleria at Tyler in Riverside", "\n•\tVisalia Mall in Visalia", "\n•\tSouthland Mall in Hayward", "\n•\tStonestown Mall in San Francisco", "\n•\tNorthridge Mall in Northridge", "\n•\tMeadows Mall in Las Vegas ", "\n", "\nREQUIREMENTS", "\n", "\n•\tMin 15 years’ Experience", "\n•\tDrafting of complete construction plan sets (excluding Title 24 and engineering calcs)", "\n•\tDrafting MEP's (bonus but not required)", "\n•\tResidential: Renovation, Additions, New Construction, ADUs", "\n•\tCommercial: Tenant Improvements, Additions, New Construction", "\n•\tWork with clients", "\n•\tSelling / closing new agreements ", "\n•\tDesign sessions", "\n•\tEngineering details", "\n•\tSite Inspections", "\n•\tPermit Expediting / working with building departments", "\n•\tAutoCAD / Revit / Sketchup / Chief Architect", "\n", "\nEXPECTATIONS", "\n", "\n•\tIntegrity", "\n•\tCreativity", "\n•\tCompletion", "\n•\tCompetence", "\n•\tCollaboration", "\n•\tProfessionalism", "\n", "\nCOMPENSATION", "\n", "\n•\tSalary (competitive based on experience and skill)", "\n•\tCommissions", "\n", "\nABOUT SKSI", "\n", "\nVideo about SKSI: ", "\n", "\nSKSI Plans and Permits (SKSI), the first National brand offering construction plans and permit expediting services announced nine new stores in California and Los Vegas for its innovative retail concept chain by the end of the year.", "\n", "\nSKSI Plans & Permits provides expert, fast, affordable and extremely accessible construction plans, engineering, Title 24 and permit expediting services for residential & commercial projects. SKSI helps builders, contractors, developers and property owners and managers save money and time without sacrificing quality by expediting planning and permitting for construction and property development. SKSI’s proprietary processes include the use of custom-developed software that streamlines the design and permit processes. ", "\n", "\nSKSI makes the process of creating and approving construction plans and permits extraordinary accessible and efficient for contractors, realtors and real estate investors, leasing companies and property managers, business and retail store owners, commercial landlords and homeowners. SKSI’s proprietary processes include the use of custom-developed software that streamlines the design and permit processes. ", "\n", "\nCLIENT LIST INCLUDES", "\n", "\n•\tHomeowners", "\n•\tLeasing & management companies", "\n•\tBrookfield Properties", "\n•\tWestfield Malls", "\n•\tApple Stores", "\n•\tAMC Theaters", "\n•\tBloomingdales", "\n•\tMacy’s", "\n•\tVan’s", "\n•\tStarbucks", "\n•\tVictoria’s Secret", "\n•\tGold’s Gym", "\n•\tPanda Express", "\n•\t… about 500 other top brands    "], "images": ["https://images.craigslist.org/01414_aMVU8tcrT1v_600x450.jpg", "https://images.craigslist.org/00o0o_7XGTlue7XLh_600x450.jpg", "https://images.craigslist.org/00303_a1KfF4pnRCa_600x450.jpg", "https://images.craigslist.org/00D0D_7d8ndQMf7JD_600x450.jpg", "https://images.craigslist.org/00303_gjwE28OZ3Lr_600x450.jpg", "https://images.craigslist.org/00W0W_52IsrwbYO0X_600x450.jpg"], "type": "full-time"},
{"text": "Sr. Software Engineer", "date": "2019-08-01 17:55", "compensation": "DOE", "link": "https://losangeles.craigslist.org/wst/tch/d/santa-monica-sr-software-engineer/6947558133.html", "address": ["\n        ", "\n\n\n\n", "\n    "], "images": [], "type": "full-time"},
{"text": "Architectural Lighting Designer", "date": "2019-08-21 10:21", "compensation": "Compensation comensurate with experience. We offer great benefits-Medical, Dental, Vision, flexible workschedule, 401(k) and profit sharing plans", "link": "https://losangeles.craigslist.org/wst/egr/d/el-segundo-architectural-lighting/6961547930.html", "address": ["\n        ", "\nKGM Architectural Lighting- We are doing great projects around the world with remarkable clients, and have a great group of exceptional Designers. We continue to grow and are looking for talented passionate designers to join our team. Experience in Architecture, Interior Design or Lighting Design firms are required.", "\n", "\nYou will develop lighting designs and schematics for large-scale integrated architectural, landscape, & urban projects involving daylighting and electric lighting through analysis of architectural spaces.  Our Designers performs light-level and energy consumption calculations, simulations, and detailed analysis of electric lighting, sunlight and energy use.  ", "\n", "\nIntermediate experience in CADS and Revit for building Information in both 2-D and 3-D architectural software, \tCreate plans illustrating the design of an aesthetically balanced environment and conducts research to compare different designs in addition to developing presentations and documentation of potential lighting design solutions, including sketches, renderings, detailed calculations, lighting layouts, controls and energy/budget analysis to present design options to client team.", "\n", "\nIf you have an outgoing personality, like working in a team and with clients you may be a great fit.  We offer dynamic work environment and career development opportunities.", "\n", "\n    "], "images": [], "type": "full-time"},
{"text": "CIVIL, Electrical & Mechanical Engineers - All Levels", "date": "2019-08-26 01:09", "compensation": "Dependent on experience level; Full time with benefits, healthcare, 401k", "link": "https://losangeles.craigslist.org/lac/egr/d/los-angeles-civil-electrical-mechanical/6964763352.html", "address": ["\n        ", "\n", "  ", "\n ", "  ", "  \n  ", "\n\nWe have positions for:  CAD Designer,   Project Engineer, Licensed Engineers,  Project Manager for Structural Engineers, Electrical Engineer, Mechanical Engineer, & Land Surveyors   ", " ", "\n\n\nFor CONFIDENTIAL CONSIDERATION: ", "\nEmail your resume to: jobs@trabucogroup.com \n", " ", "\nFor full list of Engineering positions, visit us at: ", "    "], "images": ["https://images.craigslist.org/00909_3HfJpygSmf9_600x450.jpg", "https://images.craigslist.org/00Y0Y_7FbOIsehvH2_600x450.jpg", "https://images.craigslist.org/00V0V_1XwzjcyU0FQ_600x450.jpg", "https://images.craigslist.org/00q0q_e3jjxRHrFJG_600x450.jpg", "https://images.craigslist.org/01111_aj23sDEOWmN_600x450.jpg", "https://images.craigslist.org/00x0x_amsvjt63tUR_600x450.jpg", "https://images.craigslist.org/00C0C_3ouc05ItqRK_600x450.jpg", "https://images.craigslist.org/00L0L_dxqgiYud6vJ_600x450.jpg", "https://images.craigslist.org/00909_4npqDFanL7x_600x450.jpg", "https://images.craigslist.org/00p0p_3qJZnXkVFoz_600x450.jpg", "https://images.craigslist.org/00G0G_6y9gnLSqcel_600x450.jpg", "https://images.craigslist.org/00y0y_dExli0uP4SD_600x450.jpg", "https://images.craigslist.org/00Y0Y_cEpigprK6xc_600x450.jpg", "https://images.craigslist.org/00N0N_iTQ1cFxkZwe_600x450.jpg", "https://images.craigslist.org/01717_5OlyBmkOBuF_600x450.jpg", "https://images.craigslist.org/00a0a_drf409kow45_600x450.jpg", "https://images.craigslist.org/00s0s_5ULF13MvOda_600x450.jpg", "https://images.craigslist.org/00B0B_dSMZqXJs5Iz_600x450.jpg"], "type": "full-time"},
{"text": "Cannon is Hiring a Water Resources Principal Engineer (LA)", "date": "2019-08-27 10:59", "compensation": "DOE", "link": "https://losangeles.craigslist.org/lgb/egr/d/los-angeles-cannon-is-hiring-water/6965855935.html", "address": ["\n        ", "\n", "\n", "\n", "\n\t", "\n", "\n", "\n", " provides exciting opportunities for professional growth and outlets for team building. We strive to provide opportunity for personal growth and a balance between personal and professional life. Not only do we work together, but we also enjoy spending time together outside of work. We work hard. We play hard. We have fun.", "\n", "\n", " we have provided creative solutions to clients in the energy industry, water resources, public infrastructure, and commercial and residential development. With offices throughout California, we continue to grow!  ", "\n", "\n", " a ", " for our ", " office. West Los Angeles is known for its many popular recreational opportunities and our office is conveniently located adjacent to the Expo MetroLink Commuter line.", "\n", "\n", " Wastewater Treatment Facilities * Collection Facilities * Water Distribution Systems * Water Treatment Plants * Storm Drainage Collection Systems and Facilities * Water Main Replacements * Potable Water Pump Stations and Reservoirs.", "\n", "\n", " supporting and managing projects for our water and wastewater clients in [Southern / Central] California.  Prepares plan specifications and cost estimates related to water and wastewater infrastructure projects including: master planning and hydraulic modeling, distribution and collection system design including pipelines, pump stations, reservoirs, hydraulic structures and water/wastewater treatment facilities. Mentors young engineers. Primary interface with clients on project coordination and design and follow-up to ensure quality standards are met, efficiency levels are maintained, and client satisfaction, respect and confidence are assured. For a detailed description on job duties, visit www.CannonCorp.us and click on \"Careers\".", "\n", "\n", "\n•\tRequires a BS Degree in Civil Engineering or Environmental Engineering.  An MS Degree in Water Resources or Environmental Engineering highly desirable.  ", "\n•\tRequires a California P.E. license in Civil Engineering.", "\n•\tRequires 8 years' experience in water treatment and/or wastewater treatment, engineering analysis, and design of water distributions and wastewater collection facilities.", "\n•\tCentral and/or Southern California professional Water Resources network is strongly desired.", "\n•\tExperience in project management and managing strong client relations. ", "\n•\tExperience in managing design teams with minimal supervision. ", "\n•\tExperience with diverse hydraulic modeling software platforms such as Innovyze, BioWin, and Bentley.", "\n•\tWorking knowledge of AutoCAD, Civil 3D, ArcGIS, and other design software. ", "\n•\tSuccessful candidate will be a self-motivated individual with a good sense of priority, and interpersonal and communication skills - both written and verbal.", "\n", "\n", " competitive salaries, relocation assistance, an excellent benefits package, and an active and positive work environment.", "\n", "\n", "\nSubmit your resume and cover letter on-line at the \"Careers\" section at www.CannonCorp.us. EOE/AA", "\n", "\nOr click on this link to apply - ", "\n    "], "images": [], "type": "full-time"},
{"text": "Data Engineer", "date": "2019-08-19 14:58", "compensation": "$100 - $135K DOE", "link": "https://losangeles.craigslist.org/wst/sof/d/culver-city-data-engineer/6960272785.html", "address": ["\n        ", "\nThis is a full time, onsite position only, no agencies or remote positions.", "\n", "\nWe are Globe Life And Accident Insurance Company, a highly successful Internet Marketing division of Torchmark Corporation, a Fortune 500 company.", "\n", "\nOur rapidly expanding Internet group in Culver City (Silicon Beach) is seeking to hire a data engineer with both conceptual and hands-on experience working in an Amazon Web Services Big Data environment with structured and semi-structured data. Ideal candidate will be a quick learner who is enthusiastic about all aspects of data development, including data transport, data processing & transformation, data integration and data warehousing.", "\n", "\nJob Requirements:", "\n", "\n• Hands-on experience working in AWS using S3, Glue, and Athena.", "\n• Experience working with the Scala programming language.", "\n• Experience with Linux-based operating systems.", "\n• Experience with Linux bash scripting.", "\n• Experience with ETL toolsets.", "\n• Solid proficiency in SQL.", "\n• Experience with RDBMS and Data Warehousing.", "\n• Experience with JSON formatted data.", "\n• Experience with version control systems (Git).", "\n• Ability to identify, troubleshoot and resolve production data integrity and performance issues.", "\n• Proficient in writing technical specifications and documentation.", "\n• A solid understanding of relational database architecture, including primary/foreign keys/constraints.", "\n• Excellent communication skills (verbal and written).", "\n", "\nPreferred Qualifications:", "\n", "\n• Experience with AWS Lambda & Nodejs.", "\n• Experience with Apache Spark & Spark SQL.", "\n• Demonstrable ability in data modeling.", "\n• Experience with Ubuntu Linux.", "\n• Experience with AWS Batch, CLI, IAM Roles & Policies, SQS (Simple Queue Service) and/or Step Functions.", "\n• Experience with Parquet & ORC.", "\n", "\nThis is a fast-paced office so we have high expectations. However, we are also a small and close-knit office with a great culture. The benefits are generous and include a Pension Plan, 401K and health/dental insurance.", "\n", "\nThis is a full time, onsite position only, No Agencies. Depending on individual circumstances, some telecommuting may be allowed.", "\n", "\nEqual Employment Opportunity:", "\nGlobe Life is proud to be an equal opportunity employer. Our success depends on the combined skills and talents of all our employees. We are committed to making employment decisions without regard to race, religious creed, color, age, sex, sexual orientation, gender identity, national origin, religion, marital status, family status, medical condition, disability, military service, pregnancy, childbirth and related medical conditions or any other classification protected by federal, state, and local laws and ordinances.    "], "images": [], "type": "full-time"},
{"text": "Cost Engineer", "date": "2019-08-28 08:06", "compensation": "Depending on Experience", "link": "https://losangeles.craigslist.org/lac/acc/d/los-angeles-cost-engineer/6966437656.html", "address": ["\n        ", "\nDedicated to “Excellence in Engineering,” E2 Consulting Engineers, Inc. (E2) was founded in 1988 to deliver environmentally focused services related to water and wastewater. Since then, the firm has grown and broadly diversified to provide engineering, environmental consulting, oil and gas pipeline, infrastructure operations, and remediation-related services. Since the firm’s founding, the management team has balanced growth with fiscal prudence, resulting in a solid, financially stable business, sustained growth, and loyal clients and employees.", "\n", "\n", "\n", "\n", "\n", "\nE2 Consulting Engineers, Inc. offers an excellent benefits package including health, dental, vision, and life insurance, 401(k) with employer match, paid time off. Qualified candidates only please submit your resume. We are an Equal Opportunity Employer.", "\n", "\n", "\n", "\n", "\nLOCAL CANDIDATES PREFERRED. NO PER DIEM OR RELOCATION OFFERED AT THIS TIME.", "\n", "\n", "\n", "\n", "\nPosition Summary", "\n", "\n", "\n", "\n", "\nA mid-level Cost Engineer position able to work and to provide analytical support on any project. The Project Cost Engineer will have excellent computer skills and knowledge of the various tools and software of Project Services.", "\nQualifications", "\n", "\n•Bachelor's Degree in Engineering or relevant degree in Construction Management, Project Management, etc.", "\n•4-7 years as a Cost Engineer or relevant Project Controls experience.", "\n", "\nDesired", "\n•Experience with Cost Engineering software tools:", "\n•Cost experience associated with construction operations experience", "\n•Accounting/budgeting knowledge", "\n•Mathematical skills", "\n", "\nResponsibilities", "\n•Cost Plan Development and Analysis", "\n•Use the cost and schedule plan to determine if project objectives are achievable.", "\n•Create, maintain, and update monthly forecast budgets.", "\n•Forecast costs to complete on projects and maintain reports with accuracy.", "\n•Assess and report on project performance using established industry standards.", "\n•Ensure that responses to project budget reflect accurate and current project cost information and stakeholders are in concurrence.", "\n•Communicate project risks related to costs to key stakeholders.", "\n•Assist Project Managers in preparing funding requests to gain project authorization.", "\n•Assist Project Managers in gaining funding changes to projects through the Unifier change control system.", "\n•Input data into various programs and prepare various cost and forecasting reports.", "\n•Analyze and trend cost variances by comparing the current cost plan against the actual cost to date.", "\n•Analyze and validate unauthorized costs to projects and report to Project Managers and Supervision.", "\n•Verify that project cost and schedule milestones were/were not attained and provide input to identify future process or business improvements and work with responsible parties to implement.", "\n•Manage project funding orders and ensure all required documentation is entered and/or correct in tracking documentation systems.", "\n•Maintain scope change, contingency release, change order, and journal entry logs.", "\n•Maintain written and electronic project documentation and records for required aspects of the project: Maintain project files in accordance with established guidelines and requirements.", "\n•Assist in the closeout process of a project with other departments. Work closely with Project Management to determine required deliverables and expected dates to achieve closeout.", "\n•May provide special reports for supervisor or manager upon request.", "\n", "\n", "\nPlease click on the link below to apply:", "\n", "\n", " ", "\n", "\n", "\nE2 Consulting Engineers, Inc. is an Equal Opportunity Employer.", "\n    "], "images": [], "type": "full-time"},
{"text": ".NET Developer - Full Time - Contractor - Must be in LA", "date": "2019-08-20 10:58", "compensation": "$40/hour", "link": "https://losangeles.craigslist.org/lac/sof/d/los-angeles-net-developer-full-time/6960826358.html", "address": ["\n        ", "\nFull Time Opportunity for a Talented Programmer", "\n\t", "\nSee Tickets is a Vivenedi company that provides full service ticketing to festivals, events and venues. Our goal is to provide better technology, better service and a better solutions for our customer and client. We are located in Los Angeles, California. ", "\n\t \t", "\n", "\nYOU:", "\nAre focused and driven.", "\nAre a problem solver.", "\nWant to work on projects that could change the industry.", "\nEnjoy working with a small team of talented people.", "\nCare deeply about producing high quality work.", "\n", "\nWE:", "\nConnect customers with great events.", "\nAre a technology company.", "\nAre passionate about events.", "\nAre constantly thinking of better ways to service the customer and client.", "\nBelieve in our product.", "\nWould be happy to answer any questions.", "\n", "\nPosition Description:", "\nSee Tickets is seeking an outstanding Software Engineer to join our team in our LA office. We are looking for someone to help build and scale our core services and infrastructure. We are looking for someone who is excited about the challenge of building web applications that can handle traffic spikes and load challenges to ensure that our services never go down. This is a full time position in a fast-paced, positive, innovative environment, and a great benefits package.  ", "\n", "\nRequirements/Qualifications:", "\nMinimum 3 years of comprehensive experience in web/enterprise application development", "\n.NET platform and related technologies (C#, ASP.NET,VB)", "\nSolid understanding of design and coding on all tiers of web application and services", "\nExcellent written and verbal communication skills", "\nStrong problem-solving abilities", "\nAn aptitude for learning new technologies", "\nStrong organizational and prioritization skills", "\nSelf-motivated, creative and strong sense of accountability", "\nT-SQL/NoSQL experience", "\nUnderstanding of usability, accessibility, security and privacy standards as applicable in eCommerce", "\n    "], "images": [], "type": "contract"},
{"text": "Job Captain", "date": "2019-08-30 18:08", "compensation": "TBD", "link": "https://losangeles.craigslist.org/wst/egr/d/santa-monica-job-captain/6968316598.html", "address": ["\n        ", "\nJob Captain", "\n", "\nPrestigious Santa Monica Architectural firm specializing in high-end residential design is seeking a Job Captain. We are looking for a candidate with 5-7 year's experience. Proficiency in Revit required. We offer a great working environment, excellent benefits, and a competitive salary for the right candidate. Below are the Job Captain's responsibilities: ", "\n", "\nDesign", "\nTo understand the project design.", "\nTo prepare, and develop where required, drawings, models, images and other documents relating to the design and development of the project.", "\n", "\nProject Management", "\nTo assist where required in the coordination of project information including consultant coordination and implementation into drawing set of structural, mechanical, electrical, interior and landscaping information as directed by the SPM.", "\nAttend periodic project and client meetings as the budget and project requires.", "\nTo take responsibility, where requested by the PM or SPM, for specific areas of the project development.", "\nCoordination, when directed by the PM or SPM, with consultants, owner's representatives, and other parties or agencies involved with the project.", "\nThorough knowledge and implementation of Office standard setups and sheets in compliance with company procedures and standards.", "\nUnderstanding the scope, cost and time of the work.", "\nTo contribute or otherwise assist in project related responsibilities as required.", "\nSupervise Draftsperson in project development, and review project drawings for accuracy and completeness.", "\nMaintain up to date knowledge of project progress and required tasks to be completed.", "\nTo seek, and record evidence of, professional development, such as Architectural Licensing and/or continuing education/accreditation, LEED Certification, and involvement with outside professional organizations.", "\n", "\nJob Captain Desirable Skills", "\nDemonstrates ability to undertake the above responsibilities. ", "\nAbility to take direction from a senior employee.", "\nAbility to constantly communicate ideas to SPM to ensure that their direction is correct and time is not wasted.", "\nA professional or post-graduate degree in architecture.", "\nPrevious experience working in an architectural practice.", "\n", "\nEmployee Essential Skills", "\nDemonstrates initiative and a proactive approach to daily tasks.", "\nKnowledge and working ability in relevant computer software programs.", "\nSelf-motivation and ability to take responsibility.", "\nFlexible attitude and ability to participate on a project at any phase or in any given point in time.", "\nAbility to manage and prioritize tasks and time efficiently.", "\nExcellent written and verbal skills.", "\nGood interpersonal skills and able to work independently and as part of a team.", "\nExcellent organizational skills.", "\nAbility to manage sensitive and confidential information.", "\nAble to work under pressure and to tight deadlines.", "\nAble to build good relationships at all levels, internal and external to the office.", "\nLooks for and achieves the best outcome in every situation.", "\nAppreciation of and commitment to the business of the practice.", "\nWelcomes a challenge and rises to the occasion - willing to commit the time, effort and energy to do so.", "\nHolds others accountable and is willing to be held accountable.", "\nSupportive of the creative office culture.", "\nResilient with a good sense of humor.", "\nPassion and commitment to Architecture as a Discipline.", "\nThorough understanding of the history and theory of architecture.", "\nPursuit of specific area of expertise/knowledge related to architectural design, history, or practice.", "\nGood graphic and presentation ability.", "\nDemonstrates ability to grow personally and professionally.", "\nDemonstrates a balance between reality and optimism.", "\nDemonstrates restraint and maturity in difficult situations.", "\n    "], "images": [], "type": "full-time"}
]