[
{"text": "Senior Software Engineer (Full Stack)", "date": "2019-08-30 14:13", "compensation": "Compensation ~$80.00/hr (W2 only) with some flex on rate. Paid Time Off. Optional Medical, Dental, Vision, 401k.", "link": "https://seattle.craigslist.org/see/sof/d/seattle-senior-software-engineer-full/6968177338.html", "address": ["\n        ", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "    "], "images": [], "type": "contract"},
{"text": "Network Security Engineer", "date": "2019-08-28 12:10", "compensation": "Up to US$0.00 per year", "link": "https://seattle.craigslist.org/see/sof/d/bellevue-network-security-engineer/6966660047.html", "address": ["\n        ", "\n\n        ", "\n    "], "images": [], "type": null},
{"text": "House Cleaners Needed ~ Local Company ~  Start @ $19.5/hr + Tips", "date": "2019-08-29 09:01", "compensation": "$19.50/hr to start  (hourly rate for each job depends on frequency of the work)", "link": "https://seattle.craigslist.org/see/lab/d/seattle-house-cleaners-needed-local/6967203786.html", "address": ["\n        ", "\nLocally owned house and office cleaning company. For over 30 years we have been providing P/T flexible work for people who LOVE to clean. We have work available in King, Pierce and Snohomish Counties. Choose the areas, days and hours you want work, Monday-Friday, (Some weekend days are available). Together, we'll fill in your calendar/schedule with the information you provide. Work as little as 8 hours a week for a little extra income or over 30 hours if you want or need more. You can work for us as well as cleaning jobs on your own or another part-time job.", "\n", "\nYou'll be required to come into our NE Seattle office for your first two appointments. After that, work based from home and go to the jobs in the areas, days and times you have chosen.", "\n", "\nThis business model has been working for us a long time and we have an excellent reputation around the Puget Sound!", "\n", "\nIf you are interested:", "\n", "\nFIRST: Call and listen to our 24/7 job line at: 206-337-2265 for more info. Leave a message and answer the questions we ask", "\n", "\nSECOND: To get an interview, fill out our form online: ", "\n", "\n(click or copy and paste).", "\n", "\nIf you can clean a house well, we look forward to hearing from you!", "\n", "\n", "\nHere is what some of our cleaners have say about us:", "\n", "\n\"MINW is a great place to work--great pay, great friendly helpful staff! I've been happy here...!\" ~ Kim", "\n", "\n\"As a cleaner with MINW, I've been able to have a MUCH better work-life balance. Prior to contracting with them, I had to put my little girl in daycare, both before, and after school. As a single mom, it was devastating, and exhausting! Now I go to all my little girl's school functions, volunteer again, and still have time to be a musician, which is my passion. I make as much as I did in Healthcare, but work HALF the time! I love being an independent worker, while still having the benefit of a team backing me up. I have the best of all worlds, and I won't be leaving for a very long time!\" ~ Kathryn", "\n", "\n\"Maids in the Northwest gave me HOPE! The opportunity to work for myself and subcontract additional clients from Maids was exactly what I needed. The joy of cleaning was all the therapy I needed. It has been a wonderful experience and the communication between clients, Maids, and myself has been exceptional. Just a really good place to be, when I needed the flexibility and INCOME! What an opportunity to serve in your community and make a living at it too.", "\nThank You, ~ Kay", "\n", "\n", "\n\"I just wanted to take a moment to say that I have been a sub-contractor with Maid in the Northwest for quite a while. I also sub-contract with another company.", "\nI will tell you this, the Maids is the best as far as being fair, getting me work and paying me!", "\nI don't have to worry about someone under bidding me on a job. I have consistently gotten work. They have worked with me to make sure that I am getting what I need.", "\nThe staff is the best... Really!", "\nIf you are thinking about working with the Maids, don't take too long. Just see for yourself how good they are.", "\nI'm a very satisfied sub-contractor.\" ~ Paul", "\n", "\n\"As a sub-contractor with this company the past 2 years, I have been cleaning clients' homes who appreciate the use of high-quality cleaning services in maintaining their homes. I enjoy the flexibility I have with scheduling cleaning jobs through this company as well as scheduling my own personal clients. The MINW office staff has been especially helpful with scheduling longer-term cleaning clients for me.\" ~ Cathie ", "\n", "\n\"This has been a wonderful partnership for me for the past 14 years! I can sum it up in one word: flexibility! I'm a working musician and this company has been invaluable, because I can simply book cleaning jobs when I want to! That can be very tough in the traditional work world. I book the occasional cleaning job on my own, but the clear majority comes from this company. A very well run, fair company to contract with, staffed by great people! Who could ask for more?!\"", "\n~ Danny ", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\naccountant Actuary Managers Promotions Advertising Sales Agent Aircraft mechanic Airline Pilot Airport Security Screener Airline Reservations Agent Air Traffic Controller Architect Auto mechanic Bank Teller Bartender Biological Technician Biomedical Engineer Bookkeeping Accounting auditing Clerks Brick Mason Budget Analyst Cardiovascular Technologist Cashier Chef Chief Executive Officer CEO) Chemical Technician Childcare Worker Chiropractor Claims Adjuster Appraiser Examiner investigator Compensation Benefits Manager Computer Programmer Systems Analyst Construction Laborer Consultant Cook Correctional Court Reporter Curator Customer Service representative Database Administrator Dental Hygienist Dentist Derrick Operator Diagnostic sonographer Director Dietitian/Nutritionist Editor Electrician EMTs Paramedics English as a Second Language (ESL) Teacher Epidemiologist Event/Meeting Planner Fashion Designer Financial Advisor Financial Financial Services Sales Firefighter Fitness Trainer Flight Attendant Funeral Director Fundraiser Judge Glazier Grant Writer Graphic Designer Guidance Counselor Hairdressers Hairstylists Cosmetologists Health Educator Human Resources Assistant Human Resources Health Aide Industrial Designer Industrial Production Insurance Underwriter Interior Designer Interpreter Translator Janitor Lawyer Librarian Library /Technician Licensed Practical Nurse Loan Lodging Manicurist Manufacturing Market Research analyst Marriage Family Therapist Massage Mechanical Engineer laboratory Technician Model Nurse Practitioner Nursing Occupational Occupational therapy Painter Paralegal Legal Personal Trainer Pharmacist Pharmacy Technician Physician Photographer Physical Physical Therapy Plumber Police Postal service Producer Psychiatric Aide Public Relations Specialist Purchasing Receptionist Registered Nurse Retail Salesperson Retail Supervisor Roofer Secretary / Administrative Security guard Social Media Social Software Developer Special Education Subway Operator Taxi Driver Technical Writer Training Development Veterinarian Waiter/Waitress Web Developer Writer ing areas: Seattle Bellevue Redmond Kirkland Shoreline Bothell Des Moines Georgetown Tacoma Algona Federal Way North Bend Auburn Hunts Point Issaquah Redmond Bellevue Kenmore Renton Black Diamond Kent Sammamish Bothell SeaTac Burien Lake Forest Park Carnation Maple Valley Shoreline Clyde Hill Medina Skykomish Covington Mercer Isl Snoqualmie Des Moines Milton Tukwila Duvall Newcastle Woodinville Enumclaw Norm y Park Yarrow Point Arlington Bothell Brier Edmonds Everett Lake Stevens Lynnwood Marysville Mill Creek Monroe Mountlake Terrace Mukilteo Snohomish Stanwood Sultan Woodway Bonney Lake DuPont Edgewood Fife Fircrest Gig Harbor Lakewood Milton Orting Puyallup Sumner Tacoma University Place musician wait staff artisan artist school actors evening classes janitorial work parking attendant caregiver cook chef dog walkers retail customer service dishwasher biller hair stylist marketing grant writer driver LPN pet sitter server groomer busser dj entertainment janitors l scaper yard care gardener lawn maintenance laborer cocktailers servers bartenders groundskeeper restaurant real estate agent food service photographer childcare rep caregiver counselor concessions customer service hygienist receptionist driver barista dog walker dishwasher childcare cashier servers CNA Esthetician personal prep cook relief flagger delivery driver property lmp cpr hygienist leasing agent valet HDA CDA Gardner deli clerk dog trainer cleaning maid services housekeeping home care giving residential cleaners maintenance hotel household help office janitorial maintenance custodian care employment commercial business lady guy company companies Search terms: Queen Anne Downtown Belltown Downtown Belltown Lower Queen Anne Queen Anne Ballard Magnolia Capitol Hill Beacon Hill Crown Hill Columbia City Central District Rainier Beach Renton Tukwila Mill Creek SODO Ravenna Madrona Seaview Delridge Laurelhurst West Seattle Washington Park Madison Park Montlake U District Fairmount Park White Center Redmond West Lake Hills SeaTac Kent Mercer Island Wallingford Phinney Ridge Lynnwood Mountlake Terrace Mukilteo Fremont Northgate joy Molly Maids Porch Red Beacon The Westin clean cleaner house keeping house keeper house keepers housekeeping maid janitor maids jobs limpieza limpiador homejoy limpiar mucama camarera parttime part time part-time full time full-time contract gig skill trade hospitality flexible part-time part-time contractor contracter housekeeping house keeping job student student jobs seasonal seasonal intern merrymaids merry maids molly maids mollymaids getmaids local dusting house keeping housekeeping commercial janitor team maid services housekeeping housekeepers care giving residential maintenance household help janitorial maintenance custodian care house employment commercial business lady guy company companies", "\n", "\n    "], "images": [], "type": "part-time"},
{"text": "Software Engineer - Full Stack (mid to principal level)", "date": "2019-08-08 09:57", "compensation": "Competitive Base, bonus, equity, etc.", "link": "https://seattle.craigslist.org/see/sof/d/seattle-software-engineer-full-stack/6952296953.html", "address": ["\n        ", "\nSenior Software Engineer – Full Stack", "\nFull time/salaried", "\nSeattle, WA", "\n", "\nDowntown Seattle client is looking for a solid mid to senior/principal level full stack engineer to join their team to help design and build full stack services. You will have an opportunity to work with some of the latest languages and tools, cloud and mobile platforms. ", "\n", "\nSome experience we are looking for includes:", "\n•    4-8+ years of software development experience", "\n•    Full stack experience - some tools/languages/technologies we like include Java, JavaScript, Node.js, React, Redux ", "\n•    Solid OO development, understanding of data structures, distributed systems, etc.", "\n•    Deployment experience with AWS and Kubernetes.", "\n•    Experience with Responsive/Mobile design and continuous delivery", "\n•    Some experience with building Microservices with NoSQL technologies", "\n•    Comfortable building fault tolerant architecture that can scale", "\n", "\nPlease send resume to jeffr@triadgroup.com; thank you for your interest, I look forward to connecting with you to share more about this opportunity.", "\n", "\nJeff Roodhouse ", "\nTRIAD Group", "\njeffr@triadgroup.com", "\n425.454.0282 x220", "\n    "], "images": [], "type": "full-time"},
{"text": "House Cleaners Needed ~ Local Co ~ Start Making  $19.50/hr + Tips", "date": "2019-08-24 13:13", "compensation": "$19.50/hr to start, (First 30 Days). Hourly rate for each job depends on frequency of the work.", "link": "https://seattle.craigslist.org/see/lab/d/seattle-house-cleaners-needed-local-co/6963897601.html", "address": ["\n        ", "\nWe are a Locally owned house and business cleaning company. For over 30 years we have been providing P/T flexible work for people who LOVE to clean. We have work in King, Pierce and Snohomish Counties. You choose the area, days and hours you want work, Monday-Friday, some weekends are available. Start times range from early morning to early afternoon. Together we'll fill in your calendar/schedule with the information you provide. Work as little as 8 hours a week for a little extra income or over 30 hours. You can work with us as well as cleaning jobs on your own or another part-time job.", "\n", "\nWe require two visits to our N. Seattle office. After that, work based from home and go to jobs in the areas, days and times you have chosen.", "\n", "\nThis business model has been working well for us a long time and we have an excellent reputation in and around the Puget Sound!", "\n", "\nIf you are interested:", "\n", "\nFIRST: Call and listen to our 24/7 job line at: 206-337-2265 for more info about our business model. Leave a message by answering the questions we ask.", "\n", "\nSECOND: To get an interview, fill out our online form: ", "\n", "\nIf you can clean a house well, we look forward to hearing from you!", "\n", "\nHere is what some of our cleaners have say about us:", "\n", "\n\"MINW is a great place to work--great pay, great friendly helpful staff! I've been happy here...!\" ~ Kim", "\n", "\n\"As a cleaner with MINW, I've been able to have a MUCH better work-life balance. Prior to contracting with them, I had to put my little girl in daycare, both before, and after school. As a single mom, it was devastating, and exhausting! Now I go to all my little girl's school functions, volunteer again, and still have time to be a musician, which is my passion. I make as much as I did in Healthcare, but work HALF the time! I love being an independent worker, while still having the benefit of a team backing me up. I have the best of all worlds, and I won't be leaving for a very long time!\" ~ Kathryn", "\n", "\n\"Maids in the Northwest gave me HOPE! The opportunity to work for myself and subcontract additional clients from Maids was exactly what I needed. The joy of cleaning was all the therapy I needed. It has been a wonderful experience and the communication between clients, Maids, and myself has been exceptional. Just a really good place to be, when I needed the flexibility and INCOME! What an opportunity to serve in your community and make a living at it too.", "\nThank You, ~ Kay", "\n", "\n", "\n\"I just wanted to take a moment to say that I have been a sub-contractor with Maid in the Northwest for quite a while. I also sub-contract with another company.", "\nI will tell you this, the Maids is the best as far as being fair, getting me work and paying me!", "\nI don't have to worry about someone under bidding me on a job. I have consistently gotten work. They have worked with me to make sure that I am getting what I need.", "\nThe staff is the best... Really!", "\nIf you are thinking about working with the Maids, don't take too long. Just see for yourself how good they are.", "\nI'm a very satisfied sub-contractor.\" ~ Paul", "\n", "\n\"As a sub-contractor with this company the past 2 years, I have been cleaning clients' homes who appreciate the use of high-quality cleaning services in maintaining their homes. I enjoy the flexibility I have with scheduling cleaning jobs through this company as well as scheduling my own personal clients. The MINW office staff has been especially helpful with scheduling longer-term cleaning clients for me.\" ~ Cathie ", "\n", "\n\"This has been a wonderful partnership for me for the past 14 years! I can sum it up in one word: flexibility! I'm a working musician and this company has been invaluable, because I can simply book cleaning jobs when I want to! That can be very tough in the traditional work world. I book the occasional cleaning job on my own, but the clear majority comes from this company. A very well run, fair company to contract with, staffed by great people! Who could ask for more?!\"", "\n~ Danny ", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\naccountant Actuary Managers Promotions Advertising Sales Agent Aircraft mechanic Airline Pilot Airport Security Screener Airline Reservations Agent Air Traffic Controller Architect Auto mechanic Bank Teller Bartender Biological Technician Biomedical Engineer Bookkeeping Accounting auditing Clerks Brick Mason Budget Analyst Cardiovascular Technologist Cashier Chef Chief Executive Officer CEO) Chemical Technician Childcare Worker Chiropractor Claims Adjuster Appraiser Examiner investigator Compensation Benefits Manager Computer Programmer Systems Analyst Construction Laborer Consultant Cook Correctional Court Reporter Curator Customer Service representative Database Administrator Dental Hygienist Dentist Derrick Operator Diagnostic sonographer Director Dietitian/Nutritionist Editor Electrician EMTs Paramedics English as a Second Language (ESL) Teacher Epidemiologist Event/Meeting Planner Fashion Designer Financial Advisor Financial Financial Services Sales Firefighter Fitness Trainer Flight Attendant Funeral Director Fundraiser Judge Glazier Grant Writer Graphic Designer Guidance Counselor Hairdressers Hairstylists Cosmetologists Health Educator Human Resources Assistant Human Resources Health Aide Industrial Designer Industrial Production Insurance Underwriter Interior Designer Interpreter Translator Janitor Lawyer Librarian Library /Technician Licensed Practical Nurse Loan Lodging Manicurist Manufacturing Market Research analyst Marriage Family Therapist Massage Mechanical Engineer laboratory Technician Model Nurse Practitioner Nursing Occupational Occupational therapy Painter Paralegal Legal Personal Trainer Pharmacist Pharmacy Technician Physician Photographer Physical Physical Therapy Plumber Police Postal service Producer Psychiatric Aide Public Relations Specialist Purchasing Receptionist Registered Nurse Retail Salesperson Retail Supervisor Roofer Secretary / Administrative Security guard Social Media Social Software Developer Special Education Subway Operator Taxi Driver Technical Writer Training Development Veterinarian Waiter/Waitress Web Developer Writer ing areas: Seattle Bellevue Redmond Kirkland Shoreline Bothell Des Moines Georgetown Tacoma Algona Federal Way North Bend Auburn Hunts Point Issaquah Redmond Bellevue Kenmore Renton Black Diamond Kent Sammamish Bothell SeaTac Burien Lake Forest Park Carnation Maple Valley Shoreline Clyde Hill Medina Skykomish Covington Mercer Isl Snoqualmie Des Moines Milton Tukwila Duvall Newcastle Woodinville Enumclaw Norm y Park Yarrow Point Arlington Bothell Brier Edmonds Everett Lake Stevens Lynnwood Marysville Mill Creek Monroe Mountlake Terrace Mukilteo Snohomish Stanwood Sultan Woodway Bonney Lake DuPont Edgewood Fife Fircrest Gig Harbor Lakewood Milton Orting Puyallup Sumner Tacoma University Place musician wait staff artisan artist school actors evening classes janitorial work parking attendant caregiver cook chef dog walkers retail customer service dishwasher biller hair stylist marketing grant writer driver LPN pet sitter server groomer busser dj entertainment janitors l scaper yard care gardener lawn maintenance laborer cocktailers servers bartenders groundskeeper restaurant real estate agent food service photographer childcare rep caregiver counselor concessions customer service hygienist receptionist driver barista dog walker dishwasher childcare cashier servers CNA Esthetician personal prep cook relief flagger delivery driver property lmp cpr hygienist leasing agent valet HDA CDA Gardner deli clerk dog trainer cleaning maid services housekeeping home care giving residential cleaners maintenance hotel household help office janitorial maintenance custodian care employment commercial business lady guy company companies Search terms: Queen Anne Downtown Belltown Downtown Belltown Lower Queen Anne Queen Anne Ballard Magnolia Capitol Hill Beacon Hill Crown Hill Columbia City Central District Rainier Beach Renton Tukwila Mill Creek SODO Ravenna Madrona Seaview Delridge Laurelhurst West Seattle Washington Park Madison Park Montlake U District Fairmount Park White Center Redmond West Lake Hills SeaTac Kent Mercer Island Wallingford Phinney Ridge Lynnwood Mountlake Terrace Mukilteo Fremont Northgate joy Molly Maids Porch Red Beacon The Westin clean cleaner house keeping house keeper house keepers housekeeping maid janitor maids jobs limpieza limpiador homejoy limpiar mucama camarera parttime part time part-time full time full-time contract gig skill trade hospitality flexible part-time part-time contractor contracter housekeeping house keeping job student student jobs seasonal seasonal intern merrymaids merry maids molly maids mollymaids getmaids local dusting house keeping housekeeping commercial janitor team maid services housekeeping housekeepers care giving residential maintenance household help janitorial maintenance custodian care house employment commercial business lady guy company companies", "\n", "\n    "], "images": [], "type": "part-time"},
{"text": "Information Technology Director", "date": "2019-08-25 18:18", "compensation": "Salary:  $125,604 - $139,560", "link": "https://seattle.craigslist.org/est/sad/d/snoqualmie-information-technology/6964665992.html", "address": ["\n        ", "\nINFORMATION TECHNOLOGY DIRECTOR", "\nCity of Snoqualmie, Washington", "\nSalary:  $125,604 - $139,560   ", "\n", "\nLocated just 25 miles east of Seattle, the City of Snoqualmie, (pop. approx. 14,000), is home to Snoqualmie Falls, the second most visited natural attraction in Washington State after Mount Rainier. Snoqualmie is surrounded by stunning vistas of Mount Si and the Cascade Mountains, and the area offers year-round outdoor adventures, including hiking, mountain and road biking, fishing, and golf, as well as skiing only 30 miles east. Residents enjoy the city’s 40+ parks, more than 30 miles of trails, and 540 acres of open space that offer a wide range of recreational opportunities. Snoqualmie is also the official Home of the Boeing Classic PGA Champions Tour held annually at the Club at Snoqualmie Ridge. The nationally recognized Jack Nicklaus Signature Golf Course is designed to accommodate professional events while offering superb playability and unparalleled views.", "\n", "\nThe City of Snoqualmie’s IT Department provides infrastructure services, including network, cybersecurity, storage, business continuity services, personal computer and communications services, geographic information services, and professional technology services, including project management, equipment lifecycle, contract management, and application development. The department operates on a 2019 budget of $2.1 million with 7 FTE’s, including the IT Director, a Systems Engineer, two IT Systems Support positions, a GIS Analyst, a Service Desk Technician, and a Term Limited Project Manager.", "\n", "\nUnder the direction of the City Administrator, the IT Director provides direction and support for IT solutions, and works closely with other departments to identify, recommend, develop, implement, and support cost-effective technology solutions for all aspects of the organization. This position coordinates and develops the policies and procedures for local and wide area networks, oversees the installation and maintenance of hardware and software, trains staff, troubleshoots reported problems with equipment or software, projects and maintains the budget, and directs and supervises the workflow and activities of department support staff. ", "\n", "\nA bachelor’s degree from an accredited college or university with major course work in computer science or a related field, and 7 years of related work experience is required.", "\n", "\nFor a complete position profile and to apply online, visit Prothman at ", ", click on \"Open Recruitments\" and then click the position title. To apply, click on \"Apply Online\" and follow the directions provided. The City of Snoqualmie is an Equal Opportunity Employer. First review of applications: September 29, 2019 (open until filled).    "], "images": [], "type": "full-time"},
{"text": "Test Engineer (JavaScript) - TA0R046", "date": "2019-08-24 19:40", "compensation": "Up to $70/hr. DOE", "link": "https://seattle.craigslist.org/see/sof/d/seattle-test-engineer-java-ta0r046/6964102159.html", "address": ["\n        ", "\nConsultant- Test Engineer", "\nAltaSource Group is looking for a Test Engineer for our popular media client! Be a part a popular television network and their streaming product line!", "\n ", "\nDay to Day, you will:", "\nCoordinate with Feature Release teams to understand and implement the team’s automation needs", "\nUtilize JavaScript to design and develop test automation for a streaming service", "\nSupport program management teams as needed according to the schedule of releases", "\nActively research new tools/methods that could prove beneficial in the implementation of automated tests", "\nUnderstand and apply technical system knowledge to organize and create automated tests", "\nEstablish practices that lead to higher test stability by identifying methods of testing not only the code the test is  intended to validate, but the test code itself", "\nEnsure stability of the software release enhancements across all their digital products", "\nPerform debugging of FVT failures, in order to assess test stability and confirm the results of reported failures", "\nFollow the organization’s established policies and procedures when implementing Automated Tests", "\nProvide comprehensive status reports to QA management", "\n ", "\nAbout You:", "\nThe ideal candidate is a skilled Test Engineer with JavaScript experience to develop, maintain and support the large set of Functional Verification Tests and Service Validation Tests for our catalog of streaming applications. If you’re passionate about QA and can write JavaScript code (in either React JS or Node JS or Angular JS or Ionic) this is an amazing opportunity to work on a high performing Test team. The Test Engineer will support the development lifecycles on numerous supported platforms and streaming services.", "\n ", "\nYour knowledge and skill-set should include:", "\n3+ years related Test Engineering experience required", "\nBachelor’s Degree or Advanced degree or relative in-field experience preferred", "\nExperience with (what was your last/preferred) object-oriented language(s) such as: Java, JavaScript, C#, etc.", "\nAble to demonstrate proficiency in at least one object-oriented language", "\nExperience with common (what) software development tools such as Jenkins, GitHub, JIRA, etc.", "\nExperience with client/server product releases/deployments of SaaS applications", "\nService side experience while utilizing scripting tools such as Python/Bash", "\nExcellent verbal and written communication skills", "\n ", "\nPay Rate: Up to $70/hr. DOE", "\nNote: This position is an onsite contract role with the potential to extend or convert full-time.  Our client is unable to consider candidates who require H1 visa sponsorship for this role.  Please no corp-to-corp or 1099.", "\n", "\nAbout AltaSource Group:", "\nAltaSource Group is a rapidly growing leader in technology consulting services that enables companies to advance in the digital world. We provide 100% company paid medical, dental and vision for our employees! Additional employee benefits include a free Employee Assistance Program, available flex spending accounts, available 401K program, and local discount programs through Passport.", "\nWe are proud to say we have a Glassdoor rating of 4.9!", "\n ", "\nYour recuiter for this role will be Kristen Pena:", "\n", "\n ", "\nCompany Logo #8 - Kristen Pena    "], "images": [], "type": "contract"},
{"text": "Senior Software Developer", "date": "2019-08-27 12:11", "compensation": "DOE", "link": "https://seattle.craigslist.org/est/sof/d/bellevue-senior-software-developer/6965922350.html", "address": ["\n        ", "\nAffirma, a young, fast paced, award winning tech company ranked one of the \"Top 5 Best Mid-Size Companies to Work For\" by the Seattle Business magazine, is looking for a Full stack Software Engineer with a passion for people and coding to join our internal Custom Development team in our growing Austin office! ", "\n", "\nThis is a great opportunity to join a growing organization that focuses on creating cutting edge, inhouse technical solutions for large to enterprise level clients. In this role you will engage with stakeholders and global team members to flush out project needs, drive development and ensure client satisfaction.", "\n", "\nApplication Technologies:", "\n· Experience working with .Net technologies: C#, ASP.NET, and MVC", "\n· SQL experience: querying, table design, DB administration, stored procedures, etc.", "\n· Comfortable engaging with high-level stakeholders both internal and external to Affirma ", "\n· Experience in modern web technologies (ie. Angular, React, Ember, Vue)", "\n· Proven experience working the full development life cycle including discovery, implementation, and delivery (on time and on budget)", "\n· Experience and willingness to work with offshore and remote based teams throughout the US ", "\n· BS Degree in Computer Science or equivalent", "\n", "\nNice to have", "\n· Experience in Azure Service Bus", "\n· Integration experience", "\n· Microservices, Azure Service Fabric", "\n· Azure ARM", "\n", "\nWhy Affirma?", "\n· One of Washington's Fastest Growing Private Companies & Top 100 Best Companies to Work For (According to Seattle Business Magazine and Puget Sound Business Journal)", "\n· Casual environment, surrounded by incredibly intelligent and motivated co-workers, and a performance-driven culture", "\n· Flexible Schedule", "\n· Opportunity for growth", "\n· Great location, great people, exciting projects, and tons of fun.", "\n", "\nAffirma is an award-winning consultancy specializing in Mobile, Cloud, Business Intelligence, SharePoint, Technology Infrastructure, Custom Development, Visual Design, and Staffing Services. We focus on delivering true, measurable business value to our clients. We have top industry customer satisfaction and are dedicated to delivering dependable and reliable solutions that exceed client expectations. Affirma's motto is quality solutions on budget, on time, every time.", "\n", "\nInterested in this opportunity? We invite you to visit ", " and submit your application! When applying, please use the Job Opening ID # 926.    "], "images": [], "type": "full-time"},
{"text": "Software Engineer - iOS (mid to senior opportunities)", "date": "2019-08-08 10:40", "compensation": "Strong compensation package", "link": "https://seattle.craigslist.org/see/sof/d/seattle-software-engineer-ios-mid-to/6952337438.html", "address": ["\n        ", "\nSoftware Engineer - iOS (opportunities for mid to senior levels)", "\nDowntown Seattle", "\nFull time", "\n", "\nDowntown Seattle client continues to be a leader in creating cutting edge healthcare services. continuing to build out new products and services.  We are looking for a strong iOS Engineer who can help us build dynamic mobile solutions. and refine our customer facing mobile applications.  We are building out new teams and have needs for strong mobile engineers.   We are looking for someone who has strong OO development skills in addition to full stack mobile application development.  ", "\n", "\nSome of the areas you will work on include:", "\n•\tWorking on architecture and implementation of web services and front end apps", "\n•\tLove tackling complex problems and are proficient with developing iOS applications at scale.", "\n•\tDevelop great user experiences on both web and mobile (iOS).", "\n•\tEncourage your small team to build rock solid code, that is efficient and ships code frequently", "\n•\tIterate quickly and ship code frequently.", "\n•\tWorking in a tight knit team and being comfortable taking ownership ", "\n", "\nRequirements for the role:", "\n•\tMinimum of 5+ years' experience as a Software Engineer, comfortable working in a fast pace environment, coding experience with Swift, Objective-C, Java or Python.", "\n•\tMobile application development experience with a desire to solve complex problems and see results.", "\n•\tCollaborative working style with other teams in the organization.", "\n•\tBachelors or Master's degree in Computer Science or related field.", "\n", "\nSome of the technology that our code base is composed of includes:", "\n•\tJavaScript and modern front end frameworks, including React and Redux plus native apps on the front-end", "\n•\tJava, Python, and Node.js along with NoSQL and SQL technologies", "\n", "\nPlease send resume to jeffr@triadgroup.com for consideration.  All inquiries will be kept confidential.   ", "\n", "\nJeff Roodhouse ", "\nTRIAD Group", "\njeffr@triadgroup.com", "\n425.454.0282 x220", "\n    "], "images": [], "type": "full-time"},
{"text": "Senior Sitefinity Software Engineer", "date": "2019-08-06 10:52", "compensation": "DOE", "link": "https://seattle.craigslist.org/est/sof/d/bellevue-senior-sitefinity-software/6950846406.html", "address": ["\n        ", "\nAffirma Consulting, a young, fast paced, award winning tech company ranked one of the \"Top 5 Best Mid-Size Companies to Work For\" by the Seattle Business magazine, is looking for a Senior Sitefinity Software Engineer with a passion for people and coding to join our Custom Development team.  If you are not local to one of our current office locations we invite you to apply to join our remote team.", "\n", "\nThis is a great opportunity to join a growing organization that focuses on creating cutting edge, inhouse technical solutions for large to enterprise level clients. In this role you will engage with stakeholders and global team members to flush out project needs, drive development and ensure client satisfaction.", "\n", "\nResponsibilities and Skills:", "\n·        Experience working with .Net technologies: C#, ASP.NET, and MVC", "\n·        Website development ", "\n·        Knowledgeable in JavaScript and/or AngularJS, ReactJS, jQuery ", "\n·        Previous experience creating new Sitefinity widgets and modules", "\n·        Proven experience working the full development life cycle including discovery, implementation, and delivery (on time and on budget)", "\n·        Ability to plan and execute website implementation on Sitefinity", "\n·        Experience working with other CMS systems such as Sitecore or Kentico", "\n·        Previous experience working with e-commerce technologies such as Magento of BigCommerce", "\n·        BS Degree in Computer Science or equivalent", "\n", "\nLocation:", "\n·        Open to both local and remote based candidates", "\n", "\nWhy Affirma?", "\n·        One of Washington's Fastest Growing Private Companies & Top 100 Best Companies to Work For (According to Seattle Business Magazine and Puget Sound Business Journal)", "\n·        Casual environment, surrounded by incredibly intelligent and motivated co-workers, and a performance-driven culture", "\n·        Flexible Schedule", "\n·        Opportunity for growth", "\n·        Great location, great people, exciting projects, and tons of fun.", "\n", "\nAffirma is an award-winning consultancy specializing in Mobile, Cloud, Business Intelligence, SharePoint, Technology Infrastructure, Custom Development, Visual Design, and Staffing Services. We focus on delivering true, measurable business value to our clients. We have top industry customer satisfaction and are dedicated to delivering dependable and reliable solutions that exceed client expectations. Affirma's motto is quality solutions on budget, on time, every time.  ", "\n", "\nSound like a fit?  We invite you to head to ", " and submit your application using the job opening ID # 899!    "], "images": [], "type": "full-time"},
{"text": "Senior Software Engineer (Full Stack)", "date": "2019-08-10 17:50", "compensation": "Compensation ~$80.00/hr (W2 only) with some flex on rate. Paid Time Off. Optional Medical, Dental, Vision, 401k.", "link": "https://seattle.craigslist.org/see/sof/d/seattle-senior-software-engineer-full/6954088239.html", "address": ["\n        ", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "    "], "images": [], "type": "contract"},
{"text": "Infrastructure Consultant", "date": "2019-08-27 12:10", "compensation": "DOE", "link": "https://seattle.craigslist.org/est/sof/d/bellevue-infrastructure-consultant/6965921494.html", "address": ["\n        ", "\nRanked one of Puget Sound Business Journals “Best Workplaces” and “Fastest Growing Companies” for four years in a row, Affirma is expanding its IT infrastructure practice with a new Infrastructure Consultant role!  ", "\n", "\nIn this role you will consult, architect, and engineer comprehensive Information Technology infrastructures, both on-prem and cloud, for large to enterprise-sized businesses and organizations looking to add, move, migrate, or upgrade new technologies and/or solutions to their existing environment", "\n", "\nResponsibilities include:", "\n·        Apply thoughtful leadership and provide advice on multiple technologies that shape the long-term direction of a client’s IT infrastructure.", "\n·        Consult, develop, and engineer strategies and solutions to meet client objectives and needs in their IT infrastructure environment", "\n·        Produce documentation and convey best practices to clients", "\n·        Remain abreast of current and next gen IT technologies and be motivated to seek new knowledge and innovate methods across disciplines.", "\n·        Leverage in-depth knowledge of IT infrastructure and apply to client goals and objectives.", "\n·        Internal thought-leader on IT infrastructure technologies", "\n·        Using analytical thought and judgment to solve most complex or unique problems.", "\n·        Ensure IT services implemented are aligned with business current and expectations.", "\n·        Develop the framework and the supporting infrastructure to build common reusable components for core infrastructure solutions.", "\n·        Build external alliances and is external technical spokesperson for company for proof of concepts and product evaluations.", "\n·        When client concerns arise, adopt a sense of urgency for problem resolution and leverage any/all external resources to help solve the issue", "\n·        Maintains professional and technical knowledge by attending educational workshops; reviewing professional publications; establishing personal networks; benchmarking state-of-the-art practices; participating in professional societies.", "\n", "\nQualifications:", "\n·        Demonstrate proficiency to communicate effectively, both verbally and in writing, to various levels of management, and technical and non-technical personnel", "\n·        5-7+ years of both hardware and software technical industry experience in areas of IT enterprise consultancy, support, technical pre-sales and/or engineering/development.", "\n·        BS or MS degree in computer-oriented technical discipline or equivalent experience.", "\n·        Experience developing large-scale infrastructures. Technologies include, but not limited to: Windows Server and Active Directory 2003/2008(R2)/2012/2016/2019, Exchange Server 2003/2007/2010/2013/2016/2019, SQL Server 2005/2008 (R2)/2012/2014/2016/2017, VMWare 5.0+, Hyper-V, Firewalls (Cisco, Dell, Palo Alto, etc.), SANs (Dell, HP, NetApp, etc.)", "\n·        Experience evaluating, strategizing, and performing migrations for Exchange, OneDrive, Gmail, or other third-party email apps to O365", "\n·        Strong preference given to those with in-depth knowledge of O365, Azure, and AWS security", "\n·        Strong preference given to those with experience and architecting public cloud solutions for both SaaS and IaaS applications (AWS, Azure, Google, etc.)", "\n·        Strong preference given to those with active certifications (MCSA, AWS, etc.)", "\n·        Proficiency in one or more of the following: PowerShell, Linux/Unix Shell, SQL, C#", "\n·        Other desired proficiencies: Intune, DLP, Windows 10 Upgrade and Imaging, Networking (CCNA), MIM, MDM, and MAM, SCCM,", "\n·        Demonstrated successful working relationships with IT and Business customers", "\n·        Experience evaluating tools, technologies, and process to best fit with existing practices", "\n·        Experience creating technical documentation and training material", "\n·        Able to work autonomously with minimal supervision and collaborate effectively with local and remote co-workers", "\n·        Takes initiative to find better/faster ways of achieving desired outcomes", "\n·        Passionate for building & maintaining world-class products", "\n·        Excellent problem solving & troubleshooting skills", "\n·        Excellent written and oral communication skills with ability to adjust to technical and non-technical audiences", "\n·        Ability to identify and raise key technical and/or process issues and collaborate with others to find solutions", "\n·        Passion for learning and track record of acquiring new skills and technologies in a rapid fashion", "\n·        Experience with automation tools to deploy platforms", "\n·        Experience working with regulated data and understanding of constraints and limitations of its usages", "\n", "\nSound like a fit?  We invite you to visit ", " to submit your application and resume!  When applying please use job opening ID # 920.", "\n    "], "images": [], "type": "full-time"},
{"text": "Research Technologies Software Engineer", "date": "2019-08-07 08:40", "compensation": "doe", "link": "https://seattle.craigslist.org/see/sof/d/seattle-research-technologies-software/6951479678.html", "address": ["\n        ", "\nThe University of Washington (UW) is proud to be one of the nation’s premier educational and research institutions. Our people are the most important asset in our pursuit of achieving excellence in education, research, and community service. Our staff enjoys not only outstanding benefits and professional growth opportunities, but also an environment noted for diversity, community involvement, intellectual excitement, artistic pursuits, and natural beauty. ", "\n", "\nUW Information Technology (UW-IT) has an outstanding opportunity for a Research Technologies Software Engineer (RTSE)  Req#170156.", "\n", "\nAbout the Position", "\n", "\nTake your part in the University of Washington's 150-year tradition of academic excellence, scientific breakthroughs, high-tech innovation, thriving arts, and public service.", "\n", "\nAcademic Experience, Design and Delivery (AXDD), a unit within UW Information Technology, is seeking a talented, thoughtful and motivated Software Engineer to work as part of a team to design and develop systems that integrate on-demand computing infrastructure and application environments into various curricula so that students and faculty can easily use them in their courses.  ", "\n", "\nAXDD is a highly supportive environment for creative work, and we are fortunate to have:", "\n•\tAn open and collaborative workplace that promotes cross-unit and cross-disciplinary interactions;", "\n•\tA commitment to reducing project administration overhead (Yes, we are an Agile development shop);", "\n•\tTime devoted to self-directed innovation projects;", "\n•\tColleagues who refine processes, evaluate technologies, and experiment to find ways to improve the workplace", "\n•\tA strong commitment to ensuring a healthy work/life balance. While we have high expectations for quality work, we believe that great work happens in 40-hour weeks.", "\nAXDD’s Engineering team is dedicated to the use of technology to support the UW’s public mission. We push ourselves and each other to develop as engineers and find ways to share this knowledge back with the team, so we all continue to grow. We work hard, and most importantly, have fun doing so.", "\n", "\nAbout You", "\n", "\nBy applying for this position, you are telling us that:", "\n•\tYou love an engineering challenge. Specifically, the cutting-edge challenge of architecting solutions that make it easy to use computational sandboxes, Jupyter notebooks, and Amazon Web Services for courses;", "\n•\tYour decisions are guided by data, process, vision, and an inherent need to make things work better;", "\n•\tYou know that implementation plans are a result of careful, collaborative engineering decisions;", "\n•\tYou believe in clear communication as the foundation to any relationship;", "\n•\tYou have reasons for wanting to work in higher education, at a public institution, and/or, more specifically, at the UW.", "\nRequirements", "\n", "\nMinimum education:", "\n•\tBachelor’s degree in Computer Science, Mathematics, Informatics or related field or equivalent experience.", "\n4 years experience with the following:", "\n•\tDeveloping applications with a programming language such as Python, JavaScript, C#, Ruby, Swift, or PHP.", "\n•\tUsing Amazon Web Services (AWS), Microsoft Azure, or Google Cloud Platform.", "\n•\tUsing Git for source-control, continuous integration, and release management.", "\n•\tSoftware testing and documentation, with a commitment to quality.", "\n•\tCarrying out secure application and system design and coding practices.", "\n•\tQuickly learning and applying new technologies and skills.", "\n•\tStrong communication and interpersonal skills balanced by the ability to work independently and to seek input from colleagues efficiently as needed.", "\n•\tDemonstrated excellent written/oral communication skills, technical documentation skills, and ability to relate well with colleagues and customers.", "\n", "\nAdditional minimums:", "\n•\tStrong communication and interpersonal skills balanced by the ability to work independently and to seek input from colleagues efficiently as needed.", "\n•\tDemonstrated excellent written/oral communication skills, technical documentation skills, and ability to relate well with colleagues and customers.", "\n", "\nEquivalent education/experience will substitute for all minimum qualifications except when there are legal requirements, such as a license/certification/registration.", "\n", "\nDesired experience:", "\n•\tExperience with CI/CD technologies and platforms such as GitHub, Jenkins, Travis-CI, AWS CodeBuild, Azure DevOps, or GCP Cloud Build.", "\n•\tExperience configuring and managing containers and container registries.", "\n•\tExperience implementing data access and application security policies.", "\n•\tExperience with Agile development practices, including test-driven development.", "\n•\tExperience with Jupyter Hub, Binder Hub, or Dask technologies.", "\n•\tKnowledge of Learning Tools Interoperability standard. ", "\n•\tExperience in a research university or other academic institution", "\n", "\nDoes this sound like a match for your skills and interests? Ready to get started?", "\nTo apply, please enter Requisition #170156 at ", "\n", "\n", "\n    "], "images": [], "type": "full-time"},
{"text": "Senior Database Engineer (Cassandra)", "date": "2019-08-30 14:13", "compensation": "~$80.00/hr (W2 only) with some flex on rate. Paid Time Off. Optional Medical, Dental, Vision, 401k", "link": "https://seattle.craigslist.org/see/sof/d/seattle-senior-database-engineer/6968177667.html", "address": ["\n        ", "\n", "\n", "\n", "\n", "\n", "\n", "    "], "images": [], "type": "contract"},
{"text": "Established Software Company Looking for a Senior Software Engineer", "date": "2019-08-12 10:53", "compensation": "Salary + Bonus + 401K + Company Healthcare + Paid Vacation", "link": "https://seattle.craigslist.org/sno/sof/d/established-software-company-looking/6955079413.html", "address": ["\n        ", "\nOpportunity to become a part of a established Snohomish based software company! ", "\n", "\nJob Title - Senior Software Engineer", "\n", "\nLocation - Minisoft HQ in The City of Snohomish, Washington", "\n", "\nWe seek an energetic, can-do person who understands happy customers are the key to our long-term success. You will be responsible for interacting and assisting existing customers and prospects in the use of our supply chain execution and ecommerce solutions. You will have opportunities to support our sales staff in pre-sales selling situations with actual product demonstrations and PowerPoint presentations at tradeshows, customer locations or via webinars. Responsibilities may also include creation of technical notes, support videos, and product FAQ's.  ", "\n", "\nThe applicant must have good writing skills, as the position will require written interactions with customers, reseller partners and prospects. A college degree in a technical discipline is a requirement. Computer Science or Engineering is preferred. Applicants must have a good working knowledge of Java or C as there will be opportunities for product development. Also, an understanding of XML, JSON, ZPL and/or SQL Server would be a plus. Work experience in the area of supply chain logistics, warehouse or transportation management would be an even bigger PLUS!", "\n", "\nBut, we are NOT just looking for a \"Techie\". We are looking for a well-spoken individual with a customer-oriented personality that has some solid technical abilities.", "\n", "\nMinisoft offers a very competitive compensation plan with paid vacation, profit sharing, company 401K and a generous healthcare plan that covers the employee and their families.", "\n", "\nFounded in 1983, Minisoft is headquartered in beautiful Snohomish, Washington USA (www.historicdowntownsnohomish.org). Minisoft is a worldwide leader in delivering supply chain execution solutions that enable retailers and manufacturers to ship smarter and sell more!", "\n", "\nMinisoft, Inc.", "\n1024 First Street", "\nSnohomish, WA 98290", "\nwww.minisoft.com", "\nsupport.minisoft.com", "\nTwitter @minisoft_inc ", "\n", "\nMinisoft, Inc. is an equal opportunity employer. All applicants will be considered for employment without attention to race, color, religion, sex, sexual orientation, gender identity, national origin, veteran or disability status.", "\n    "], "images": [], "type": "full-time"},
{"text": "Data Engineer", "date": "2019-08-06 10:47", "compensation": "DOE", "link": "https://seattle.craigslist.org/est/sof/d/bellevue-data-engineer/6950841927.html", "address": ["\n        ", "\nAffirma, five years in a row ranked \"Best Companies to Work for\" and \"Fastest Growing Companies\" in Washington is seeking a mid level Data Engineer to join our growing Data & Analytics team. This individual will support Affirma’s mission to provide exception value to our clients by planning, executing, and deploying data management solutions. ", "\n", "\nQualifications", "\n·        2-4 years experience in dimensional data modeling, ETL development, and data warehousing in a professional capacity", "\n·        Bachelor’s degree or equivalent education and/or experience", "\n·        Hands-on experience with at least one, and exposure to a variety of leading ETL, database, or data warehousing technologies like Azure, SQL Server, AWS, SSIS, and Redshift", "\n·        Strong knowledge of relational databases including retrieving, manipulating, creating, updating, and deleting data and database objects", "\n·        Experience bringing together data from many disparate data sources to a unified source of truth", "\n·        Hands-on experience implementing data warehouses of any scale and understanding of data warehousing best practices", "\n·        Advanced knowledge of T-SQL in developing complex queries, stored procedures, functions, and database administration operations, and query optimization and tuning", "\n·        Ability to work in a dynamic environment with some level of ambiguity to implement customer and project requirements with minimal supervision", "\n·        Driven by analytics and naturally curious to ask “why” and “what if”", "\n·        Excellent written and verbal communication with stakeholders, team members, and in documentation", "\n", "\nResponsibilities", "\n·        Design, propose, and develop database and data warehousing solutions", "\n·        Collaborate with team members to refine and debug scripts and reports", "\n·        Write and maintain documentation to describe database development, logic, scripting, testing, changes, and corrections", "\n·        Support the release of solutions into production environments", "\n·        Balance shifting priorities, demands, and timelines while effectively communicating expectations to team members and stakeholders in a clear and timely fashion", "\n·        Provide technical to assistance to data consumers regarding errors, problems, or questions with databases and reports", "\n·        Provide thought leadership, best practices, and standards required to deliver effective, lasting, and easy-to-maintain solutions to clients", "\n·        Continuously grow depth and breadth of knowledge of leading data and analytics tools and principles", "\n", "\nPreferred experience includes:", "\n·        Background in computer science or related technical field", "\n·        Knowledge of programming or scripting language like R, Python, or JavaScript", "\n·        Experience working with Big Data tools like Hadoop", "\n", "\nAccountabilities and Measures", "\n·        Keeping our clients happy", "\n·        Working and collaborating well with internal and external team members", "\n·        Staying within project budget targets", "\n·        Adhering to billable and un-billable policies", "\n", "\nSound like a fit?  We invite you to head to ", " and submit your application!  When applying please refer to Job Opening ID # 875.    "], "images": [], "type": "full-time"},
{"text": "Senior Sitefinity Software Engineer", "date": "2019-08-13 12:25", "compensation": "DOE", "link": "https://seattle.craigslist.org/est/sof/d/bellevue-senior-sitefinity-software/6955917312.html", "address": ["\n        ", "\nAffirma Consulting, a young, fast paced, award winning tech company ranked one of the \"Top 5 Best Mid-Size Companies to Work For\" by the Seattle Business magazine, is looking for a Senior Sitefinity Software Engineer with a passion for people and coding to join our Custom Development team.  If you are not local to one of our current office locations we invite you to apply to join our remote team.", "\n", "\nThis is a great opportunity to join a growing organization that focuses on creating cutting edge, inhouse technical solutions for large to enterprise level clients. In this role you will engage with stakeholders and global team members to flush out project needs, drive development and ensure client satisfaction.", "\n", "\nResponsibilities and Skills:", "\n·        Experience working with .Net technologies: C#, ASP.NET, and MVC", "\n·        Website development ", "\n·        Knowledgeable in JavaScript and/or AngularJS, ReactJS, jQuery ", "\n·        Previous experience creating new Sitefinity widgets and modules", "\n·        Proven experience working the full development life cycle including discovery, implementation, and delivery (on time and on budget)", "\n·        Ability to plan and execute website implementation on Sitefinity", "\n·        Experience working with other CMS systems such as Sitecore or Kentico", "\n·        Previous experience working with e-commerce technologies such as Magento of BigCommerce", "\n·        BS Degree in Computer Science or equivalent", "\n", "\nLocation:", "\n·        Open to both local and remote based candidates", "\n", "\nWhy Affirma?", "\n·        One of Washington's Fastest Growing Private Companies & Top 100 Best Companies to Work For (According to Seattle Business Magazine and Puget Sound Business Journal)", "\n·        Casual environment, surrounded by incredibly intelligent and motivated co-workers, and a performance-driven culture", "\n·        Flexible Schedule", "\n·        Opportunity for growth", "\n·        Great location, great people, exciting projects, and tons of fun.", "\n", "\nAffirma is an award-winning consultancy specializing in Mobile, Cloud, Business Intelligence, SharePoint, Technology Infrastructure, Custom Development, Visual Design, and Staffing Services. We focus on delivering true, measurable business value to our clients. We have top industry customer satisfaction and are dedicated to delivering dependable and reliable solutions that exceed client expectations. Affirma's motto is quality solutions on budget, on time, every time.  ", "\n", "\nSound like a fit?  We invite you to head to ", " and submit your application using the job opening ID # 899!    "], "images": [], "type": "full-time"},
{"text": "Salesforce Senior Product Manager", "date": "2019-08-06 16:21", "compensation": "competitive", "link": "https://seattle.craigslist.org/see/tch/d/seattle-salesforce-senior-product/6951122938.html", "address": ["\n        ", "\nOur client in the bay area is looking for a Product Manager to drive growth and new development within Salesforce. You'll be responsible for developing a strategy and roadmap for the company's product offerings for Salesforce. You'll work closely with the Engineer and Design teams to create innovative products and bring them to market. Ultimately, what's great about this opportunity is you'll be a part of a team that works on some of the most impactful and challenging problems in the software industry!", "\n", "\nTop requirements for the role:", "\n   - 8 years of product management experience (including in a SAAS, cloud, or B2B environment)", "\n   - Bachelor's degree in a technology related field", "\n   - Experience releasing products on Salesforce AppExchange", "\n", "\nWork location can either be San Francisco or Seattle. ", "\n", "\nIf you are interested, please attach a copy of your resume detailing your experience.    "], "images": [], "type": "full-time"},
{"text": "Mechanical HVAC Design Engineer", "date": "2019-08-05 14:11", "compensation": "85,000.00 to 115,000.00", "link": "https://seattle.craigslist.org/see/egr/d/seattle-mechanical-hvac-design-engineer/6950259487.html", "address": ["\n        ", "\nThe Senior Project Design Engineer is responsible for layout, design and coordination of assigned building projects. The primary responsibilities of the Senior Project Design Engineer will be the development and production of HVAC and plumbing construction documents, overseeing project design teams, as well as mentoring less experienced engineers.", "\n", "\nResponsibilities:", "\n• Develop and evaluate system concepts and options to determine the best design and engineering solution for each project based upon the project scope", "\n• Design mechanical systems including the preparation of all engineering calculations including load calculations, equipment selection and layout throughout the life of the project, and ultimately responsible for the mechanical system designs of project design team", "\n• Work with code authorities as required for approval of the plans or if code-related questions arise", "\n• Distribute all approved drawings and specifications", "\n• Coordinate with other design team members including the architect and the electrical and structural engineers to ensure mechanical systems are integrated with all trades", "\n• Work with the Director of Engineering to manage design manpower budget and update budget to reflect revisions or changes in scope", "\n• Deliver bi-yearly performance reviews of assigned project team and be actively involved in goal setting for team members", "\n• Work as a team member with construction team project manager and fabrication and installation crews", "\n• Passionate interest in mentoring less experienced engineers", "\n• Attend design meetings as required", "\n• Represent the company in a professional manner in all dealings with owners, architects, vendors, other design professionals and contractors", "\n• Other duties as assigned", "\n", "\nEducation & Experience:", "\n• Bachelor of Science degree in Mechanical Engineering", "\n• WA State Professional Engineer License preferred", "\n• Minimum of 6 years project design experience", "\n• Experience outside of project design (i.e. mechanical systems sales, project management, estimating, consulting, etc.) would be considered an advantage", "\n• Able to read architectural, structural, and mechanical plans; HVAC knowledge required, plumbing knowledge a plus", "\n• A working knowledge of SharePoint, Adobe Acrobat, and Bluebeam Revu software would be considered an advantage", "\n• Proficient in Microsoft Office Products, i.e. Word, Excel, PowerPoint and Outlook", "\n• Ability to work independently with minimum supervision or in a team atmosphere", "\n• Strong organizational and analytical skills", "\n", "\nAble to effectively interact with customers, service technicians, field personnel, sales and office staff", "\n• Possesses strong verbal, written, analytical, persuasion and interpersonal skills", "\n• Able to consistently set goals and meet deadlines and adapt to flexible responsibilities    "], "images": [], "type": "full-time"},
{"text": "Senior Test Automation Engineer", "date": "2019-08-06 10:11", "compensation": "DOE", "link": "https://seattle.craigslist.org/see/sof/d/seattle-senior-test-automation-engineer/6950805519.html", "address": ["\n        ", "\nSeven Simple Machines (7SM) is looking for an experienced test automation engineer to join our unique company. 7SM designs and builds data-driven web applications for clients of all sizes. We're a small delivery team of highly-skilled and self-organized technologists. We believe there are no limits to what we can learn and contribute individually and as a team. 7SM is small, and your impact will be huge. Our compensation package is very competitive, and we offer special perks such as flexible schedules and vacation policies, and a convenient location in downtown Ballard. ", "\n", "\n", "\nPosition Summary: ", "\n7SM is experiencing high growth and is in need of an experienced test automation engineer to build out a test automation framework for consumer-facing Web applications and/or tools for our internal team. This framework spans the full stack and sets our company's standards for continuous integration, deployment, verification, and improvement of software quality for a wide range of projects. The test automation engineer is responsible for implementing and managing best practice QA methodologies for both manual and automated testing. However, our compact size and dynamic nature require we all wear a lot of hats. The opportunities for professional growth, learning, and development are endless. Yours could include requirements writing, reviewing, analyzing and modifying software systems, debugging, and documentation. ", "\n", "\nHere's what we are looking for: ", "\n", "\n•\tYou have proven software development Test experience, including the following:", "\n•\tCoding experience in: C#, ASP.net web applications; Visual Studio; JavaScript; SQL; SQL Server Integration Services (SSIS).", "\n•\tExperience testing the data layer, middle layer, and UI", "\n•\tWilling and able to mentor the QA team on best practices writing test scenarios/cases", "\n•\tProven experience writing and maintaining a scalable and reusable automated tests framework", "\n•\tPassion for breaking web applications", "\n•\tExperience with Ranorex a plus", "\n", "\n•\tYou are self-organized and able to excel in independent and agile work environment", "\n•\tYou are self-confident, experienced, and knowledgeable in software QA methodologies and automated testing ", "\n•\tYou have creative problem-solving and troubleshooting skills", "\n•\tYou thrive in a collaborative environment and have strong communication skills", "\n", "\n", "\nPlease send resume as a PDF or Word attachment and include a cover letter as the text of the email. Your cover letter is your opportunity to prove you have the excellent communication skills you're claiming in your resume. Include information such as why you are applying, what you want in your work, your salary requirements, etc.", "\n", "\nLocal candidates only. ", "\n", "\nAbout Us", "\nWe work hard because we love providing our clients with the best software in the industry. You need to share our passion for innovation, software, company growth and our commitment to a work-life balance.", "\n", "\nWhen we're not developing software for our clients, we are supporting the local sports teams, enjoying free refreshments and snacks or BBQing on the deck.", "\n    "], "images": [], "type": "full-time"},
{"text": "Senior Software Developer", "date": "2019-08-06 10:53", "compensation": "DOE", "link": "https://seattle.craigslist.org/est/sof/d/bellevue-senior-software-developer/6950846902.html", "address": ["\n        ", "\nAffirma Consulting, a young, fast paced, award winning tech company ranked one of the \"Top 5 Best Mid-Size Companies to Work For\" by the Seattle Business magazine, is looking for a Full stack Software Engineer with a passion for people and coding to join our internal Custom Development team in our growing Austin office! ", "\n", "\nThis is a great opportunity to join a growing organization that focuses on creating cutting edge, inhouse technical solutions for large to enterprise level clients. In this role you will engage with stakeholders and global team members to flush out project needs, drive development and ensure client satisfaction.", "\n", "\nApplication Technologies:", "\n· Experience working with .Net technologies: C#, ASP.NET, and MVC", "\n· SQL experience: querying, table design, DB administration, stored procedures, etc.", "\n· Comfortable engaging with high-level stakeholders both internal and external to Affirma ", "\n· Experience in modern web technologies (ie. Angular, React, Ember, Vue)", "\n· Proven experience working the full development life cycle including discovery, implementation, and delivery (on time and on budget)", "\n· Experience and willingness to work with offshore and remote based teams throughout the US ", "\n· BS Degree in Computer Science or equivalent", "\n", "\nNice to have", "\n· Experience in Azure Service Bus", "\n· Integration experience", "\n· Microservices, Azure Service Fabric", "\n· Azure ARM", "\n", "\nWhy Affirma?", "\n· One of Washington's Fastest Growing Private Companies & Top 100 Best Companies to Work For (According to Seattle Business Magazine and Puget Sound Business Journal)", "\n· Casual environment, surrounded by incredibly intelligent and motivated co-workers, and a performance-driven culture", "\n· Flexible Schedule", "\n· Opportunity for growth", "\n· Great location, great people, exciting projects, and tons of fun.", "\n", "\nAffirma is an award-winning consultancy specializing in Mobile, Cloud, Business Intelligence, SharePoint, Technology Infrastructure, Custom Development, Visual Design, and Staffing Services. We focus on delivering true, measurable business value to our clients. We have top industry customer satisfaction and are dedicated to delivering dependable and reliable solutions that exceed client expectations. Affirma's motto is quality solutions on budget, on time, every time.", "\n", "\nInterested in this opportunity? We invite you to visit ", " and submit your application! When applying, please use the Job Opening ID # 926.    "], "images": [], "type": "full-time"},
{"text": "Data Engineer", "date": "2019-08-06 11:03", "compensation": "DOE", "link": "https://seattle.craigslist.org/est/sof/d/redmond-data-engineer/6950857121.html", "address": ["\n        ", "\nAffirma is seeking a Data Engineer to join a video gaming focused client of ours in Redmond! This individual will build large-scale warehouses in Azure to present data to real-time production systems. You will capture data to improve test-driven methodologies and build a culture around data driven development. If you are someone who is passionate about data and the gaming industry, then please read on!", "\n", "\nQualifications", "\n·4+ years’ experience in ETL development and data warehousing in a professional capacity", "\n·4+ years’ experience building cloud hosted data systems, strong preference in Azure", "\n·Strong knowledge in Azure Data Explorer and Azure Data Lake and developing ETLs in Databricks and Data Factory", "\n·Advanced knowledge of T-SQL in developing complex queries, stored procedures, functions, and database administration operations", "\n·Strong communication and collaboration skills as well as a strong attention to detail", "\n·Experience designing and implementing scalable ETL processes including data movement (SSIS, replication, etc.) and quality tools", "\n·Strong knowledge of relational databases including retrieving, manipulating, creating, updating, and deleting data and database objects", "\n·Driven by analytics and naturally curious to ask “why” and “what if”", "\n·Passionate about the Gaming Industry a plus!", "\n·Computer Science, Data Science or Machine Learning degree is preferred", "\n", "\nResponsibilities", "\n·Design, propose, and develop database and data warehousing solutions", "\n·Build pipelines and data models in Azure to support the decision-making process", "\n·Collaborate with team members to refine and debug scripts and reports", "\n·Balance shifting priorities, demands, and timelines while effectively communicating expectations to team members in a clear and timely fashion", "\n·Ability to work independently and take ownership of assigned projects while also able to take direction and feedback", "\n", "\nWhy Affirma?", "\n·Casual environment, surrounded by incredibly intelligent and motivated co-workers, and a performance-driven culture", "\n·Flexible Schedules", "\n·Opportunity for growth", "\n·Great people, exciting projects, and a fun atmosphere", "\n·Fun-filled company events held throughout the year", "\n ", "\nInterested in this opportunity?  Head over to ", " and submit your application and resume using the job opening ID # 917!    "], "images": [], "type": "full-time"},
{"text": "Infrastructure Consultant", "date": "2019-08-06 11:09", "compensation": "DOE", "link": "https://seattle.craigslist.org/est/sof/d/bellevue-infrastructure-consultant/6950862892.html", "address": ["\n        ", "\nRanked one of Puget Sound Business Journals “Best Workplaces” and “Fastest Growing Companies” for four years in a row, Affirma is expanding its IT infrastructure practice with a new Infrastructure Consultant role!  ", "\n", "\nIn this role you will consult, architect, and engineer comprehensive Information Technology infrastructures, both on-prem and cloud, for large to enterprise-sized businesses and organizations looking to add, move, migrate, or upgrade new technologies and/or solutions to their existing environment", "\n", "\nResponsibilities include:", "\n·        Apply thoughtful leadership and provide advice on multiple technologies that shape the long-term direction of a client’s IT infrastructure.", "\n·        Consult, develop, and engineer strategies and solutions to meet client objectives and needs in their IT infrastructure environment", "\n·        Produce documentation and convey best practices to clients", "\n·        Remain abreast of current and next gen IT technologies and be motivated to seek new knowledge and innovate methods across disciplines.", "\n·        Leverage in-depth knowledge of IT infrastructure and apply to client goals and objectives.", "\n·        Internal thought-leader on IT infrastructure technologies", "\n·        Using analytical thought and judgment to solve most complex or unique problems.", "\n·        Ensure IT services implemented are aligned with business current and expectations.", "\n·        Develop the framework and the supporting infrastructure to build common reusable components for core infrastructure solutions.", "\n·        Build external alliances and is external technical spokesperson for company for proof of concepts and product evaluations.", "\n·        When client concerns arise, adopt a sense of urgency for problem resolution and leverage any/all external resources to help solve the issue", "\n·        Maintains professional and technical knowledge by attending educational workshops; reviewing professional publications; establishing personal networks; benchmarking state-of-the-art practices; participating in professional societies.", "\n", "\nQualifications:", "\n·        Demonstrate proficiency to communicate effectively, both verbally and in writing, to various levels of management, and technical and non-technical personnel", "\n·        5-7+ years of both hardware and software technical industry experience in areas of IT enterprise consultancy, support, technical pre-sales and/or engineering/development.", "\n·        BS or MS degree in computer-oriented technical discipline or equivalent experience.", "\n·        Experience developing large-scale infrastructures. Technologies include, but not limited to: Windows Server and Active Directory 2003/2008(R2)/2012/2016/2019, Exchange Server 2003/2007/2010/2013/2016/2019, SQL Server 2005/2008 (R2)/2012/2014/2016/2017, VMWare 5.0+, Hyper-V, Firewalls (Cisco, Dell, Palo Alto, etc.), SANs (Dell, HP, NetApp, etc.)", "\n·        Experience evaluating, strategizing, and performing migrations for Exchange, OneDrive, Gmail, or other third-party email apps to O365", "\n·        Strong preference given to those with in-depth knowledge of O365, Azure, and AWS security", "\n·        Strong preference given to those with experience and architecting public cloud solutions for both SaaS and IaaS applications (AWS, Azure, Google, etc.)", "\n·        Strong preference given to those with active certifications (MCSA, AWS, etc.)", "\n·        Proficiency in one or more of the following: PowerShell, Linux/Unix Shell, SQL, C#", "\n·        Other desired proficiencies: Intune, DLP, Windows 10 Upgrade and Imaging, Networking (CCNA), MIM, MDM, and MAM, SCCM,", "\n·        Demonstrated successful working relationships with IT and Business customers", "\n·        Experience evaluating tools, technologies, and process to best fit with existing practices", "\n·        Experience creating technical documentation and training material", "\n·        Able to work autonomously with minimal supervision and collaborate effectively with local and remote co-workers", "\n·        Takes initiative to find better/faster ways of achieving desired outcomes", "\n·        Passionate for building & maintaining world-class products", "\n·        Excellent problem solving & troubleshooting skills", "\n·        Excellent written and oral communication skills with ability to adjust to technical and non-technical audiences", "\n·        Ability to identify and raise key technical and/or process issues and collaborate with others to find solutions", "\n·        Passion for learning and track record of acquiring new skills and technologies in a rapid fashion", "\n·        Experience with automation tools to deploy platforms", "\n·        Experience working with regulated data and understanding of constraints and limitations of its usages", "\n", "\nSound like a fit?  We invite you to visit ", " to submit your application and resume!  When applying please use job opening ID # 920.", "\n    "], "images": [], "type": "full-time"},
{"text": "Software Developer in Test (SDET)", "date": "2019-08-08 12:13", "compensation": "Up to US$100.00 per year", "link": "https://seattle.craigslist.org/see/sof/d/seattle-software-developer-in-test-sdet/6952422103.html", "address": ["\n        ", "\n\n        ", "\n    "], "images": [], "type": "full-time"},
{"text": "Senior Database Engineer (Cassandra)", "date": "2019-08-10 17:49", "compensation": "~$80.00/hr (W2 only) with some flex on rate. Paid Time Off. Optional Medical, Dental, Vision, 401k", "link": "https://seattle.craigslist.org/see/sof/d/seattle-senior-database-engineer/6954088065.html", "address": ["\n        ", "\n", "\n", "\n", "\n", "\n", "\n", "    "], "images": [], "type": "contract"},
{"text": "Senior Engineering Team Lead - Identity Services Platform", "date": "2019-08-10 17:48", "compensation": "Deluxe Compensation Package - high base salary, large sign-on bonus, annual bonus, retention bonus, World-class benefits", "link": "https://seattle.craigslist.org/see/sof/d/seattle-senior-engineering-team-lead/6954087613.html", "address": ["\n        ", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "    "], "images": [], "type": "full-time"},
{"text": "Frontend Developer", "date": "2019-08-13 12:23", "compensation": "DOE", "link": "https://seattle.craigslist.org/est/sof/d/bellevue-frontend-developer/6955915449.html", "address": ["\n        ", "\nAffirma Consulting, a young, fast paced, award winning tech company ranked one of the \"Top 5 Best Mid-Size Companies to Work For\" by the Seattle Business magazine, is looking for a Frontend Developer to join our growing Custom Development team! ", "\n", "\nThis is a great opportunity to join a growing organization that focuses on creating cutting edge, inhouse technical solutions for large to enterprise level clients. In this role you will engage with stakeholders and global team members to flush out project needs, drive development and ensure client satisfaction. ", "\n", "\nApplication Technologies and Requirements:", "\n•\tExperience working with .Net technologies: C#, ASP.NET", "\n•\tPrevious experience working with Azure or AWS ", "\n•\tSQL experience: querying, table design, DB administration, stored procedures, etc.", "\n•\tComfortable engaging with high-level stakeholders both internal and external to Affirma ", "\n•\tStrong background in utilizing JavaScript frameworks including ReactJS", "\n•\tProven experience working the full development life cycle including discovery, implementation, and delivery (on time and on budget)", "\n•\tExperience and willingness to work with offshore and remote based teams throughout the US ", "\n•\tWork closely with a cross-functional team of developers, designers, and QA engineers to produce high quality web applications", "\n•\tUnderstanding of client-side MVC frameworks", "\n•\tBS Degree in Computer Science or equivalent", "\n", "\n", "\nWhy Affirma?", "\n•\tOne of Washington's Fastest Growing Private Companies & Top 100 Best Companies to Work For (According to Seattle Business Magazine and Puget Sound Business Journal)", "\n•\tCasual environment, surrounded by incredibly intelligent and motivated co-workers, and a performance-driven culture", "\n•\tFlexible Schedule", "\n•\tOpportunity for growth", "\n•\tGreat location, great people, exciting projects, and tons of fun.", "\nAffirma is an award-winning consultancy specializing in Mobile, Cloud, Business Intelligence, SharePoint, Technology Infrastructure, Custom Development, Visual Design, and Staffing Services. We focus on delivering true, measurable business value to our clients. We have top industry customer satisfaction and are dedicated to delivering dependable and reliable solutions that exceed client expectations. Affirma's motto is quality solutions on budget, on time, every time.", "\n", "\nSound like a fit?  Head to ", " and submit an application using the job opening ID #869!    "], "images": [], "type": "full-time"},
{"text": "Embedded SW Engineer (C++, QNX or Embedded Linux)", "date": "2019-08-08 09:59", "compensation": "DOE", "link": "https://seattle.craigslist.org/see/sof/d/seattle-embedded-sw-engineer-qnx-or/6952298170.html", "address": ["\n        ", "\nEmbedded Engineer (C++, QNX or Embedded Linux) ", "\nContract/Contract to hire ", "\nSeattle, WA ", "\n", "\nOverview: ", "\nLooking for a solid Embedded Software Engineer to help contribute to design and implementation of embedded real-time features for our software product platform.", "\n", "\nResponsibilities: ", "\n· Design and implement embedded software for over various hardware and processor platforms (PowerPC, ARM, and/or DSP) ", "\n· Working closely with engineering team, verify product performance using commercial test equipment and field testing. ", "\n· Testing product viability through lab and field tests ", "\n", "\nRequirements: ", "\n· 5+ years hands on experience with real-time embedded software development on an RTOS (QNX or Embedded Linux preferred) ", "\n· Expert level C/C++ programming skills, bonus to have Python and Java experience.", "\n· Experience in board support package (BSP) or application abstraction layer is desirable.", "\n· Good understanding of embedded hardware and software systems.", "\n· Experience with software development in both Windows and Linux environments (Linux preferred, esp/ kernel level experience) ", "\n· Bachelors or Masters level education in Electrical Engineering or Computer Science ", "\n", "\nPreferred:", "\n·\tAutomotive Embedded SW Development", "\n·\tECU, Device Drivers, Autosar, CAN BUS", "\n", "\nFor consideration, please send resumes to jeffr@triadgroup.com.  All qualified resumes will be followed up with.  ", "\n", "\nJeff Roodhouse ", "\nTRIAD Group ", "\njeffr@triadgroup.com ", "\n425-454-0282 x220", "\n    "], "images": [], "type": "contract"},
{"text": "Infrastructure Consultant", "date": "2019-08-13 12:27", "compensation": "DOE", "link": "https://seattle.craigslist.org/est/sof/d/bellevue-infrastructure-consultant/6955919541.html", "address": ["\n        ", "\nRanked one of Puget Sound Business Journals “Best Workplaces” and “Fastest Growing Companies” for four years in a row, Affirma is expanding its IT infrastructure practice with a new Infrastructure Consultant role!  ", "\n", "\nIn this role you will consult, architect, and engineer comprehensive Information Technology infrastructures, both on-prem and cloud, for large to enterprise-sized businesses and organizations looking to add, move, migrate, or upgrade new technologies and/or solutions to their existing environment", "\n", "\nResponsibilities include:", "\n·        Apply thoughtful leadership and provide advice on multiple technologies that shape the long-term direction of a client’s IT infrastructure.", "\n·        Consult, develop, and engineer strategies and solutions to meet client objectives and needs in their IT infrastructure environment", "\n·        Produce documentation and convey best practices to clients", "\n·        Remain abreast of current and next gen IT technologies and be motivated to seek new knowledge and innovate methods across disciplines.", "\n·        Leverage in-depth knowledge of IT infrastructure and apply to client goals and objectives.", "\n·        Internal thought-leader on IT infrastructure technologies", "\n·        Using analytical thought and judgment to solve most complex or unique problems.", "\n·        Ensure IT services implemented are aligned with business current and expectations.", "\n·        Develop the framework and the supporting infrastructure to build common reusable components for core infrastructure solutions.", "\n·        Build external alliances and is external technical spokesperson for company for proof of concepts and product evaluations.", "\n·        When client concerns arise, adopt a sense of urgency for problem resolution and leverage any/all external resources to help solve the issue", "\n·        Maintains professional and technical knowledge by attending educational workshops; reviewing professional publications; establishing personal networks; benchmarking state-of-the-art practices; participating in professional societies.", "\n", "\nQualifications:", "\n·        Demonstrate proficiency to communicate effectively, both verbally and in writing, to various levels of management, and technical and non-technical personnel", "\n·        5-7+ years of both hardware and software technical industry experience in areas of IT enterprise consultancy, support, technical pre-sales and/or engineering/development.", "\n·        BS or MS degree in computer-oriented technical discipline or equivalent experience.", "\n·        Experience developing large-scale infrastructures. Technologies include, but not limited to: Windows Server and Active Directory 2003/2008(R2)/2012/2016/2019, Exchange Server 2003/2007/2010/2013/2016/2019, SQL Server 2005/2008 (R2)/2012/2014/2016/2017, VMWare 5.0+, Hyper-V, Firewalls (Cisco, Dell, Palo Alto, etc.), SANs (Dell, HP, NetApp, etc.)", "\n·        Experience evaluating, strategizing, and performing migrations for Exchange, OneDrive, Gmail, or other third-party email apps to O365", "\n·        Strong preference given to those with in-depth knowledge of O365, Azure, and AWS security", "\n·        Strong preference given to those with experience and architecting public cloud solutions for both SaaS and IaaS applications (AWS, Azure, Google, etc.)", "\n·        Strong preference given to those with active certifications (MCSA, AWS, etc.)", "\n·        Proficiency in one or more of the following: PowerShell, Linux/Unix Shell, SQL, C#", "\n·        Other desired proficiencies: Intune, DLP, Windows 10 Upgrade and Imaging, Networking (CCNA), MIM, MDM, and MAM, SCCM,", "\n·        Demonstrated successful working relationships with IT and Business customers", "\n·        Experience evaluating tools, technologies, and process to best fit with existing practices", "\n·        Experience creating technical documentation and training material", "\n·        Able to work autonomously with minimal supervision and collaborate effectively with local and remote co-workers", "\n·        Takes initiative to find better/faster ways of achieving desired outcomes", "\n·        Passionate for building & maintaining world-class products", "\n·        Excellent problem solving & troubleshooting skills", "\n·        Excellent written and oral communication skills with ability to adjust to technical and non-technical audiences", "\n·        Ability to identify and raise key technical and/or process issues and collaborate with others to find solutions", "\n·        Passion for learning and track record of acquiring new skills and technologies in a rapid fashion", "\n·        Experience with automation tools to deploy platforms", "\n·        Experience working with regulated data and understanding of constraints and limitations of its usages", "\n", "\nSound like a fit?  We invite you to visit ", " to submit your application and resume!  When applying please use job opening ID # 920.", "\n    "], "images": [], "type": "full-time"},
{"text": "Senior Software Developer", "date": "2019-08-13 12:29", "compensation": "DOE", "link": "https://seattle.craigslist.org/est/sof/d/bellevue-senior-software-developer/6955921303.html", "address": ["\n        ", "\nAffirma Consulting, a young, fast paced, award winning tech company ranked one of the \"Top 5 Best Mid-Size Companies to Work For\" by the Seattle Business magazine, is looking for a Full stack Software Engineer with a passion for people and coding to join our internal Custom Development team in our growing Austin office! ", "\n", "\nThis is a great opportunity to join a growing organization that focuses on creating cutting edge, inhouse technical solutions for large to enterprise level clients. In this role you will engage with stakeholders and global team members to flush out project needs, drive development and ensure client satisfaction.", "\n", "\nApplication Technologies:", "\n· Experience working with .Net technologies: C#, ASP.NET, and MVC", "\n· SQL experience: querying, table design, DB administration, stored procedures, etc.", "\n· Comfortable engaging with high-level stakeholders both internal and external to Affirma ", "\n· Experience in modern web technologies (ie. Angular, React, Ember, Vue)", "\n· Proven experience working the full development life cycle including discovery, implementation, and delivery (on time and on budget)", "\n· Experience and willingness to work with offshore and remote based teams throughout the US ", "\n· BS Degree in Computer Science or equivalent", "\n", "\nNice to have", "\n· Experience in Azure Service Bus", "\n· Integration experience", "\n· Microservices, Azure Service Fabric", "\n· Azure ARM", "\n", "\nWhy Affirma?", "\n· One of Washington's Fastest Growing Private Companies & Top 100 Best Companies to Work For (According to Seattle Business Magazine and Puget Sound Business Journal)", "\n· Casual environment, surrounded by incredibly intelligent and motivated co-workers, and a performance-driven culture", "\n· Flexible Schedule", "\n· Opportunity for growth", "\n· Great location, great people, exciting projects, and tons of fun.", "\n", "\nAffirma is an award-winning consultancy specializing in Mobile, Cloud, Business Intelligence, SharePoint, Technology Infrastructure, Custom Development, Visual Design, and Staffing Services. We focus on delivering true, measurable business value to our clients. We have top industry customer satisfaction and are dedicated to delivering dependable and reliable solutions that exceed client expectations. Affirma's motto is quality solutions on budget, on time, every time.", "\n", "\nInterested in this opportunity? We invite you to visit ", " and submit your application! When applying, please use the Job Opening ID # 926.    "], "images": [], "type": "full-time"},
{"text": "House Cleaners Needed ~ Local Co ~ Start Making  $19.5/hr + Tips", "date": "2019-08-13 15:45", "compensation": "$19.50/hr to start  (hourly rate for each job depends on frequency, and difficulty of the work)", "link": "https://seattle.craigslist.org/see/lab/d/seattle-house-cleaners-needed-local-co/6956078375.html", "address": ["\n        ", "\nWe are a Locally owned house and small business cleaning company. For over 30 years we have been providing P/T flexible work for people who LOVE to clean. We work in King, Pierce and Snohomish Counties. You choose the area, days and hours you want work, Monday-Friday, some weekends are available, start times range from :AM-early afternoon. Together we'll fill in your calendar/schedule with the information you provide. Work as little as 8-hours a week for a little extra income or over 30 hours if you want or need more. You can work for us as well as cleaning jobs on your own or another part-time job.", "\n", "\nWe require two visits to our in N. Seattle office. After that, work based from home and go to jobs in the areas, days and times you have chosen.", "\n", "\nThis business model has been working well for a long time and we have an excellent reputation around the Puget Sound!", "\n", "\nIf you are interested:", "\n", "\nFIRST: Call and listen to our 24/7 job line at: 206-337-2265 for more info about our business model. Leave a message by answering the questions we ask", "\n", "\nSECOND: To get an interview, fill out our online form:", "\n", "\n", "\n", "\nIf you clean a house well, we look forward to hearing from you!", "\n", "\n", "\nHere is what some of our cleaners have say about us:", "\n", "\n\"MINW is a great place to work--great pay, great friendly helpful staff! I've been happy here...!\" ~ Kim", "\n", "\n\"As a cleaner with MINW, I've been able to have a MUCH better work-life balance. Prior to contracting with them, I had to put my little girl in daycare, both before, and after school. As a single mom, it was devastating, and exhausting! Now I go to all my little girl's school functions, volunteer again, and still have time to be a musician, which is my passion. I make as much as I did in Healthcare, but work HALF the time! I love being an independent worker, while still having the benefit of a team backing me up. I have the best of all worlds, and I won't be leaving for a very long time!\" ~ Kathryn", "\n", "\n\"Maids in the Northwest gave me HOPE! The opportunity to work for myself and subcontract additional clients from Maids was exactly what I needed. The joy of cleaning was all the therapy I needed. It has been a wonderful experience and the communication between clients, Maids, and myself has been exceptional. Just a really good place to be, when I needed the flexibility and INCOME! What an opportunity to serve in your community and make a living at it too.", "\nThank You, ~ Kay", "\n", "\n", "\n\"I just wanted to take a moment to say that I have been a sub-contractor with Maid in the Northwest for quite a while. I also sub-contract with another company.", "\nI will tell you this, the Maids is the best as far as being fair, getting me work and paying me!", "\nI don't have to worry about someone under bidding me on a job. I have consistently gotten work. They have worked with me to make sure that I am getting what I need.", "\nThe staff is the best... Really!", "\nIf you are thinking about working with the Maids, don't take too long. Just see for yourself how good they are.", "\nI'm a very satisfied sub-contractor.\" ~ Paul", "\n", "\n\"As a sub-contractor with this company the past 2 years, I have been cleaning clients' homes who appreciate the use of high-quality cleaning services in maintaining their homes. I enjoy the flexibility I have with scheduling cleaning jobs through this company as well as scheduling my own personal clients. The MINW office staff has been especially helpful with scheduling longer-term cleaning clients for me.\" ~ Cathie ", "\n", "\n\"This has been a wonderful partnership for me for the past 14 years! I can sum it up in one word: flexibility! I'm a working musician and this company has been invaluable, because I can simply book cleaning jobs when I want to! That can be very tough in the traditional work world. I book the occasional cleaning job on my own, but the clear majority comes from this company. A very well run, fair company to contract with, staffed by great people! Who could ask for more?!\"", "\n~ Danny ", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\naccountant Actuary Managers Promotions Advertising Sales Agent Aircraft mechanic Airline Pilot Airport Security Screener Airline Reservations Agent Air Traffic Controller Architect Auto mechanic Bank Teller Bartender Biological Technician Biomedical Engineer Bookkeeping Accounting auditing Clerks Brick Mason Budget Analyst Cardiovascular Technologist Cashier Chef Chief Executive Officer CEO) Chemical Technician Childcare Worker Chiropractor Claims Adjuster Appraiser Examiner investigator Compensation Benefits Manager Computer Programmer Systems Analyst Construction Laborer Consultant Cook Correctional Court Reporter Curator Customer Service representative Database Administrator Dental Hygienist Dentist Derrick Operator Diagnostic sonographer Director Dietitian/Nutritionist Editor Electrician EMTs Paramedics English as a Second Language (ESL) Teacher Epidemiologist Event/Meeting Planner Fashion Designer Financial Advisor Financial Financial Services Sales Firefighter Fitness Trainer Flight Attendant Funeral Director Fundraiser Judge Glazier Grant Writer Graphic Designer Guidance Counselor Hairdressers Hairstylists Cosmetologists Health Educator Human Resources Assistant Human Resources Health Aide Industrial Designer Industrial Production Insurance Underwriter Interior Designer Interpreter Translator Janitor Lawyer Librarian Library /Technician Licensed Practical Nurse Loan Lodging Manicurist Manufacturing Market Research analyst Marriage Family Therapist Massage Mechanical Engineer laboratory Technician Model Nurse Practitioner Nursing Occupational Occupational therapy Painter Paralegal Legal Personal Trainer Pharmacist Pharmacy Technician Physician Photographer Physical Physical Therapy Plumber Police Postal service Producer Psychiatric Aide Public Relations Specialist Purchasing Receptionist Registered Nurse Retail Salesperson Retail Supervisor Roofer Secretary / Administrative Security guard Social Media Social Software Developer Special Education Subway Operator Taxi Driver Technical Writer Training Development Veterinarian Waiter/Waitress Web Developer Writer ing areas: Seattle Bellevue Redmond Kirkland Shoreline Bothell Des Moines Georgetown Tacoma Algona Federal Way North Bend Auburn Hunts Point Issaquah Redmond Bellevue Kenmore Renton Black Diamond Kent Sammamish Bothell SeaTac Burien Lake Forest Park Carnation Maple Valley Shoreline Clyde Hill Medina Skykomish Covington Mercer Isl Snoqualmie Des Moines Milton Tukwila Duvall Newcastle Woodinville Enumclaw Norm y Park Yarrow Point Arlington Bothell Brier Edmonds Everett Lake Stevens Lynnwood Marysville Mill Creek Monroe Mountlake Terrace Mukilteo Snohomish Stanwood Sultan Woodway Bonney Lake DuPont Edgewood Fife Fircrest Gig Harbor Lakewood Milton Orting Puyallup Sumner Tacoma University Place musician wait staff artisan artist school actors evening classes janitorial work parking attendant caregiver cook chef dog walkers retail customer service dishwasher biller hair stylist marketing grant writer driver LPN pet sitter server groomer busser dj entertainment janitors l scaper yard care gardener lawn maintenance laborer cocktailers servers bartenders groundskeeper restaurant real estate agent food service photographer childcare rep caregiver counselor concessions customer service hygienist receptionist driver barista dog walker dishwasher childcare cashier servers CNA Esthetician personal prep cook relief flagger delivery driver property lmp cpr hygienist leasing agent valet HDA CDA Gardner deli clerk dog trainer cleaning maid services housekeeping home care giving residential cleaners maintenance hotel household help office janitorial maintenance custodian care employment commercial business lady guy company companies Search terms: Queen Anne Downtown Belltown Downtown Belltown Lower Queen Anne Queen Anne Ballard Magnolia Capitol Hill Beacon Hill Crown Hill Columbia City Central District Rainier Beach Renton Tukwila Mill Creek SODO Ravenna Madrona Seaview Delridge Laurelhurst West Seattle Washington Park Madison Park Montlake U District Fairmount Park White Center Redmond West Lake Hills SeaTac Kent Mercer Island Wallingford Phinney Ridge Lynnwood Mountlake Terrace Mukilteo Fremont Northgate joy Molly Maids Porch Red Beacon The Westin clean cleaner house keeping house keeper house keepers housekeeping maid janitor maids jobs limpieza limpiador homejoy limpiar mucama camarera parttime part time part-time full time full-time contract gig skill trade hospitality flexible part-time part-time contractor contracter housekeeping house keeping job student student jobs seasonal seasonal intern merrymaids merry maids molly maids mollymaids getmaids local dusting house keeping housekeeping commercial janitor team maid services housekeeping housekeepers care giving residential maintenance household help janitorial maintenance custodian care house employment commercial business lady guy company companies", "\n", "\n    "], "images": [], "type": "part-time"},
{"text": "Windows Server Engineer", "date": "2019-08-13 14:28", "compensation": "52,000-63,000 per year", "link": "https://seattle.craigslist.org/see/tch/d/seattle-windows-server-engineer/6956022199.html", "address": ["\n        ", "\nWindows Engineer Summary", "\n", "\nSee and solve Tier 2 technical challenges so your nonprofit clients can help people and communities flourish.  You will provide support by phone, email, and remote access, delivering advanced support of servers and infrastructure to clients and your team of help desk staff and field consultants. ", "\n", "\nAs a member of the IT Infrastructure team, you will engage on planned projects and emergent work.  The Windows Engineer position calls for a connector, with strong analysis skills, who is driven to successfully navigate advanced technology solutions. This position will use PowerShell to manage Microsoft Windows workstations and servers remotely. ", "\n", "\nThe Windows Engineer is responsible for 501 Commons’ nonprofit clients achieving stable technology environments. Since you will be responding to diverse nonprofit clients with urgent needs and various levels of technical understanding, your listening and communication skills must be well developed. You will be called on to show initiative, persistence and commitment to your team.  ", "\n", "\nAt the end of the day, wouldn’t you like to know that you played a role in nonprofits successfully accomplishing their missions?  ", "\n", "\n*Remote option available", "\n", "\nResponsibilities", "\nTier Two Support Line Services - (85%)", "\nProvides Tier 2 support to ensure that scheduled and emergency issues referred by field technicians and support line staff are resolved in a timely manner so that 501 Commons nonprofit clients so they can achieve their missions.", "\n•\tUtilizes remote management and monitoring system to effectively monitor, maintain and manage client systems", "\n•\tLogs all customer questions and problems and tracks the issues through to resolution, including timely recording of problem symptoms and status information in an effort to communicate with and properly utilize 501 Commons consulting staff", "\n•\tWorks as liaison, as necessary, between the customer and their other technology providers, including Internet, email, web hosting, and third-party hardware and software", "\n•\tEnsures problem resolution by initiating and tracking problem assignments to Support Line resources, vendors, and other 501 Commons staff, and by keeping the customer updated on the status of problem resolution", "\n•\tInitiates timely escalation of customer problems when necessary by documenting the impact to the customer, assigning an appropriate priority and resolution target, and raising management awareness for business impacting issues that have exceeded reasonable or expected resolution timelines", "\n•\tBrings creative thinking and initiative to other special projects that support the team’s effectiveness", "\n", "\nProfessional Development, Research, and Teamwork – (15%)", "\nWorks as an engaged member of the IT Infrastructure team. Provides Tier 2 backup that advances the success of the team successful so we can amplify the strength of our nonprofit clients. ", "\n•\tStrives to learn new products, trends and technologies; pursues independent learning opportunities; applies and shares learning gained from experiences and training; serve as mentor to team members; and deepens understanding of the nonprofit sector’s special needs", "\n•\tActively engages in team meetings and conversations, building a cohesive team environment ", "\n•\tResearches and assesses new products and emerging technologies for applicability in nonprofit and small business environments", "\n", "\nCompetencies", "\nCombines technical skills, initiative, excellent communications skills and an orientation toward teamwork will lead to satisfaction with the work and positive results for our nonprofit clients. ", "\n•\tRelationship Management –Works with integrity and ethically; develops and maintains constructive relationships by communicating respect; provides prompt and attentive service; handles interruptions and distractions with composure; develops trust and credibility with clients and team.", "\n•\tCommunication – Conveys information clearly in verbal and written form; demonstrates active listening skills; is able to communicate with people whose technology skills are at all levels; keeps others informed; maintains a sense of humor, even during difficult circumstances", "\n•\tReliability –Takes accountability for one’s work and determines solutions if there is a risk of not keeping a commitment; remains steady under pressure, using it to fuel efforts to become more productive and efficient. Able to achieve results with minimal supervision.", "\n•\tProblem Solving – Identifies core issue(s) in a timely manner; quickly generates a range of solutions and identifies, tests and implements logical solutions; resolves problems in early stages; works well in group problem solving situations; uses diagnostic tools efficiently and effectively; follows established troubleshooting procedures.", "\n•\tManaging Priorities – Prioritizes and establishes an effective balance when managing periods of high workloads and competing demands; plans and utilizes time efficiently; responds to changing customer needs; completes work in order of priorities.", "\n", "\nQualifications", "\nPreferred Education ", "\nBachelor’s degree in Computer Science, Information Technology, Business Technology, related field of study, or equivalent work experience.", "\n", "\nExperience", "\nRequired ", "\n•\tSix or more years’ experience in local and wide area networking technologies", "\n•\tExperience providing customer support over the telephone and/or remotely", "\n", "\nPreferred ", "\n•\tExperience leading projects and activities", "\n", "\nTechnical Skills ", "\nRequired ", "\n•\tA minimum of three years’ technical experience managing and maintaining Windows 7 and/or Windows 10 in an Active Directory (AD) domain environment.", "\n•\tDemonstrated skill in troubleshooting and resolving complex problems with Windows 7 and/or Windows 10.", "\n•\tExperience with ", "\no\tPowerShell for task automation, remote systems management, configuration, and/or data collection/reporting.", "\no\tWindows Management Instrumentation (WMI).", "\no\tWindows networking.", "\no\tBitlocker.", "\n•\tProficiency working with and supporting Microsoft Office suite in a networked environment", "\n•\tCertifications", "\no\tMTA/MCTS, CCENT/CCNA, A+/Network+", "\no\tValid WA driver’s license", "\n", "\nDesired ", "\n•\tKnowledge of ", "\no\tSystem security practices, intrusion detection, auditing, and mitigation methods on Windows OS. ", "\no\tInformation Technology Infrastructure Library (ITIL).", "\n•\tExperience with:", "\no\tMicrosoft Azure", "\no\tMicrosoft Active Directory", "\no\tWindows Hyper-V", "\no\tDomain Name Services (DNS)", "\no\tFirewalls", "\no\tx509 certificates", "\n", "\nWe know the right person for this role may not meet all our qualifications. If you think you could be a good fit, reach out and let us know!", "\n", "\nWhat we offer", "\n•\tFlexibility within a M-F, 8am to 6pm timeframe, including working remotely and/or from home. If hired outside of Puget Sound region, travel to Seattle once per quarter would be provided for team collaboration.", "\n•\tCollaboration with a small but highly professional team with opportunities for professional development.", "\n•\tBenefits including generous paid time off, holiday pay, and employer-paid medical, dental, and vision coverage", "\n•\tSalary range: $52,000 – 63,000", "\n", "\nInclusiveness Statement ", "\n501 Commons is an equal-opportunity employer and seeks to recruit persons of diverse backgrounds and to support the retention and advancement of diverse persons within the organization. We believe that a having a board, staff, and volunteer corps with diverse personal and professional backgrounds enhances our ability to meet our mission.", "\n", "\n501 Commons is committed to providing an inclusive workplace that includes people of diverse backgrounds and fully utilizes their talents to achieve its mission. We are committed to fostering and supporting a workplace culture inclusive of people regardless of their race, ethnicity, national origin, gender, sexual orientation, socio-economic status, marital status, age, physical abilities, political affiliation, religious beliefs or any other non-merit fact, so that all employees feel included, equal valued and supported.", "\n", "\nApplication Instructions", "\n", "\nTo apply, send a resume and cover letter to the provided email address with Systems Engineer in the subject line.", "\n", "\n", "\n    "], "images": [], "type": "full-time"},
{"text": "Senior Engineering Team Lead - Content Discovery Platform", "date": "2019-08-13 16:15", "compensation": "Deluxe Compensation Package - high base salary, large sign-on bonus, annual bonus, retention bonus, World-class benefits", "link": "https://seattle.craigslist.org/see/sof/d/seattle-senior-engineering-team-lead/6956098347.html", "address": ["\n        ", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "    "], "images": [], "type": "full-time"},
{"text": "Senior Engineering Team Lead - Core Advertising Monetization Platform", "date": "2019-08-13 16:17", "compensation": "Deluxe Compensation Package - high base salary, large sign-on bonus, annual bonus, retention bonus, World-class benefits", "link": "https://seattle.craigslist.org/see/sof/d/seattle-senior-engineering-team-lead/6956099838.html", "address": ["\n        ", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "    "], "images": [], "type": "full-time"},
{"text": "Software Engineer/Intermediate Software Engineer", "date": "2019-08-02 14:06", "compensation": "DOE", "link": "https://seattle.craigslist.org/see/sof/d/seattle-software-engineer-intermediate/6948168676.html", "address": ["\n        ", "\nBenaroya Research Institute at Virginia Mason is committed to winning the fight against autoimmune diseases such as type 1 diabetes, rheumatoid arthritis, inflammatory bowel disease and multiple sclerosis, and immune system diseases such as allergies and asthma. BRI is an internationally recognized medical research institute that accelerates discovery by tackling questions from every angle, translating immunology breakthroughs into clinical therapies and healthier patients. ", "\n", "\nAs a non-profit organization within the Virginia Mason Health System, BRI oversees all clinical research at Virginia Mason and BRI, uniquely combining the expertise of a world-renowned medical research institute with the remarkable care of a healthcare quality leader.  BRI supports Virginia Mason clinical investigators in studies across a wide variety of diseases and conditions, such as cardiology and cancer, in addition to autoimmune diseases, allergy and asthma.", "\n", "\nVisit BenaroyaResearch.org or follow Benaroya Research Institute on Facebook, LinkedIn or Twitter to learn more.", "\n", "\n", "  2019-1548", "\n", " Software Engineer/Intermediate Software Engineer", "\n", "  Data Management & Software Development  ", "\n", " Full-time, days", "\n", "\n", "\n", "\nWe are looking for a talented individual to join our team to develop web applications in support of research activities at the Benaroya Research Institute. ", "\n", "\n", "\n", "\nThe primary applications are focused on data management and data visualization. We have a strong interest in facilitating sharing data between researchers in order to answer specific scientific questions.", "\n", "\n", "\n", "\nApplicants should have at least 1 years of programming experience, the ability to learn new concepts and toolkits quickly, and experience with the following technologies:", "\n", "\n-\tObject Oriented Programming: Java, C++, Groovy/Grails", "\n-\tRelational and NoSQL database systems (MySQL, mongoDB)", "\n-\tJavaScript (jQuery, bootstrap, React)", "\n", "\nAdditionally experience with any of the following would be beneficial:", "\n", "\n-\tReact Native mobile development", "\n-\tR Statistical Analysis", "\n-\tPython", "\n", "\nA B.Sc. in Computer Science or equivalent experience is required.", "\n", "\nMust be a self-starter, comfortable in an agile environment, and someone who is capable of taking the seed of an idea and implementing a solution. Must be able to work independently while still being an integral part of a larger team.  Applicants must also have the ability to learn new concepts and toolkits quickly, good communication skills, be able to work as part of a larger team, willing to take ownership of different projects, have a strong interest in open source projects, and in advancing science.", "\n", "\nVisit ", " to apply for this position. ", "\n", "\n", "\n    "], "images": [], "type": "full-time"},
{"text": "Free Tech Training and Optional Job Placement  - Make 80,000 - 120,000 per year,", "date": "2019-08-19 07:59", "compensation": "70,000 to 100,000", "link": "https://seattle.craigslist.org/see/web/d/pacific-free-tech-training-and-optional/6959874747.html", "address": ["\n        ", "\n", "    "], "images": [], "type": "contract"},
{"text": "Engineer II", "date": "2019-08-20 14:30", "compensation": "$76,365.48", "link": "https://seattle.craigslist.org/sno/gov/d/everett-engineer-ii/6961015839.html", "address": ["\n        ", "\nENGINEER II (SURFACE WATER MANAGEMENT)", "\n", "\nSalary   $76,365.48 - $92,862.96 Annually", "\nClosing      9/8/2019 11:59 PM Pacific", "\nJob Type   Full-Time", "\n", "\nPlease post here: ", "\n", "\nSnohomish County Public Works is seeking an enthusiastic, creative, and talented individual to fill a key Engineer II position in the Capital section of the Surface Water Management (SWM) division.  Here is your chance to be part of a team prioritizing, analyzing, designing, and constructing fish passage improvements along with other infrastructure projects to reduce road and property flooding and improve water quality.", "\n", "\nSWM has a robust annual construction program, delivering 10-15 capital projects per year.  If working on meaningful and challenging capital projects from identification through construction sounds good to you, please consider applying for this Engineer II position.", "\n", "\nThe successful candidate will have qualities in alignment with SWM's core values: providing and demonstrating high quality service, leadership, stewardship, accountability, respect, and integrity.  You will have proficiency and expertise in analyzing and designing fish passage, drainage, and water quality projects; hydraulic and hydrologic computer modeling; developing construction drawings, cost estimates, and project specifications; and overseeing project construction.   Your excellent communication skills and ability to work well with staff and stakeholders with a variety of backgrounds will make you stand out.  Apply for this position to positively contribute to the delivery of high quality projects and service to the citizens of Snohomish County.", "\n", "\nFor further information on Snohomish County Surface Water Management's programs, please go to www.surfacewater.info.", "\n ", "\nSnohomish County, just north of Seattle, is located in northwest Washington between the Puget Sound and the Cascade Mountains. The county has rich scenery, numerous activities and a thriving economy.  Snohomish County is a great place to live, work, play, and raise a family.  We are proud to offer an outstanding benefit package to employees and their dependents. We are invested in your success and growth and offer competitive wages, job flexibility and stability, employer paid ORCA cards, and a friendly, diverse team atmosphere where employees are appreciated and make a real difference to the citizens we provide services to. We strive to not only provide a meaningful job, but a lifelong career.", "\n ", "\nSnohomish County The Future We Choose", "\n ", "\nAn Engineer in Training (EIT) certification is required for this position.", "\nJob Duties", "\n", "\nBASIC FUNCTION", "\n", "\n     To perform a variety of professional engineering assignments in design, traffic, construction, land development or program development which requires the application of standard engineering principles and methods. Assists Engineers III or IV, or coordinates the work of consultants or engineering staff as it relates to assigned engineering projects.", "\n", "\nSTATEMENT OF ESSENTIAL JOB DUTIES ", "\n1.Provides project management of road, bridge and other Public Works construction projects, including preparing or overseeing the preparation of specifications, cost and quantity estimates, the design of projects such as road, signal and bridge improvements, and surface water projects, and the oversight of the construction process.  ", "\n2.Oversees project construction to assure work is performed in accordance with plans and specifications; monitors and coordinates construction engineering activities, maintains field records, prepares progress estimates and change orders, develops budget projections and directs field technical personnel. ", "\n3.Conducts or directs the preparation of studies and preliminary field surveys in preparation for design and construction of public works facilities such as roadways, bridges, signals, solid waste sites, or drainage improvements. ", "\n4.Directs the site inspections of construction work to verify quality of installations and coordinate timely and quality completion for acceptance; monitors contractor progress and schedules quality  assurance tests and materials approvals. ", "\n5.Directs the inspection and maintenance of county bridges; assures that bridges and culverts are periodically inspected, maintained and repaired; submits the Annual Bridge Report re­quired by the state on existing bridge conditions. ", "\n6.Prepares project prospectus for applications for federal and state funding of public works projects, including the recommendations for improvements, estimates of required quantities, project cost estimates, and other relevant data. ", "\n7.Researches, analyzes and resolves engineering problems on county construction projects. ", "\n8.Develops, coordinates, and promotes funding program such as the Road Improvement District or River Improvement programs for the design, construction and maintenance of road, bridge and drain­age projects; provides information and assistance to program applicants. ", "\n9.Prepares right-of-way plans in order to acquire land for public works facilities; researches ownership, project requirements, and writes legal descriptions to convey property. ", "\n10.Provides information to professional engineers, architects, developers, county officials and the general public; presents and explains technical design or operational features, project priorities and development requirements of county policies. ", "\n11.Attends public meetings and formal public hearings on proposed county construction projects; prepares or supervises the preparation of maps, exhibits, drawings, charts and graphs and provides technical testimony as required. ", "\n12.Coordinates and reviews the work of other engineering staff as it relates to assigned construction projects; provides training in related work as required. ", "\n13.Prepares and reviews technical reports related to engineering assignments, including the areas of hydrology, hydraulics, traffic capacity, signal design, roadway geometrics and roadway structure design.", "\n", "\nSTATEMENT OF OTHER JOB DUTIES", "\n1.Performs other related duties as assigned.", "\n", "\nMinimum Qualifications", "\n", "\n     A Bachelor of Science degree in civil engineering or related field; AND two (2) years of professional civil engineering experience; OR, any equivalent combination of education and experience which provides the required knowledge, skill and ability to perform the work. Must pass job related tests.", "\n", "\n ", "\n", "\nSPECIAL REQUIREMENTS", "\n", "\n     An Engineer-in-Training certificate is required. ", "\n     A valid Washington State Driver's License is required.", "\n", "\nAdditional Information", "\n", "\nKNOWLEDGE AND ABILITIES", "\n", "\nKnowledge of:", "\n•principles, practices and techniques of engineering related to area of assignment ", "\n•federal, state and local laws, rules and regulations related to area of assignment ", "\n•the principles, practices and procedures associated with budget preparation and administration ", "\n•the methods and techniques used in conducting engineering studies and needs assessments ", "\n•the principles and practices of grant writing, contract negotiation and administration ", "\n•the literature, trends and developments in the area of specialty ", "\n•hydraulic and hydrologic computer modeling techniques ", "\n•computer software programs used in area of assignment ", "\n", "\nAbility to: ", "\n•interpret and assess field data used for the maintenance and design of construction projects ", "\n•prepare engineering plans, specifications and estimates ", "\n•direct and evaluate the inspection and appraisal of condition of public works structures ", "\n•allocate and make effective use of available resources ", "\n•assess the relative advantages and disadvantages of alternative courses of action ", "\n•gather, analyze, synthesize and evaluate a variety of data including statistical data ", "\n•read, interpret and apply federal, state and local laws, rules and regulations governing area of assignment ", "\n•analyze and evaluate operations and take effective action to correct deficiencies and resolve problems ", "\n•establish and maintain effective working relationships with elected officials, department heads, associates, subordinates, representatives of other agencies and with the general public ", "\n•communicate effectively, both orally and in writing ", "\n•prepare a variety of correspondence, reports, and other written materials and documents ", "\n•develop, run and assess various hydraulic and hydrologic models (required for some positions) ", "\n•use personal computer applications effectively", "\n", "\nSUPERVISION", "\n ", "\n", "\n     The work requires considerable independent judgment and discretion in developing and achieving work unit goals and objectives. The work is reviewed through meetings and periodic status reports, and by evaluation of results obtained.", "\n", "\n ", "\n", "\nWORKING CONDITIONS", "\n", "\n ", "\n", "\n     The work is performed in an office or field environment with frequent field trips to locations throughout the county to make site visits, attend meetings, or coordinate work activities. Meetings or project requirements may involve working evenings, weekends or holidays as necessary.", "\n ", "\n", "\nSnohomish County is an Equal Employment Opportunity (EEO) employer.", "\n", "\nAccommodations for individuals with disabilities are provided upon request.", "\nEEO policy and ADA notice", "\n", "\nPlease post here: ", "    "], "images": [], "type": "full-time"},
{"text": "Project Engineer - Electrical Construction", "date": "2019-08-20 14:47", "compensation": "DOE + benefits", "link": "https://seattle.craigslist.org/est/bus/d/project-engineer-electrical-construction/6961029384.html", "address": ["\n        ", "\nSequoyah Electric is an industry leader in the design, construction and maintenance of electrical and low voltage systems in the Puget Sound Area. We are currently seeking a Project Engineer to work in our Redmond, WA office and/or onsite at one of our Puget Sound area jobsites. This position requires experience with electrical estimating and construction project management. Position responsibilities include cost control, job cost analysis, drawing take-off and estimating, submittal preparation, change order management, correspondence with customer and internal team, document control including drawing updates, issue resolution and project management support.", "\n", "\nIf you're committed to customer service and producing an outstanding product, we think you'll find Sequoyah to be an exciting, enjoyable place to contribute and grow. Voted as a Best Workplace in 2014, 2015, 2016, 2017 and 2018, Sequoyah fosters an environment of teamwork with a commitment to excellence. It's evident when you walk through our building that we enjoy what we do. Whether it's our jobsite lunches, leadership and field supervisor development programs, annual Winterbash party, employee charity golf tournament, community service outings, or Hawaiian shirt Fridays, you'll enjoy being part of our team!", "\n", "\nJob Summary", "\n", "\n    Assists in coordinating the project team - field supervision, project resources and support department staff - as directed by the Senior Project Manager", "\n    Assists in monitoring project planning, execution and closure, and all project functions as they relate to quality control and project management", "\n    Establishes and maintains project management files", "\n    Maintains drawing sets", "\n    Estimates material takeoffs and develops change requests", "\n    Develops and tracks Requests for Information (RFI's)", "\n    Researches, acquires and collates Submittals and Operations & Maintenance manual materials.", "\n    Actively utilizes project management software and company network to meet all project requirements for documenting, measuring, tracking and resolving project issues", "\n    Assists with job billing preparation and substantiations", "\n    Tracks correspondence", "\n    Assists Project Managers with additional tasks as needed", "\n", "\nQualification Requirements", "\n", "\n    Minimum 1-3 years of experience in the construction industry with an electrical contractor performing estimating and/or project management duties", "\n    Bachelor's degree in electrical engineering or construction management OR equivalent field and project management experience", "\n    Strong project management skills with ability to manage project priorities and documentation", "\n    Ability to produce electrical estimates utilizing software-based electrical estimating program (McCormick or similar)", "\n    Good understanding of principles, methods, and techniques of architectural, civil, mechanical, and electrical engineering; Familiarity with construction means and methods", "\n    Knowledgeable of the National Electrical Code", "\n    Well-developed interpersonal and written communication skills", "\n    Ability to accurately and calmly handle multiple priorities with interruptions and still meet deadlines", "\n    Self-starter capable of working independently and as a member of a team", "\n", "\nBenefits", "\n", "\n    Employer Paid Medical Insurance for employees and eligible dependents", "\n    Employer Paid Dental & Vision Insurance for employees and eligible dependents", "\n    401(k) and Roth(k) retirement plans with company matching contribution", "\n    Paid Holidays", "\n    Paid Vacation", "\n    Paid Sick Leave", "\n    Employer Paid Life and AD&D Insurance for employees and eligible dependents", "\n    Employer Paid Long Term Disability income protection", "\n    Education Assistance Program", "\n    Worldwide Travel Assistance", "\n    Annual Company Events", "\n", "\nAPPLY HERE - ", "\n", "\n", "\n", "\nSequoyah is an equal opportunity employer. We are a non‐smoking facility and a drug and alcohol-free workplace. All new hires and employees are subject to drug testing in accordance with company policy.", "\nEqual Opportunity Employer, including disabled and veterans.", "\nView Company Information", "\n", "\n", "\n    "], "images": [], "type": "full-time"},
{"text": "Telecommunications Engineer", "date": "2019-08-21 09:16", "compensation": "70/hour", "link": "https://seattle.craigslist.org/see/sad/d/seattle-telecommunications-engineer/6961484632.html", "address": ["\n        ", "\n", "\nThe Telecommunications Engineer will provide expertise in all aspects of designing, maintaining, configuring and sustaining the Cisco VoIP network, including: voice network design, implementation, maintenance of existing networks, upgrading/configuration, documenting design and installation of Cisco hardware. In addition, the Engineer will utilize a broad knowledge of network communications and local area network/wide area network (LAN/WAN) operations to ensure optimum configuration and operation of all related Telecomm systems.", "\n", "\nThis role is for an experienced professional capable of independently carrying out assignments typical of someone who has both planned, designed and built from the ground up Cisco-based Telecommunication Infrastructure to include Cisco CUCM, Presence, ACD/IVR using Cisco UCCE or UCCX + tools for call recording, work force management, CTI and reporting solutions.", "\n", "\n", "\nRequirements:", "\n", "\n* 3 to 5 years of working knowledge of Cisco Unified Communications platform (Cisco Communications Manager, CUSP, Cisco Unity, Cisco UCCE, and Cisco voice gateways)", "\n* 3 to 5 years of telecommunications, implementation, and operation experience.", "\n* Bachelor of Science in Computer Sciences/ Electrical Engineering/related major or at least 3 years of experience in telecommunications engineering.", "\n* Experience with Cisco UCCE administration which includes ICM scripting and CVP applications and reporting and CUIC administration and reporting.", "\n* Experience working with call recording systems, WFM, CTI and reporting systems typical of a contact center environment", "\n* Hands-on experience in TCP/IP networking and troubleshooting tools, such as Wireshark, as it relates to troubleshooting VoIP signaling and media.", "\n* Experience with Cisco Switches, ASA’s and Routers (CCNA) or equivalent.", "\n", "\nKnowledge/Skills/Abilities", "\n* Ability to communicate technical and operational-related concepts to a range of technical and non-technical staff.", "\n* Ability to discuss telecommunications engineering solutions within team and with members outside of team.", "\n* Ability to perform as a team player on a Cisco Voice team.", "\n* Ability to resolve issues in a timely manner, forecast, and plan telecomm systems maintenance and upgrades.", "\n* Knowledge of programming languages (Python, C#, Java or other) and APIs related to Cisco or Call Center products a strong plus.", "\n* Effective verbal and written communication skills.", "\n* Solid understanding of enterprise dial-plan development and administration.", "\n* Good working knowledge of VoIP signaling (H323, SCCP, MGCP, SIP) and signaling inter-working with QSIG, PRI, and T1-CAS.", "\n* Strong work ethic and project management skills.", "\n* Strong understanding of LAN/WAN technologies and software tools for performance monitoring and troubleshooting.", "\n* Understanding of SIP and H323 video integration and interoperability in a Cisco IP Telephony environment.", "\n* Understanding of VoIP WLAN concepts, considerations, and best practices.    "], "images": [], "type": "contract"},
{"text": "Network Security Engineer", "date": "2019-08-22 14:10", "compensation": "Up to US$0.00 per year", "link": "https://seattle.craigslist.org/see/sof/d/bellevue-network-security-engineer/6962493867.html", "address": ["\n        ", "\n\n        ", "\n    "], "images": [], "type": null},
{"text": "Lighting Specialist", "date": "2019-08-22 15:10", "compensation": "DOE", "link": "https://seattle.craigslist.org/est/egr/d/redmond-lighting-specialist/6962538665.html", "address": ["\n        ", "\nSequoyah Electric is an industry leader in the design, construction and maintenance of electrical and low voltage systems in the Puget Sound Area. We are currently seeking a Lighting Specialist to join our team.", "\n", "\nIf you're committed to customer service and producing an outstanding product, we think you'll find Sequoyah to be an exciting, enjoyable place to contribute and grow. Voted as a Best Workplace in 2014, 2015, 2016, 2017 and 2018, Sequoyah fosters an environment of teamwork with a commitment to excellence. It’s evident when you walk through our building or jobsites that we enjoy what we do. Whether it's our jobsite lunches, leadership and field supervisor development programs, annual Winterbash employee appreciation party, employee charity golf tournaments, community service outings, or Blue Fridays, you’ll enjoy being part of our team!", "\n", "\nJob Summary", "\n", "\nThe Lighting Specialist will work closely with the project management team, engineers, architects, general contractors and owners to deliver complete design-build projects. This position directs, coordinates, and exercises functional authority for planning, organization, control, integration and completion of lighting project design. They will provide lighting layouts, designs, take-offs, and point-by-point calculations for the design, quote, and implementation of lighting systems.", "\n", "\nThe Lighting Specialist will also be responsible for the following:", "\n", "\n*Handle all aspects of :", "\n-Detailed specification lighting work.", "\n-Identify products.", "\n-Create a fixture schedule.", "\n-Verify light levels.", "\n-Address Watts per square foot requirements.", "\n-Knowledge of Non-Residential Energy Code (NREC).", "\n-Application of IES Standards.", "\n", "\n*Design Layout:", "\n-Place fixtures correctly in software program.", "\n-Coordinate with internal and external design team & trades.", "\n-Perform light level calculations.", "\n-Verify path of egress & illuminate.", "\n", "\n*Procurement:", "\n-Perform takeoffs.", "\n-Obtain and update final quotes before PO.", "\n-Complete submittal review process.", "\n-Review factory shop drawings.", "\n-Release approved products.", "\n-Coordinate delivery to site (i.e. scheduling).", "\n-Develop O&M documentation.", "\n", "\n*Work with Lighting Controls Specialist to complete finishing specifications.", "\n*Collaborate with the engineering team and project support staff, as well as architects, clients, and contractors.", "\n*Research and present design options, as well as collect data to support design decisions.", "\n*Create submittal packages to confirm system design.", "\n*Assist in product selection, development of specifications and contract documents.", "\n*Serve as a technical resource to internal Team Sequoyah as well as external customer base.", "\n*Obtain and interpret technical documents.", "\n*Travel to job-sites to gather information pre-bid, as well as equipment start up and commissioning post bid.", "\n*Communicate with customers in the form of meetings and presentations to understand and define their needs, provide project status, and respond to requests or concerns – both verbal and written.", "\n", "\n*Collaborate with the project management team to provide timely and detailed project data that includes:", "\n-Vendor purchase orders and purchase order revisions incl. storage/freight costs, if applicable.", "\n-Obtain change order pricing for scope revisions.", "\n-Current project status.", "\n-Shipping schedules.", "\n-Coordinate project deliveries.", "\n-Detailed documentation of all communications critical to accounting cost changes and returns.", "\n*Work with field staff to address troubleshooting on-site.", "\n*Have an understanding and be able to discuss lighting and lighting control code information.", "\n*Develop and maintain an expert level of knowledge on manufacturers’ products and product application.", "\n*Review vendor information and submittals.", "\n*Develop and maintain ongoing relations with lighting suppliers and representatives.", "\n*Manage several projects at one time.", "\n ", "\n", "\nQualification Requirements", "\n", "\nThe Lighting Specialist must possess the following abilities and skills:", "\n", "\nMinimum of 3 years’ experience in electrical industry performing lighting design.", "\nAble to interpret construction documents, electrical drawings, specifications, and light fixture cut sheets.", "\nSkilled in project management, task management, and problem solving.", "\nStrong working knowledge of AutoDesk software- Revit, AutoCAD.", "\nProficiency in Microsoft Office required.", "\nKnowledge of electrical lighting systems within buildings, photometric concepts, power supplies, sensors, and visual performance and comfort as it relates to Lighting.", "\nIES Accreditation preferred, IALD certification preferred", "\nExperience with conceptual estimating preferred", "\n ", "\n", "\nBenefits", "\n", "\nEmployer Paid Medical Insurance for employees and eligible dependents", "\nEmployer Paid Dental & Vision Insurance for employees and eligible dependents", "\n401(k) and Roth(k) retirement plans with company matching contribution", "\nPaid Holidays", "\nPaid Vacation", "\nPaid Sick Leave", "\nEmployer Paid Life and AD&D Insurance for employees and eligible dependents", "\nEmployer Paid Long Term Disability income protection", "\nEducation Assistance Program", "\nWorldwide Travel Assistance", "\nAnnual Company Events", "\n ", "\n", "\n", "\nAPPLY HERE: ", "\n", "\n", "\nSequoyah is an equal opportunity employer. We are a non‐smoking facility and a drug and alcohol-free workplace. All new hires and employees are subject to drug testing in accordance with company policy.    "], "images": [], "type": "full-time"},
{"text": "Network Security Engineer", "date": "2019-08-23 15:13", "compensation": "Up to US$0.00 per year", "link": "https://seattle.craigslist.org/see/sof/d/bellevue-network-security-engineer/6963283316.html", "address": ["\n        ", "\n\n        ", "\n    "], "images": [], "type": null},
{"text": "Cloud Software Engineer", "date": "2019-08-13 12:26", "compensation": "DOE", "link": "https://seattle.craigslist.org/est/sof/d/bellevue-cloud-software-engineer/6955918008.html", "address": ["\n        ", "\nAffirma Consulting, a young, fast paced, award winning tech company ranked one of the \"Top 5 Best Mid-Size Companies to Work For\" by the Seattle Business magazine, is looking for a cloud data centric Software Engineer with a passion for people and coding to join our internal Custom Development team. ", "\n", "\nThis is a great opportunity to join a growing organization that focuses on creating cutting edge, inhouse technical solutions for large to enterprise level clients. In this role you will engage with stakeholders and global team members to flush out project needs, drive development and ensure client satisfaction.", "\n", "\nApplication Technologies:", "\n·        Experience working with .NET technologies: C#, ASP.NET, and MVC", "\n·        SQL experience: querying, table design, DB administration, stored procedures, etc.", "\n·        Experience with Azure and Azure data technologies", "\n·        Data architecture and data warehousing experience", "\n·        Comfortable building reports and data visualizations", "\n·        Comfortable engaging with high-level stakeholders both internal and external to Affirma ", "\n·        Proven experience working the full development life cycle including discovery, implementation, and delivery (on time and on budget)", "\n·        Experience and willingness to work with offshore and remote based teams throughout the US ", "\n·        BS Degree in Computer Science or equivalent", "\n", "\nWhy Affirma?", "\n·        One of Washington's Fastest Growing Private Companies & Top 100 Best Companies to Work For (According to Seattle Business Magazine and Puget Sound Business Journal)", "\n·        Casual environment, surrounded by incredibly intelligent and motivated co-workers, and a performance-driven culture", "\n·        Flexible Schedule", "\n·        Opportunity for growth", "\n·        Great location, great people, exciting projects, and tons of fun.", "\n", "\nAffirma is an award-winning consultancy specializing in Mobile, Cloud, Business Intelligence, SharePoint, Technology Infrastructure, Custom Development, Visual Design, and Staffing Services. We focus on delivering true, measurable business value to our clients. We have top industry customer satisfaction and are dedicated to delivering dependable and reliable solutions that exceed client expectations. Affirma's motto is quality solutions on budget, on time, every time.", "\n", "\nInterested in this opportunity?  Head over to ", " and submit your application and resume using the job opening ID #912!    "], "images": [], "type": "full-time"},
{"text": "Senior Software Engineer (Full Stack)", "date": "2019-08-13 16:16", "compensation": "Compensation ~$80.00/hr (W2 only) with some flex on rate. Paid Time Off. Optional Medical, Dental, Vision, 401k.", "link": "https://seattle.craigslist.org/see/sof/d/seattle-senior-software-engineer-full/6956098644.html", "address": ["\n        ", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "    "], "images": [], "type": "contract"},
{"text": "Software Development Engineer III", "date": "2019-08-10 17:51", "compensation": "Attractive Compensation Package (Strong Base Salary + Bonus + Sign-On Bonus + Excellent Benefits)", "link": "https://seattle.craigslist.org/est/sof/d/bellevue-software-development-engineer/6954088491.html", "address": ["\n        ", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "    "], "images": [], "type": "full-time"},
{"text": "Software Test Engineer Needed for New Product Launch", "date": "2019-08-22 22:14", "compensation": "Competitive", "link": "https://seattle.craigslist.org/see/sof/d/seattle-software-test-engineer-needed/6962725023.html", "address": ["\n        ", "\nOur client is one of the most successful and important BioTech company born in Seattle and builds diagnostic tools that help researchers and scientists find treatments for some of our most challenging diseases. ", "\n", "\nThey have recently launched a new product and they're adding a Software Test Engineer to their Sustaining Engineering team to help ensure that customers are delighted. This is a long term contract role and comes with full benefits. ", "\n", "\nIn this role, you will be responsible for software integration testing and system verification testing of embedded software products on Microsoft Windows. Responsibilities include requirements review/analysis, test protocol development and execution, and report writing, all consistent with FDA medical device regulations.  This individual is also responsible for Tier 3 support, initial troubleshooting of reported problems and root cause analysis.", "\n", "\nEssential Functions: ", "\n•\tDevelop and execute written test protocols.", "\n•\tExecute written tests and perform exploratory testing.", "\n•\tContribute to test planning and design.", "\n•\tContribute to effort estimates on testing tasks.", "\n•\tReview and update requirements for testability, traceability, and completeness.", "\n•\tReview test protocols developed by other team members.", "\n•\tWrite test reports.", "\n•\tDocument traceability to ensure that the system software meets all quality requirements.", "\n•\tAct as Tier 3 support for reported issues, including performance of root cause analysis and troubleshooting", "\nRequirements:", "\n•\t4+ years of experience in a software test role which includes testing software on a Microsoft Windows platform.", "\n•\tBachelor’s degree in Computer Science, Engineering, or a related field, or equivalent experience.", "\n•\tDemonstrated ability to plan, design, and execute software tests.", "\n•\tGood verbal and written communication skills.", "\nDesired:", "\n•\tExperience with developing test automation..", "\n•\tExperience with embedded software.", "\n•\tExperience in a regulated environment (e.g., FDA, ISO 13485, IEC 62304).", "\n", "\n", "\nImmediate start. Must be able to pass a background check. Local candidates encouraged to apply. No relo available, no visa sponsorship available. ", "\n", "\n    "], "images": [], "type": "contract"},
{"text": "Senior Software Engineer", "date": "2019-08-23 06:26", "compensation": "DOE", "link": "https://seattle.craigslist.org/see/sof/d/lynnwood-senior-software-engineer/6962820751.html", "address": ["\n        ", "\nMelissa Data is seeking a talented senior software developer for our Seattle-area office to help expand our global address products.", "\n", "\nThis interesting and challenging position requires top flight coding skills, a solid understanding of software architecture principles, and well developed system thinking skills.", "\n", "\nYou will use these skills to expand the data processing capabilities for our core global address products.  You will refine existing data processing infrastructure and expand capabilities by adding new features and functions.  You will be part of the team that is developing of our global address products, including the ecosystem of utilities and processes that support their development.  You will take on everything from performance tuning to feature expansion. You will work closely with group leads to refine the development/configuration/QA processes that enable ongoing expansion of the Melissa Data’s family of global address products.", "\n", "\nIn addition to the skills listed above, the requirements for this job include:", "\n", "\n•\tBS in Computer Science, Software Engineering, closely related field, or relevant job experience", "\n•\t5+ years of experience in software development", "\n•\t1+ years writing back end or server-side systems ", "\n•\t3+ years writing software in C++ or C", "\n•\tProven ability to exercise technical judgment to set work priorities", "\n•\tProven ability to make consistent progress on problems with moderate levels of ambiguity", "\n•\tAbility to work both independently and as part of a team", "\n•\tTop notch interpersonal skills", "\n", "\nAdditional experience in these areas will be helpful:", "\n•\t1+ year experience doing data cleansing work", "\n•\tExperience developing software on both Windows and Linux platforms", "\n•\tExperience with both Visual Studio and Eclipse IDE", "\n•\tAbility to do basic data manipulation in a SQL database", "\n•\tFamiliarity with various models of software development (waterfall, agile, etc.)", "\n•\tFamiliarity with writing functional and unit tests for your own code", "\n•\tCompletion of 1+ years of a world language in college", "\n", "\nFounded in 1985, Melissa Data is a leading provider of solutions for address and phone number validation, postal coding, data enhancements and sales leads. A powerful line of software, databases, programming tools, and hygiene services has made Melissa Data a recognized leader in the data quality industry. ", "\n", "\nBenefits:", "\n•\tCompetitive salary", "\n•\t401(k)", "\n•\tMedical, dental and vision insurance", "\n•\tPaid holidays and personal time off", "\n•\tEasy access to I-5 in the Lynnwood area", "\n", "\nTo Apply:", "\n•\tE-mail your resume in PDF or Microsoft Word format , must include location/address to be considered", "\n•\tNo phone calls or recruiters please, NO remote workers", "\n    "], "images": [], "type": "full-time"},
{"text": "Software Engineer - C# .NET", "date": "2019-08-26 12:53", "compensation": "DOE", "link": "https://seattle.craigslist.org/est/sof/d/kirkland-software-engineer-net/6965204037.html", "address": ["\n        ", "\n\n\n\n", "\n    "], "images": [], "type": "full-time"},
{"text": "Senior Software Engineer - C# .NET - WPF", "date": "2019-08-26 12:54", "compensation": "DOE", "link": "https://seattle.craigslist.org/est/sof/d/kirkland-senior-software-engineer-net/6965205523.html", "address": ["\n        ", "\n\n\n\n", "\n    "], "images": [], "type": "full-time"},
{"text": "Software Engineer - C# .NET - WPF", "date": "2019-08-26 12:53", "compensation": "DOE", "link": "https://seattle.craigslist.org/est/sof/d/kirkland-software-engineer-net-wpf/6965204502.html", "address": ["\n        ", "\n\n\n\n", "\n    "], "images": [], "type": "full-time"},
{"text": "Senior Software Engineer - BrandVerity", "date": "2019-08-26 20:02", "compensation": "DOE", "link": "https://seattle.craigslist.org/see/sof/d/seattle-senior-software-engineer/6965482189.html", "address": ["\n        ", "\nWe are looking for a senior software engineer to tackle interesting data storage, access, and presentation problems and mentor others in a collaborative environment.  This is all done in the context of a small but stable software business that values solving customer problems, challenging work, and fulfilling lives outside of work.  Join our team as we find and root out evil on the Internet every day!", "\n ", "\n", "\n ", "\nWe have two big challenges: collecting the right data from the web about brand and product content in context and filtering that data down to the specific incidences that are of concern to our customers.  We solve brand protection problems in online content in automated and creative ways.", "\n ", "\nThe first piece is a big directed-crawling challenge, as we want to hit the interesting pages without having the resources to crawl the entire web.  This involves interpreting signals to determine whether following a link is likely to be interesting along with a typical spectrum of web crawling concerns.", "\n ", "\nThe second piece is filtering the content we find for the customer.  We use primarily heuristic-based solutions today, but expect to increasingly incorporate machine learning and natural language processing for identification of content in the future. For example, we're using machine learning to predict how customers will categorize issues based on their previous reviews. ", "\n ", "\nIn some cases, we are also detecting intentionally bad behavior, in a cat and mouse game to discover those bad (though intelligent) actors.", "\n ", "\nJoin our team and help to address these challenges while learning cool new technologies!  Grow your career in exploring challenging problem spaces like machine learning, big data and 'simply' writing responsive and elegant software that performs at an enormous scale!  Collaborate with like-minded developers who do all of this while working in a fun and dynamic environment!", "\n", "\n", "\n ", "\nAll of this data collection and filtering requires intelligent data storage, primarily in non-relational data stores within AWS, including DynamoDB, Redis, and our column-oriented data store on top of S3.  We also use Redshift and Redshift Spectrum (with Parquet/S3).  We use MySQL in RDS for core relational data.   We work in Python - it's a versatile tool. ", "\n ", "\nAll of our heavy liftings is done within AWS, leveraging Chef and EC2 Autoscaling groups to handle changing loads without human intervention.", "\n ", "\nWe have hired engineers from a variety of different backgrounds and have found that sharp engineers can identify shared concepts and quickly adapt to the new stack, so don't worry if your background does not include some of these technologies.", "\n ", "\nTo learn more about building at BrandVerity, please visit: ", "\n ", "\n", "\n", "\n*  Bachelor's degree in computer science or equivalent experience/training", "\n*  At least 6 years of software development experience - more is great, too!", "\n*  Experience designing substantial software components and features", "\n*  Hands-on experience in leading projects or being a significant contributor to software delivery", "\n*  Demonstrated passion and experience solving distributed systems problems", "\n*  Excellent communication and mentoring skills", "\n*  An enthusiasm for learning and solving complex problems", "\n*  A desire to invest in yourself and a team over time - we're in it for the long haul", "\n", "\n", "\n", "\n*  Health, dental, and vision insurance", "\n*  401k matching", "\n*  Unlimited vacation", "\n*  Incentive stock options", "\n*  Orca pass", "\n", "\n", "\n ", "\nWe trust each other to discover problems that need to be solved here and to shape our own roles.  We frequently collaborate to find innovative solutions.  We like to have fun together in addition to tackling complex and challenging problems.", "\n ", "\nWe communicate quite freely with sales, marketing, and account management as the company is small (under 40).  We use a lightweight product development process based on Scrum.  We engineer resilient systems so that we don't have to mess around with them all the time.", "\n ", "\nWe want you to have time to do the things that are important to you outside of work and come to work refreshed and inspired with your best ideas.  To that end, we keep reasonable working hours and have an unlimited vacation policy.  ", "\n ", "\n", "\n ", "\nBrandVerity is a small, bootstrapped SaaS startup with three great products. Our goal is to create a better online experience for consumers by helping the brands they trust track the behavior of their digital marketing partners. We strive to provide our customers with simple software solutions that make their lives easier. We are in this for the long haul and aim for sustainable growth and satisfied customers.", "\n ", "\n", "\n ", "\nOur company's most valuable asset is our team. To ensure everyone is happy at work and loving what they do, we place an emphasis on work-life balance, trust and empower people to get the job done (and learn while doing it), and celebrate accomplishments through team events and weekly company gatherings. We do our best to make sure our work environment is friendly, fun, open, and inclusive.", "\n ", "\n", "\n ", "\nAt BrandVerity, we know that diversity of all kinds leads to better ideas, a better work environment, and makes us a better company as a whole. As such, we place a high value on diversity and welcome people of any race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. We're an equal opportunity employer.", "\n", "\n", "\n", "\n", "\n    "], "images": [], "type": "full-time"},
{"text": "Software Engineer II - BrandVerity", "date": "2019-08-26 20:07", "compensation": "DOE", "link": "https://seattle.craigslist.org/see/sof/d/seattle-software-engineer-ii-brandverity/6965484075.html", "address": ["\n        ", "\nWe are looking for an experienced software engineer to tackle interesting data storage, access, and presentation problems in the context of a small but stable software business that values solving customer problems, challenging work, and fulfilling lives outside of work. Join our team as we find and root out evil on the Internet every day.\n", "\n ", "\n", "\n ", "\nWe have two big challenges: collecting the right data from the web about brand and product content in context, and filtering that data down to the specific incidences that are of concern to our customers.  We solve brand protection problems in online content in automated and creative ways.", "\n ", "\nThe first piece is a big directed-crawling challenge, as we want to hit the interesting pages without having the resources to crawl the entire web.  This involves interpreting signals to determine whether following a link is likely to be interesting along with a typical spectrum of web crawling concerns.", "\n ", "\nThe second piece is filtering the content we find for the customer.  We use primarily heuristic-based solutions today, but expect to increasingly incorporate machine learning and natural language processing for identification of content in the future. For example, we're using machine learning to predict how customers will categorize issues based on their previous reviews. ", "\n ", "\nIn some cases, we are also detecting intentionally bad behavior, in a cat and mouse game to discover those bad (though intelligent) actors.", "\n ", "\nJoin our team and help to address these challenges while learning cool new technologies!  Grow your career in exploring challenging problem spaces like machine learning, big data and 'simply' writing responsive and elegant software that performs at enormous scale!  Collaborate with like-minded developers who do all of this while working in a fun and dynamic environment!", "\n ", "\n", "\n ", "\nWe work primarily in Python - it's a versatile tool.", "\n", "\nOur web app is built with Django, and we currently leverage JavaScript and jQuery on top of that, as well as some AngularJS.", "\n ", "\nOn the back-end, all of our data collection and filtering requires intelligent data storage, primarily in non-relational data stores within AWS, including DynamoDB, Redis and our column-oriented data store on top of S3. We also use Redshift and Redshift Spectrum (with Parquet/S3). We use MySQL in RDS for core relational data.", "\n ", "\nAll of our heavy lifting is done within AWS, leveraging many AWS services, Chef and EC2 autoscaling groups to . handle changing loads without human intervention.", "\n ", "\nTo learn more about building at BrandVerity, please visit: ", "\n ", "\n", "\n", "\n- Bachelor's degree in computer science or equivalent experience/training", "\n- At least 3 years of software development experience - more is great, too!", "\n- Excellent communication and collaboration skills", "\n- An enthusiasm for learning and solving complex problems", "\n- A desire to invest in yourself and a team over time - we're in it for the long haul", "\n", "\n", "\n", "\n- Health, dental, and vision insurance", "\n- 401k matching", "\n- Unlimited vacation", "\n- Incentive stock options", "\n- Flexible spending account (FSA)", "\n- Orca pass and pre-tax allowance for transit/parking", "\n", "\n", "\n ", "\nWe trust each other to discover problems that need to be solved here and to shape our own roles.  We frequently collaborate to find innovative solutions.  We like to have fun together in addition to tackling complex and challenging problems.", "\n ", "\nWe communicate quite freely with sales, marketing, and account management as the company is small (under 40).  We use a lightweight product development process based on Scrum.  We engineer resilient systems so that we don't have to mess around with them all the time.", "\n ", "\nWe want you to have time to do the things that are important to you outside of work and come to work refreshed and inspired with your best ideas.  To that end, we keep reasonable working hours and have an unlimited vacation policy.  ", "\n ", "\n", "\n ", "\nBrandVerity is a small, bootstrapped SaaS startup with three great products. Our goal is to create a better online experience for consumers by helping the brands they trust track the behavior of their digital marketing partners. We strive to provide our customers with simple software solutions that make their lives easier. We are in this for the long haul and aim for sustainable growth and satisfied customers.", "\n ", "\n", "\n ", "\nOur company's most valuable asset is our team. To ensure everyone is happy at work and loving what they do, we place an emphasis on work-life balance, trust and empower people to get the job done (and learn while doing it), and celebrate accomplishments through team events and weekly company gatherings. We do our best to make sure our work environment is friendly, fun, open, and inclusive.", "\n ", "\n", "\n ", "\nAt BrandVerity, we know that diversity of all kinds leads to better ideas, a better work environment, and makes us a better company as a whole. As such, we place a high value on diversity and welcome people of any race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. We're an equal opportunity employer.", "\n", "\n", "\n", "\n", "    "], "images": [], "type": "full-time"},
{"text": "Senior Front End Software Engineer - BrandVerity", "date": "2019-08-26 20:09", "compensation": "DOE", "link": "https://seattle.craigslist.org/see/sof/d/seattle-senior-front-end-software/6965484722.html", "address": ["\n        ", "\nWe are looking for an experienced front end engineer to join our team and help us tackle complex presentation challenges. Lead us in transforming complicated data and business logic into simple, seamless, and easy to use web applications. Mentor others by leveraging your valuable web application development experience and expertise. Do all of this in the context of a small but stable software business that values solving customer problems, challenging work, and fulfilling lives outside of work. Join our team as we find and root out evil on the Internet every day.", "\n", "\n", "\n ", "\nWe have two big challenges: collecting the right data from the web about brand and product content in context, and presenting that data in a way that’s valuable and actionable to our customers.", "\n", "\nThe first piece is a large-scale directed-crawling challenge. Our engineering team (currently made up of full-stack and backend-focused engineers) are using lots of automated and creative ways to crawl, detect, collect, filter, store and aggregate the data our customers need at an enormous scale. This creates many challenges and opportunities to be able to do this accurately and effectively at scale and with a small footprint.", "\n", "\nThe second piece is in allowing our users to filter, navigate, track changes, view insights, and take action on that data within our online tool. This is where you come in! We’re looking for an experienced frontend engineer to work directly with our UX Designer and Product team to lead the charge in making our user-facing technologies as robust, modern, creative, and intelligent as our backend systems. In addition to working with Product to build responsive and engaging interfaces, we also need a front-end developer who can work very closely with the rest of the Engineering team in identifying and implementing creative front-end solutions to tackle both customer and engineering challenges (especially those concerning scale and performance).", "\n", "\nJoin our team and help to address these challenges while learning cool new technologies! Grow your career in exploring challenging problem spaces like machine learning, big data and ‘simply’ writing responsive and elegant software that performs at enormous scale! Collaborate with like-minded developers who do all of this while working in a fun and dynamic environment!", "\n", "\n", "\n ", "\nWe work primarily in Python - it’s a versatile tool.", "\n", "\nOur web app is built with Django, and we currently leverage JavaScript and jQuery on top of that, as well as some AngularJS.\nOn the back-end, all of our data collection and filtering requires intelligent data storage, primarily in non-relational data stores within AWS, including DynamoDB, Redis, and our column-oriented data store on top of S3. We also use Redshift and Redshift Spectrum (with Parquet/S3). We use MySQL in RDS for core relational data.", "\n", "\nAll of our heavy lifting is done within AWS, leveraging many AWS services, Chef and EC2 autoscaling groups to handle changing loads without human intervention.", "\n", "\nTo learn more about building at BrandVerity, please visit: ", "\n", "\n", "\n", "\n* Bachelor’s degree in computer science or equivalent experience/training", "\n* At least 4 years of web application and front-end software development experience - more is great, too! (Django or Ruby on Rails preferred)", "\n* Deep understanding of the MVC pattern framework", "\n* JavaScript expertise", "\n* Experience with Angular/React, jQuery, ECMAScript, HTML5, CSS3 and cross browser design and implementation", "\n* Experience, passion and point of view with at least a couple of modern JS frameworks", "\n* Experience designing best approaches for solving complex presentation challenges at scale", "\n* Demonstrated passion and experience with developing compelling front end experiences", "\n* Excellent communication, collaboration and mentoring skills", "\n* Experience working in small teams", " \n* Ability to thrive in an environment that values autonomy", "\n* An enthusiasm for learning and solving complex problems", "\n* A desire to invest in yourself and a team over time - we’re in it for the long haul", "\n", "\n", "\n", "\n* Health, dental, and vision insurance", "\n* 401k matching", "\n* Unlimited vacation", "\n* Incentive stock options", "\n* Flexible spending account (FSA)", "\n* Orca pass and pre-tax allowance for transit/parking", "\n", "\n", "\n ", "\nWe trust each other to discover problems that need to be solved here and to shape our own roles.  We frequently collaborate to find innovative solutions.  We like to have fun together in addition to tackling complex and challenging problems.", "\n ", "\nWe communicate quite freely with sales, marketing, and account management as the company is small (under 40).  We use a lightweight product development process based on Scrum.  We engineer resilient systems so that we don't have to mess around with them all the time.", "\n ", "\nWe want you to have time to do the things that are important to you outside of work and come to work refreshed and inspired with your best ideas.  To that end, we keep reasonable working hours and have an unlimited vacation policy.  ", "\n ", "\n", "\n ", "\nBrandVerity is a small, bootstrapped SaaS startup with three great products. Our goal is to create a better online experience for consumers by helping the brands they trust track the behavior of their digital marketing partners. We strive to provide our customers with simple software solutions that make their lives easier. We are in this for the long haul and aim for sustainable growth and satisfied customers.", "\n ", "\n", "\n ", "\nOur company's most valuable asset is our team. To ensure everyone is happy at work and loving what they do, we place an emphasis on work-life balance, trust and empower people to get the job done (and learn while doing it), and celebrate accomplishments through team events and weekly company gatherings. We do our best to make sure our work environment is friendly, fun, open, and inclusive.", "\n ", "\n", "\n ", "\nAt BrandVerity, we know that diversity of all kinds leads to better ideas, a better work environment, and makes us a better company as a whole. As such, we place a high value on diversity and welcome people of any race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. We're an equal opportunity employer.", "\n", "\n", "\n", "\n", "    "], "images": [], "type": "full-time"},
{"text": "Cloud Software Engineer", "date": "2019-08-27 12:08", "compensation": "DOE", "link": "https://seattle.craigslist.org/est/sof/d/bellevue-cloud-software-engineer/6965919793.html", "address": ["\n        ", "\nAffirma, a young, fast paced, award winning tech company ranked one of the \"Top 5 Best Mid-Size Companies to Work For\" by the Seattle Business magazine, is looking for a cloud data centric Software Engineer with a passion for people and coding to join our internal Custom Development team. ", "\n", "\nThis is a great opportunity to join a growing organization that focuses on creating cutting edge, inhouse technical solutions for large to enterprise level clients. In this role you will engage with stakeholders and global team members to flush out project needs, drive development and ensure client satisfaction.", "\n", "\nApplication Technologies:", "\n·        Experience working with .NET technologies: C#, ASP.NET, and MVC", "\n·        SQL experience: querying, table design, DB administration, stored procedures, etc.", "\n·        Experience with Azure and Azure data technologies", "\n·        Data architecture and data warehousing experience", "\n·        Comfortable building reports and data visualizations", "\n·        Comfortable engaging with high-level stakeholders both internal and external to Affirma ", "\n·        Proven experience working the full development life cycle including discovery, implementation, and delivery (on time and on budget)", "\n·        Experience and willingness to work with offshore and remote based teams throughout the US ", "\n·        BS Degree in Computer Science or equivalent", "\n", "\nWhy Affirma?", "\n·        One of Washington's Fastest Growing Private Companies & Top 100 Best Companies to Work For (According to Seattle Business Magazine and Puget Sound Business Journal)", "\n·        Casual environment, surrounded by incredibly intelligent and motivated co-workers, and a performance-driven culture", "\n·        Flexible Schedule", "\n·        Opportunity for growth", "\n·        Great location, great people, exciting projects, and tons of fun.", "\n", "\nAffirma is an award-winning consultancy specializing in Mobile, Cloud, Business Intelligence, SharePoint, Technology Infrastructure, Custom Development, Visual Design, and Staffing Services. We focus on delivering true, measurable business value to our clients. We have top industry customer satisfaction and are dedicated to delivering dependable and reliable solutions that exceed client expectations. Affirma's motto is quality solutions on budget, on time, every time.", "\n", "\nInterested in this opportunity?  Head over to ", " and submit your application and resume using the job opening ID #912!    "], "images": [], "type": "full-time"},
{"text": "Senior Sitefinity Software Engineer", "date": "2019-08-27 12:08", "compensation": "DOE", "link": "https://seattle.craigslist.org/est/sof/d/bellevue-senior-sitefinity-software/6965919375.html", "address": ["\n        ", "\nAffirma, a young, fast paced, award winning tech company ranked one of the \"Top 5 Best Mid-Size Companies to Work For\" by the Seattle Business magazine, is looking for a Senior Sitefinity Software Engineer with a passion for people and coding to join our Custom Development team.  If you are not local to one of our current office locations we invite you to apply to join our remote team.", "\n", "\nThis is a great opportunity to join a growing organization that focuses on creating cutting edge, inhouse technical solutions for large to enterprise level clients. In this role you will engage with stakeholders and global team members to flush out project needs, drive development and ensure client satisfaction.", "\n", "\nResponsibilities and Skills:", "\n·        Experience working with .Net technologies: C#, ASP.NET, and MVC", "\n·        Website development ", "\n·        Knowledgeable in JavaScript and/or AngularJS, ReactJS, jQuery ", "\n·        Previous experience creating new Sitefinity widgets and modules", "\n·        Proven experience working the full development life cycle including discovery, implementation, and delivery (on time and on budget)", "\n·        Ability to plan and execute website implementation on Sitefinity", "\n·        Experience working with other CMS systems such as Sitecore or Kentico", "\n·        Previous experience working with e-commerce technologies such as Magento of BigCommerce", "\n·        BS Degree in Computer Science or equivalent", "\n", "\nLocation:", "\n·        Open to both local and remote based candidates", "\n", "\nWhy Affirma?", "\n·        One of Washington's Fastest Growing Private Companies & Top 100 Best Companies to Work For (According to Seattle Business Magazine and Puget Sound Business Journal)", "\n·        Casual environment, surrounded by incredibly intelligent and motivated co-workers, and a performance-driven culture", "\n·        Flexible Schedule", "\n·        Opportunity for growth", "\n·        Great location, great people, exciting projects, and tons of fun.", "\n", "\nAffirma is an award-winning consultancy specializing in Mobile, Cloud, Business Intelligence, SharePoint, Technology Infrastructure, Custom Development, Visual Design, and Staffing Services. We focus on delivering true, measurable business value to our clients. We have top industry customer satisfaction and are dedicated to delivering dependable and reliable solutions that exceed client expectations. Affirma's motto is quality solutions on budget, on time, every time.  ", "\n", "\nSound like a fit?  We invite you to head to ", " and submit your application using the job opening ID # 899!    "], "images": [], "type": "full-time"}
]