[
{"text": "C++ Software Engineer", "date": "2019-08-09 11:28", "compensation": "based on experience", "link": "https://chicago.craigslist.org/chc/sof/d/chicago-software-engineer/6953008490.html", "address": ["\n        ", "\nWolverine is looking for strong C++ programmers who enjoy working with a cross-discipline team to develop and improve our world-class trading systems. Our ideal candidate will excel at working with technical and business experts to identify and implement new trading strategies, while also being able to investigate, debug and fix mission critical problems as they occur. This is a hands-on position which will involve full development cycles, from requirements collection to final deployment, and includes ongoing support for internal users. Here at Wolverine we create industry-leading systems to implement innovative trading strategies, with equal emphasis on performance, risk-management, and stability. In addition to excitement for this field, we are looking for enthusiasm, versatility, and most importantly, a passion for technology and drive to learn. ", "\n", "\nWhat You’ll Do ", "\n•\tPerform full life cycle development and deployment of C++ applications and libraries for exchange gateways, trading strategy execution, risk management and trade reporting ", "\n•\tDevelop systems to maintain, analyze and improve performance, integrity and reliability of existing applications", "\n•\tInvestigate and fix problems with production systems in real-time", "\n•\tConstruct experiments and analyze data to identify ways to improve technical performance and new trading opportunities, ensuring that results are valid and reproducible", "\n•\tCollaborate with technical and business peers to develop new trading strategies and systems", "\n•\tCommunicate technical knowledge to both technical and non-technical audiences", "\n", "\nSkills You’ll Need ", "\n•\tTop-notch C/C++ coding skills, with a solid foundation in data structures", "\n•\tExcitement for developing and dedication to testing ", "\n•\tExcellent analytical and problem solving skills ", "\n•\tPassion for writing clean high quality code and the ability to provide, and take, code review feedback ", "\n•\tWillingness to collaborate and learn from other team members ", "\n•\tAbility to take ownership over projects and be self-directed on what needs to happen next ", "\n•\tStrong communication skills with both engineers and people without a technical background ", "\n•\tExperience with SQL database, mutli-thread programming, STL & Boost", "\n•\tBachelor’s degree in Computer Science or Computer Engineering, or equivalent. ", "\n", "\nTo Apply", "\nPlease click here ", " or visit the careers section of www.wolve.com ", "\n", "\nVisa sponsorship is not available for this role    "], "images": [], "type": "full-time"},
{"text": "Free Tech Training and Optional Job Placement  - Make 80,000 - 120,000 per year,", "date": "2019-08-19 10:05", "compensation": "70,000 to 100,000", "link": "https://chicago.craigslist.org/chc/web/d/chicago-free-tech-training-and-optional/6959880596.html", "address": ["\n        ", "\n", "    "], "images": [], "type": "contract"},
{"text": "CAD OPERATOR/ENGINEERING TECHNICIAN FOR CIVIL ENGINEERING COMPANY", "date": "2019-08-21 09:46", "compensation": "DOE", "link": "https://chicago.craigslist.org/nwc/egr/d/glencoe-cad-operator-engineering/6961401868.html", "address": ["\n        ", "\nESSENTIAL DUTIES AND FUNCTIONS", "\n•\tDrafting of civil engineering plans and topographical surveys for land development/redevelopment for individual, commercial, residential and municipal projects. ", "\n•\tAbility to work in a dynamic environment and adapt to frequent project changes.", "\n•\tAbility to comprehend complex instructions and interpret diagrams and notes to create or modify electronic drawings.", "\n•\tAccuracy and effectiveness in computer aided drafting (MicroStation)", "\n•\tFollow filing, storage and retrieval methods of both manual and electronic drawings.", "\n•\tCoordinate with engineers and other personnel to incorporate concepts and information into drawing packages.", "\n•\tAbility to work effectively as part of a team or independently with minimal oversight.", "\nQUALIFICATION REQUIREMENTS", "\nTo perform this job successfully, an individual must be able to perform each essential duty satisfactorily. Familiarity with, and understanding of Civil Engineering concepts and terminology is important. Must have working knowledge of Bentley products, MicroStation, Geopak, Open Roads, PC application software and drafting/surveying practices and methods. Knowledge of Adobe Acrobat and current version of MicroStation is required. Knowledge of AutoCAD is also helpful. ", "\nEDUCATION AND EXPERIENCE", "\nA high school diploma is required. Post-secondary and/or technical school education is highly desirable with a minimum of five years of progressively responsible drafting related CAD experience with emphasis on civil disciplines.", "\n    "], "images": [], "type": "full-time"},
{"text": "Sr. Site Reliability Engineer", "date": "2019-08-22 14:17", "compensation": "Salary", "link": "https://chicago.craigslist.org/chc/sof/d/chicago-sr-site-reliability-engineer/6962399404.html", "address": ["\n        ", "\nSr. Site Reliability Engineer (Citadel Securities Americas LLC – Chicago, IL) Develop, deploy and configure software updates, carrying out the software development life cycle including quality assurance and production activities. Monitor the health and performance of production trading system applications. Design and implement automation features to enhance robustness and throughput of trading environment. Build reports and analyses of daily operation of production software, hardware and systems. Develop tools and workflows that enhance visibility of trading system behavior.", "\n", "\nRequires a Bachelor’s degree (or foreign equivalent) in Computer Science, Engineering or a related field and 2 years of experience in the job offered or building and managing large-scale systems and application architectures. All stated experience must include the following: trading systems applications including OMS and FIX engines; administering UNIX/Linux systems in a production environment; networking; scripting languages including Perl, Python, Sybase SQL and Shell Scripting; and, software development, testing methodologies and test tools.", "\nPlease submit resumes by mail to Citadel Securities Americas LLC, Attn: Employee Relations/LE, 131 S. Dearborn St, 32nd Floor, Chicago, IL 60603. Reference JobID: 4491793.    "], "images": [], "type": "full-time"},
{"text": "Sales Engineer (Remote)", "date": "2019-08-02 05:49", "compensation": "Competitive", "link": "https://chicago.craigslist.org/chc/sof/d/chicago-sales-engineer-remote/6947691398.html", "address": ["\n        ", "\n", "Please apply online with HiringThing at: ", "\n    "], "images": [], "type": "full-time"},
{"text": "Free Tech Training and Optional Job Placement  - Make 80,000 - 120,000 per year,", "date": "2019-08-01 17:23", "compensation": "70,000 to 100,000", "link": "https://chicago.craigslist.org/chc/web/d/chicago-free-tech-training-and-optional/6947467458.html", "address": ["\n        ", "\n", "    "], "images": [], "type": "contract"},
{"text": "Free Tech Training and Optional Job Placement  - Make 80,000 - 120,000 per year,", "date": "2019-08-15 09:32", "compensation": "70,000 to 100,000", "link": "https://chicago.craigslist.org/chc/web/d/chicago-free-tech-training-and-optional/6957116127.html", "address": ["\n        ", "\n", "    "], "images": [], "type": "contract"},
{"text": "Free Tech Training and Optional Job Placement  - Make 80,000 - 120,000 per year,", "date": "2019-08-11 08:14", "compensation": "70,000 to 100,000", "link": "https://chicago.craigslist.org/chc/web/d/chicago-free-tech-training-and-optional/6954234729.html", "address": ["\n        ", "\n", "    "], "images": [], "type": "contract"},
{"text": "Senior Software Engineer", "date": "2019-08-01 11:11", "compensation": "Competitive", "link": "https://chicago.craigslist.org/chc/sof/d/chicago-senior-software-engineer/6947148369.html", "address": ["\n        ", "\niProspect, the world’s leading digital performance marketing agency, is looking for a Senior Software Engineer to help expand and improve our technology platform. If you’re interested in joining a team that values learning, teaching, growth, communication, and solving problems for clients and stakeholders; if you’re interested in working with open source tools to design, build, operate, and scale a platform that supports web sites and media operations for major companies; if you’re always looking for ways to improve communication, empower your teammates, and make software easier to understand, monitor, and operate; then we’d love to talk with you.", "\n", "\n", "\nAbout the Team", "\niProspect’s Technology Team runs like an agile startup team even though we’re a 50-person team with Engineering and Product backgrounds. We believe that hiring people from different backgrounds and experiences builds a stronger team. Our culture is one that fosters teaching and learning and as a result, we focus on building and developing talent as a means to build great software and systems. We’re an Open Source shop. We use Ruby, Python, and JavaScript; PostgreSQL, RabbitMQ and Redis; Consul, Ansible, Terraform, and Prometheus. We do use some commercial tools, though, like SQL*Server and Tableau. Our core platforms are built out in a cloud infrastructure in AWS.", "\n", "\n", "\nWe like to be open-minded and pragmatic. We use Agile/Scrum to run our teams, but more importantly, we dedicate a lot of effort to team development—making sure teams have the resources and environment most conducive to their success.  ", "\n", "\n", "\nAbout the Position:", "\nAs a Senior Software Engineer on our Technology Team, you will help us support a major expansion in the breadth and depth of iProspect’s platforms, including the content management system that runs web sites for our clients. We firmly believe in the DevOps mentality and are looking for Engineers who not only want to build software platforms, but also be involved in the activities necessary to efficiently operate them. We believe that the experiences our applications deliver are critical to the success of our client’s marketing initiatives. The position will help us not only dramatically augment the capacity of our technology platform to deliver experiences at an ever-increasing scale, but also to provide our operators with the tooling needed to onboard and manage a stream of new clients and their needs.", "\n", "\n", "\nAs with all of our team members, you’ll be afforded the opportunity to continuously learn, and to practice sharing that expertise with other team members in a variety of structured and informal teaching forums.", "\n", "\n", "\nQualifications:", "\n●     A minimum of four years of experience in software development; demonstrating successful design, build, rollout and ongoing delivery of business-critical consumer-facing applications and data pipelines starting from raw business requirements.", "\n●     Successful experience working in an Agile/Scrum environment.", "\n●     Ability to provide guidance and mentoring to junior team members.", "\n●     Experience with languages like Ruby, Python and JavaScript.", "\n●     Significant professional experience using web application frameworks (Angular, Rails, Sinatra, Django, or Flask are ideal, but others are acceptable also) to build high-traffic websites, applications, and services.", "\n●     Knowledge of pragmatic engineering practices like iterative releases, test-driven development, continuous integration, and the use of version control systems (Git/GitHub is our primary system, but experience with TFS would be helpful too).", "\n●     Non-trivial experience with any SQL-based RDBMS (PostgreSQL and SQL*Server experience is especially useful).", "\n●     Experience with NoSQL data stores (Redis) and asynchronous task processing.", "\n●     Experience with digital marketing or advertising a plus.", "\n●     Microservices architecture experience is a plus.", "\n", "\n", "\nResponsibilities:", "\n●     Building, Delivering, and Operating Our Platforms", "\n●     Working inside the team and across teams and functions to design and build solutions that best meet our users’ needs and will be easy to operate", "\n●     Ensuring our applications are following best practices, leveraging technology and frameworks effectively, and are fitting well into our existing platforms", "\n●     Monitoring our applications and systems and owning responses to incidents", "\n●     Proactively identifying platform health issues and proposing solutions to improve upon them", "\nCommunicating and Leading Inside the Team and Across the Business", "\n●     Communicating with other teams, stakeholders, clients, and vendors on technical matters to facilitate implementation", "\n●     Using structured and effective communication methods to present ideas to the department", "\n", "\nLeading and Coaching on Our Team:", "\n●     Helping coordinate team activities to complete sprint goals", "\n●     Taking on leadership opportunities: teaching, sharing concepts, coaching others, presenting", "\n", "\n", "\nAbout the Company:", "\nAs a performance marketing agency, iProspect helps brands uncover new customers and revenue by delivering relevant experiences and connecting data. We’ve built a proprietary technology platform that delivers experiences at each step of a consumer’s journey and collects a rich stream of data to learn what treatments increase the likelihood of a valuable outcome for our clients. We use distributed systems to solve complex compute problems, develop data architectures to support analysis and uncover insights, and use those insights to deliver optimal consumer experiences at scale. Our platform is a high-volume processing system supporting some of the largest companies in the US in ways their internal teams, agencies and IT consultants simply cannot.", "\n", "\n", "\nPerks:", "\niProspect is a great place to work. We have competitive pay, a matching 401k package, life & disability insurance as well as bonus potential. We focus on education, training and inclusivity on our teams in our day-to-day work, and by encouraging and financially supporting our employees to attend relevant training and conferences. We have a casual environment and strive to maintain a work/life balance, including flexible work scheduling options and parental leave. We moved into a brand-new office space at 515 N. State in Chicago’s River North at the end of May. The Grand and State Red Line stop is right outside the front door and there are lots of great lunch spots within walking distance.", "\n", "\n ", "\n", "\nThe real perk of this job is the ability to contribute to a profitable and growing company that strives to give employees the ability to master their craft, increase their skills and be autonomous in their work. We are a small enough division that you can witness and be rewarded for your contributions but are part of large network that allows us to partner with Fortune 100 companies. We support an individual's contribution to the community at large with multiple philanthropic activities and encourage employees to be part of their larger working collective by attending and supporting prominent conferences.", "\n", "\n", "\nWhat's Next:", "\nConsider your background, what you know, what you want to learn in your career, and how you feel you fit this position. If you think you would be a good fit, we’d love for you to send us your resume. Links to a personal blog and/or GitHub repository that would help represent the quality of your work are also greatly appreciated but not required.    "], "images": [], "type": "full-time"},
{"text": "Field Services Technician, Greater Chicago Area-Bellwether Coffee", "date": "2019-08-27 22:02", "compensation": "Competitive", "link": "https://chicago.craigslist.org/chc/trd/d/chicago-field-services-technician/6966228142.html", "address": ["\n        ", "\nField Services Technician ", "\n", "\nLocation = Greater Chicago Area, IL", "\n", "\n*Please apply at: ", "  Thanks kindly!*", "\n", "\nAbout us", "\n", "\nHeadquartered in Berkeley, CA, Bellwether Coffee is a venture-backed, high-growth tech company working hard - alongside other game-changers to-  positively transform the coffee industry, making it more accessible and sustainable for our planet and our communities. We’re a diverse team of coffee industry veterans, entrepreneurs, engineers, technicians, human-centered designers, and people-focused rule-breakers who have a passion for making the “impossible” a reality. ", "\n", "\nWhat we do", "\n", "\nOur revolutionary electric, ventless, zero-emissions commercial coffee roaster uses clean technology and does not require gas lines or expensive ventilation. It’s the most consistent and controllable roaster available, the lowest carbon footprint commercial roaster ever made, and was designed by coffee people who want a better future for coffee roasting. Our roasting platform allows Bellwether customers to easily and responsibly source green coffee from incredible coffee farms around the world, expertly roast using artisan-crafted roast profiles (or create their own), and share fresh, delicious coffee just the way their customers like it. ", "\n", "\nAbout you", "\n", "\nYou're at your best when on your own, yet you appreciate being part of larger team. You're an integrity-driven person who enjoys solving problems for others. You are technically inclined, and enjoy making mechanical improvements that cause our roasters to work better and more reliably. You have a sense of urgency with everything you do without compromising quality and detail. And, at the end of the day, you take pride in knowing that the work you do makes a huge positive impact for our customers.", "\n", "\nAbout the Role", "\n", "\nAs a Field Service Technician, you'll become part of a team of technicians who service Bellwether Roasters across the nation. In this role you'll travel +/-70% of your time visiting customers from Anchorage, Alaska, to Miami, Florida, and everywhere in between. In other words, you'll spend a great deal of your time flying, making airline arrangements, and working from the road. ", "\n", "\nThis role provides a great deal of on-the-job training.  Since we're building the first-ever zero-emissions roaster, we recognize that everyone who joins our team will add their unique skillset to our talent pool while also learning about the software and hardware that make great coffee.  ", "\n", "\nKey Responsibilities-What Success Looks Like", "\n", "\nAssembling, disassembling, and repairing large commercial coffee roasters in order to upgrade hardware and software components", "\n", "\nReceiving the roaster at the customer location and performing installation according to the procedures outlined in collaboration with the R&D (Research & Development) and engineering teams", "\n", "\nPerforming preventative maintenance on the Roaster for maximum quality assurance", "\n", "\nWorking with our SaaS (Software as a Service) team to report software issues and/or requests on behalf of our customers", "\n", "\nUnderstanding or being willing to learn the basics of coffee roasting and preparation", "\n", "\nWorking directly with engineers on assembly, troubleshooting, and quality metrics to ensure a top of the line product ", "\n", "\nTraining customers on the general operations of the Roaster once installed ensuring they are comfortable with their new equipment before leaving the location", "\n", "\nEffectively and efficiently utilizing online, digital tools for receiving service calls, tracking service appointments and reporting out the details of those calls and visits", "\n", "\nCollaborating with consultants on the design and execution of the program ", "\n", "\nFollowing company procedures for processing work tickets/warranty claims/ordering parts required to complete repairs", "\n", "\nMaking your own travel plans (including airfare, hotel, rental car, mapping, and scheduling) and keeping track of all work-related travel expenses. Filing routine expense reports", "\n", "\nMaintaining and tracking your own parts inventory, and reporting on a monthly basis", "\n", "\nPerforming other duties as assigned by the supervisor", "\n", "\nQualifications", "\n", "\nYou're a fearless tinkerer and troubleshooter. You're great with tools, have a solid understanding of basic machinery, electronics, and WiFi", "\n", "\nYou’re available to join an on-call rotation, covering nights and weekends, to handle emergency service request, and are available to fly on short notice 7 days a week", "\n", "\nYou have a solid understanding of electrical/AC-DC theory ", "\n", "\nYou have a proven track record of working independently with little supervision in a technical role. Examples include service technicians from the following industries: I.T., WiFi (modems/routers), automotive, solar, cable TV, electronics, burglar alarms/CCTV/video security, etc. ", "\n", "\n5+ years of experience working in the service field as a technician diagnosing and repairing commercial products", "\n", "\nExpert-level proficiency with basic hand tools, including soldering irons, hand drills, Dremel tools, and multimeters ", "\n", "\nCreative, in-the-moment problem solving", "\n", "\nGood dexterity, attention to detail and quality as well as excellent work discipline ", "\nStrong customer service, interpersonal and communication skills ", "\nFamiliarity with Microsoft Office and cloud-based equivalents (e.g. Google Docs) ", "\n", "\nFamiliarity with the startup world: We're in the early (but funded) stages. We work hard to meet hard deadlines. ", "\n", "\nA reliable vehicle that can be used to make service calls", "\n", "\nA clean driving record and a current driver’s license", "\n", "\nAuthorized to work in the U.S. without sponsorship", "\n", "\nMust love coffee", "\n", "\nPreference will be given to folks with:", "\n", "\nDegrees in engineering ", "\n", "\nExperience in a technical field or an R&D lab environment", "\n", "\nExperience in the Coast Guard, Navy, Air Force, Army, Marine Corps, or Reserves", "\n", "\nPlease apply at: ", "  Thanks kindly!    "], "images": [], "type": "full-time"},
{"text": "CIVIL Engineers & Surveyors - All Levels", "date": "2019-08-26 03:34", "compensation": "Dependent on experience level; Full time with benefits, healthcare, 401k", "link": "https://chicago.craigslist.org/chc/egr/d/chicago-civil-engineers-surveyors-all/6964765544.html", "address": ["\n        ", "\n", "  ", "\n ", "  ", "  \n  ", "\n\nWe have positions for:  CAD Designer,   Project Engineer, Licensed Engineers,  Project Manager, Land Surveyors   ", " ", "\n\n\nFor CONFIDENTIAL CONSIDERATION: ", "\nEmail your resume to: jobs@trabucogroup.com \n", " ", "\nFor full list of Engineering positions, visit us at: ", "    "], "images": ["https://images.craigslist.org/00q0q_e3jjxRHrFJG_600x450.jpg", "https://images.craigslist.org/00Y0Y_7FbOIsehvH2_600x450.jpg", "https://images.craigslist.org/00s0s_5ULF13MvOda_600x450.jpg", "https://images.craigslist.org/00K0K_2pN2wVLEmq0_600x450.jpg", "https://images.craigslist.org/01111_aj23sDEOWmN_600x450.jpg", "https://images.craigslist.org/00909_4npqDFanL7x_600x450.jpg", "https://images.craigslist.org/00u0u_eWrZMPd73KC_600x450.jpg", "https://images.craigslist.org/01717_5OlyBmkOBuF_600x450.jpg", "https://images.craigslist.org/00y0y_5SjTJpJNoEt_600x450.jpg", "https://images.craigslist.org/00J0J_cDVRVFQ1Jk8_600x450.jpg", "https://images.craigslist.org/00g0g_kU2K4cAi2Xv_600x450.jpg", "https://images.craigslist.org/00C0C_3ouc05ItqRK_600x450.jpg", "https://images.craigslist.org/00808_gI1l6wPbXIx_600x450.jpg", "https://images.craigslist.org/00N0N_iTQ1cFxkZwe_600x450.jpg", "https://images.craigslist.org/00101_3qprXDEeCRQ_600x450.jpg", "https://images.craigslist.org/00f0f_9nPoR1UMVWP_600x450.jpg", "https://images.craigslist.org/00S0S_gg3BrssLVpY_600x450.jpg"], "type": "full-time"},
{"text": "Quantitative Research Engineer", "date": "2019-08-22 15:17", "compensation": "Salary", "link": "https://chicago.craigslist.org/chc/sof/d/chicago-quantitative-research-engineer/6962451446.html", "address": ["\n        ", "\nQuantitative Research Engineer (Citadel Americas LLC – Chicago, IL) Design, develop, test and deploy software solutions for automated trading systems and quantitative research tools. Partner with Quantitative Researchers to create and implement software solutions that leverage sophisticated statistical techniques and technologies. Develop and enhance financial risk models, alpha models, transaction cost models and other numerical algorithms. Conduct research and statistical analyses to evaluate financial markets. Develop and back-test real-time investment and execution algorithms. Develop real-time hedging and portfolio optimization algorithms. Responsible for prototype, back-testing, and technical implementation of quantitative trading strategies. ", "\nRequires a Master’s degree (or foreign equivalent) in Computer Science, Electrical Engineering, Statistics, Mathematics, Computational Finance or a related field and 1 year of experience in the job offered or with software development used in the financial industry. Must also have 1 year of experience in each of the following: Distributed Computing, Natural Language Processing, Machine Learning, Platform Development, Networking, System Design, or Web Development techniques; programming with Python, C++, R or similar; object-oriented analysis and design; statistical modelling including linear regression modelling; and, working with data structures, algorithms and architecture paradigms. Experience may be gained concurrently.", "\nPlease submit resumes by mail to Citadel Americas LLC, Attn: Employee Relations/LE, 131 S. Dearborn St, 32nd Floor, Chicago, IL 60603. Reference JobID: 4164305.", "\n    "], "images": [], "type": "full-time"},
{"text": "Free Tech Training and Optional Job Placement  - Make 80,000 - 120,000 per year,", "date": "2019-08-17 11:08", "compensation": "70,000 to 100,000", "link": "https://chicago.craigslist.org/chc/web/d/chicago-free-tech-training-and-optional/6958642467.html", "address": ["\n        ", "\n", "    "], "images": [], "type": "contract"},
{"text": "Free Tech Job Training and Optional Job Placement  - Make 80,000 - 120,000 per y", "date": "2019-08-26 11:28", "compensation": "80,000 to 100,000", "link": "https://chicago.craigslist.org/chc/web/d/chicago-free-tech-job-training-and/6965003369.html", "address": ["\n        ", "\n", "    "], "images": [], "type": "contract"},
{"text": "DevOps Engineer", "date": "2019-08-27 12:35", "compensation": "Based on experience", "link": "https://chicago.craigslist.org/chc/sad/d/chicago-devops-engineer/6965833086.html", "address": ["\n        ", "\nPosition Title: DevOps Engineer", "\nLocation: Chicago", "\nDepartment: Information Technology", "\n ", "\nPosition Summary", "\nSeeking a smart and driven individual to work closely with our software and hardware development teams to manage and improve our core trading systems and processes. This individual will be will be responsible for monitoring the real-time operation of our systems, responding to outages, developing tools to manage an ever-increasing range of systems, and working closely with software and hardware engineers to identify issues and build better systems.", "\n ", "\nResponsibilities", "\n• Use existing monitoring tools to monitor systems for problems and performance, and to have primary responsibility to answer questions and handle outages.", "\n• Work with developers to deploy new servers and applications, reconfigure existing systems, and track changes made to the system.", "\n• Work with the IT group to procure, test, and configure production and test hardware, track changes, and plan for future system needs.", "\n• Work to automate existing procedures and work with developers to analyze and improve systems to address support problems and increase system transparency.", "\n• Help test systems where needed.", "\n ", "\nQualifications", "\n• Experience working in the trading industry, including a working knowledge of exchange protocols and order lifecycles.", "\n• TCP knowledge, use of Wireshark and TCPdump.", "\n• Proficiency in Linux systems administration and knowledgeable of current best practices in areas such as monitoring and deployment.", "\n• Fluent with scripting languages, minimally bash shell and python.", "\n• Proficiency with SQL, and able to analyze data from multiple sources to identify issues or highlight trends in system performance.", "\n• Knowledgeable about networking at the Linux OS level.", "\n• Able to work collaboratively with others across a variety of projects.", "\n• Work effectively in time-sensitive situations, and prioritize issues on the fly by importance.", "\n• A strong desire to continue learning about all areas of the system – hardware, software and business logic.", "\n• A willingness to improve our systems and raise our standards to the best in the industry.", "\n ", "\nAbout Wolverine", "\nFounded in 1994, the Wolverine companies comprise a number of diversified financial institutions specializing in proprietary trading, asset management, order execution services, and technology solutions. We are recognized as a market leader in derivatives valuation, trading, and value-added order execution across global equity, options, and futures markets. With a focus on innovation, achievement, and integrity, we take pride in serving the interests of both our clients and colleagues. The Wolverine companies are headquartered in Chicago with offices in New York and San Francisco and a proprietary trading affiliate office located in London.", "\n ", "\nSponsorship is not available for this position.", "\n", "\nPlease apply directly: ", "\n    "], "images": [], "type": "full-time"},
{"text": "DevOps Engineer", "date": "2019-08-27 12:31", "compensation": "Based on experience", "link": "https://chicago.craigslist.org/chc/sof/d/chicago-devops-engineer/6965829174.html", "address": ["\n        ", "\nPosition Title: DevOps Engineer", "\nLocation: Chicago", "\nDepartment: Information Technology", "\n ", "\nPosition Summary", "\nSeeking a smart and driven individual to work closely with our software and hardware development teams to manage and improve our core trading systems and processes. This individual will be will be responsible for monitoring the real-time operation of our systems, responding to outages, developing tools to manage an ever-increasing range of systems, and working closely with software and hardware engineers to identify issues and build better systems.", "\n ", "\nResponsibilities", "\n• Use existing monitoring tools to monitor systems for problems and performance, and to have primary responsibility to answer questions and handle outages.", "\n• Work with developers to deploy new servers and applications, reconfigure existing systems, and track changes made to the system.", "\n• Work with the IT group to procure, test, and configure production and test hardware, track changes, and plan for future system needs.", "\n• Work to automate existing procedures and work with developers to analyze and improve systems to address support problems and increase system transparency.", "\n• Help test systems where needed.", "\n ", "\nQualifications", "\n• Experience working in the trading industry, including a working knowledge of exchange protocols and order lifecycles.", "\n• TCP knowledge, use of Wireshark and TCPdump.", "\n• Proficiency in Linux systems administration and knowledgeable of current best practices in areas such as monitoring and deployment.", "\n• Fluent with scripting languages, minimally bash shell and python.", "\n• Proficiency with SQL, and able to analyze data from multiple sources to identify issues or highlight trends in system performance.", "\n• Knowledgeable about networking at the Linux OS level.", "\n• Able to work collaboratively with others across a variety of projects.", "\n• Work effectively in time-sensitive situations, and prioritize issues on the fly by importance.", "\n• A strong desire to continue learning about all areas of the system – hardware, software and business logic.", "\n• A willingness to improve our systems and raise our standards to the best in the industry.", "\n ", "\nAbout Wolverine", "\nFounded in 1994, the Wolverine companies comprise a number of diversified financial institutions specializing in proprietary trading, asset management, order execution services, and technology solutions. We are recognized as a market leader in derivatives valuation, trading, and value-added order execution across global equity, options, and futures markets. With a focus on innovation, achievement, and integrity, we take pride in serving the interests of both our clients and colleagues. The Wolverine companies are headquartered in Chicago with offices in New York and San Francisco and a proprietary trading affiliate office located in London.", "\n ", "\nSponsorship is not available for this position.", "\n", "\nPlease apply directly: ", "\n    "], "images": [], "type": "full-time"}
]