[
{"text": "Product Engineer - Repair and Development", "date": "2019-08-19 20:10", "compensation": "Up to US$0.00 per year", "link": "https://newyork.craigslist.org/lgi/egr/d/smithtown-product-engineer-repair-and/6960362300.html", "address": ["\n        ", "\n\n        ", "\n    "], "images": [], "type": null},
{"text": "CIVIL ENGINEERS & Surveyors - All Levels", "date": "2019-08-14 03:01", "compensation": "Dependent on experience level; Full time with benefits, healthcare, 401k", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-city-civil-engineers-surveyors/6956265334.html", "address": ["\n        ", "\n", "  ", "\n ", "  ", "  \n  ", "\n\nWe have positions for: Civil CAD Designer, Civil Project Engineer, Licensed Civil Engineer, Civil Project Manager, Structural Engineer and Land Surveyor  ", " ", "\n\nPositions open for types of project disciplines: Land Development / Site Development, Transportation Engineering, Water Resources, Structural Engineering and Land Surveying  ", " ", "\n\nFor CONFIDENTIAL CONSIDERATION: ", "\nEmail your resume to: jobs@trabucogroup.com \n", " ", "\nFor full list of Engineering positions, visit us at: ", "\n\n", "\n\n KEYWORDS: civil engineering, site development, land development, grading, drainage, storwmwater, SWPPP, paving, striping, traffic control, transportation, signal, signage, railway, highway design, roadway, water, wastewater, hydrology, hydraulics, earthwork, utility design, water resources, wastewater, Autocad, Civil 3D,  REVIT, StaadPro, Microstation, inroads, ArcGIS, surveying, topos, geotechnical, geotech, GIS, structural, ASCE, EIT, PE, TE, survey, surveying, topos, boundaries, ALTA maps, legal description and plats, Appraisal Maps, Records of Survey, topography, photogrammetry, boundary surveys, construction staking, topcon, leica, carlson subdivision mapping, total station, PLS, RPLS, LSIT, SIT\n    "], "images": ["https://images.craigslist.org/00q0q_e3jjxRHrFJG_600x450.jpg", "https://images.craigslist.org/00S0S_gg3BrssLVpY_600x450.jpg", "https://images.craigslist.org/00Y0Y_7FbOIsehvH2_600x450.jpg", "https://images.craigslist.org/00V0V_1XwzjcyU0FQ_600x450.jpg", "https://images.craigslist.org/01111_aj23sDEOWmN_600x450.jpg", "https://images.craigslist.org/00K0K_2pN2wVLEmq0_600x450.jpg", "https://images.craigslist.org/00Y0Y_cEpigprK6xc_600x450.jpg", "https://images.craigslist.org/00t0t_51D2oDR2mzC_600x450.jpg", "https://images.craigslist.org/00a0a_drf409kow45_600x450.jpg", "https://images.craigslist.org/00A0A_k6oLYjPcwd5_600x450.jpg", "https://images.craigslist.org/00808_gI1l6wPbXIx_600x450.jpg", "https://images.craigslist.org/00G0G_jdOW9YQ43na_600x450.jpg", "https://images.craigslist.org/00Q0Q_kWW1LPZt9Rt_600x450.jpg", "https://images.craigslist.org/00s0s_5ULF13MvOda_600x450.jpg", "https://images.craigslist.org/00s0s_4QP14z6XpvA_600x450.jpg", "https://images.craigslist.org/00d0d_WSUtQ2ZUsO_600x450.jpg", "https://images.craigslist.org/00u0u_eWrZMPd73KC_600x450.jpg"], "type": "full-time"},
{"text": "Free Tech Training and Optional Job Placement  - Make 80,000 - 120,000 per year,", "date": "2019-08-19 11:10", "compensation": "70,000 to 100,000", "link": "https://newyork.craigslist.org/brk/web/d/brooklyn-free-tech-training-and/6959886173.html", "address": ["\n        ", "\n", "    "], "images": [], "type": "contract"},
{"text": "Healthcare startup seeks entry level java developer", "date": "2019-08-20 11:08", "compensation": "competitive", "link": "https://newyork.craigslist.org/mnh/sof/d/new-york-healthcare-startup-seeks-entry/6960662416.html", "address": ["\n        ", "\nArchway  Health’s mission is to fix healthcare through payment reform. Archway is a leader in developing and implementing value-based  care programs in partnership with providers, employers and payers across  the country. We do this through a mix of great people who are  passionate about improving healthcare, sophisticated data analytics  tools that drive our unique insights, and easy to use software designed  to help patients get better as quickly and safely as possible. We work  with specialty providers in all types of clinical areas – oncology,  orthopedics, cardiology, pulmonology, obstetrics, hospital care, and  post-acute care – all of whom are experiencing real success with  improving outcomes and the patient experience while also dramatically reducing healthcare costs.", "\n", "\nArchway Health is looking for a New York City based Software Engineer to help us build our analytics products and care management solutions.  In this role, you will  leverage your strong software development and engineering skills to develop applications that help our clients improve the quality and lower the costs of healthcare.  You should have software development and agile project execution experience; be analytical and an excellent communicator. ", "\n", "\n\u2028Qualifications:", "\n", "\nProven 2+ years’ experience as a software engineer.  Recent college grads with internship experience will also be considered.", "\n", "\nExperience  with SQL queries and optimization techniques for at least one DBMS  platform (e.g. MySQL, Microsoft SQL Server, Oracle etc.)\u2028", "\nProven abilities to take initiative and be innovative\u2028", "\nAnalytical mind with a problem-solving aptitude\u2028", "\nBSc/BA in Computer Science or Computer Engineering required\u2028", "\nPassion for improving the healthcare system and working for an entrepreneurial startup", "\nMust be able to analyze / synthesize data  and communicate issues, findings, processes, solutions and ideas in a  clear, concise, technically-proficient and consultative manner.", "\n", "\n\u2028\u2028Benefits:", "\nArchway Health offers an open, collaborative work environments in New York City and Boston We have regular team events, training programs  and generous benefits that include medical, dental, vision coverage, a  401(k) with match and a generous vacation policy", "\n", "\nTo Apply:", "\nShare with us why you like the idea of working with us.", "\nPlease send a resume.", "\n", "\n    "], "images": [], "type": "full-time"},
{"text": "Career Opportunities in IT for Immigrant Professionals", "date": "2019-07-31 13:14", "compensation": "Free Trainings with Job Placement Services", "link": "https://newyork.craigslist.org/mnh/sof/d/new-york-city-career-opportunities-in/6946472833.html", "address": ["\n        ", "\nCareer Opportunity in IT, Technology for Immigrant Professionals: The Cooper Union Retraining Program for Immigrant Engineers @ CAMBA  assists immigrant Engineers and IT Professionals who are underemployed or unemployed gain access to higher paying jobs through training and job placement assistance. The program includes courses in information technology and mechanical, electrical and civil engineering taught by Cooper Union faculty and field experts.  All services are free and admission is competitive. ", "\nClasses Available:", "\nInformation Technology: ", "\n- Cyber Security", "\n- Data Architecture Principles, Data Structure and SQL", "\n- Java Programming", "\n- Microsoft .NET and C#", "\n- Software Quality Assurance—Manual Testing", "\n- Software Quality Assurance—Automated Testing", "\n- Linux (UNIX) Administration", "\n- Android Software Development", "\n", "\n", "\nEngineering: ", "\n- OSHA 30 for Construction ", "\n- Heating, Ventilation, Air-Condition & Refrigeration", "\n- Building Operation, Maintenance & Safety Regulations", "\n- National Electrical Code (NEC) & its applications", "\n- Bridge, Highway, Tunnels and Buildings: Professional Practice for Cost Estimating", "\n- Green Building Guidelines & Environmental Safety", "\n- AISC Structural Steel Design ", "\n- ACI Structural Concrete Design", "\n- AutoCAD and Revit", "\n", "\nEligibility Requirements:", "\n- Be born outside of the United States and be authorized to work in the United States", "\n- Have a bachelor's degree or higher and professional experience in the field of engineering, information technology, or a related field from the country of origin (not from U.S)", "\n- Have lived in the U.S. less than five full years", "\n- Be unemployed, underemployed, or working in a field not related to your education", "\n- Have intermediate+ English fluency", "\n- Demonstrate a financial need", "\n- Be highly motivated to pursue professional job search", "\n", "\nYou can learn more about us and apply here:  www.cooper.edu/immigrant-retraining. ", "\n", "\n    "], "images": [], "type": "full-time"},
{"text": "INTERMEDIATE PROJECT ARCHITECT", "date": "2019-08-01 11:22", "compensation": "Salary plus healthcare benefits", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-city-intermediate-project/6947104354.html", "address": ["\n        ", "\nFor 27 years, Joseph Vance Architects has been designing high end, custom residential projects - brownstone/townhouse gut renovations, lofts, rooftop additions and conversions of manufacturing buildings to residential. We are a small group of creative problem solvers with a taste for well-crafted design. We value hard work to continuously grow and evolve, pushing boundaries until a project is the best it can be.", "\n", "\nCurrent projects include a ground up new 6 story townhouse in the Upper West Side (with a new basketball court beneath), a gut renovation of a townhouse in Chelsea including a totally new facade, a 6,000sf triplex in a new West Village development, and others.", "\n", "\nWe are currently seeking an Intermediate Project Architect to join our ranks.", "\n", "\nAs a member of our team, you will manage your own projects under the direction of the principal, and with the support of the office as needed to help meet deadlines. The format of our firm is such that everyone is expected to run his/her own jobs - generating designs, presentations and drawings, researching codes, managing schedules, and coordinating with clients, contractors, expeditors, city agencies, vendors, consultants, etc. throughout the entire process of the project from initial client meetings to punch-list closeout. The nature of our business requires immense organization, efficiency, and commitment, but we also maintain a very stable work/life balance.", "\n", "\nIdeally you have experience in residential architecture in NYC, some knowledge of NYC DOB and LPC, have worked with 3D modeling/BIM software and the adobe creative suite. We also expect you to have a great design sensibility and critical thinking skills, along with 4-8 years of professional experience.", "\n", "\nIf this sounds like you, then please submit a pdf of your cover letter, resume, and work sample. This is a full time salaried position with medical coverage (no part-time or freelance work). We look forward to hearing from you and appreciate your interest in our firm!", "\n", "\nThis is a full time salaried position with benefits (no part-time or freelance positions). Qualified candidates are currently living in the tri-state area and should submit a resume, work samples and salary requirements via .pdf.", "\n    "], "images": ["https://images.craigslist.org/00j0j_ctv8IY2B9M9_600x450.jpg", "https://images.craigslist.org/00707_2ohiyJZd4NU_600x450.jpg", "https://images.craigslist.org/00R0R_3x7GTRi5u4s_600x450.jpg", "https://images.craigslist.org/00g0g_5muTB0fTtyo_600x450.jpg", "https://images.craigslist.org/00505_b1sgX3jtE3k_600x450.jpg"], "type": "full-time"},
{"text": "Free Tech Training and Optional Job Placement  - Make 80,000 - 120,000 per year,", "date": "2019-08-11 09:18", "compensation": "70,000 to 100,000", "link": "https://newyork.craigslist.org/brx/web/d/bronx-free-tech-training-and-optional/6954236592.html", "address": ["\n        ", "\n", "    "], "images": [], "type": "contract"},
{"text": "Free Tech Training and Optional Job Placement  - Make 80,000 - 120,000 per year,", "date": "2019-08-01 18:25", "compensation": "70,000 to 100,000", "link": "https://newyork.craigslist.org/brk/web/d/brooklyn-free-tech-training-and/6947469193.html", "address": ["\n        ", "\n", "    "], "images": [], "type": "contract"},
{"text": "5 Axis CNC Programmer", "date": "2019-07-31 21:00", "compensation": "$40+ per hour based on experience", "link": "https://newyork.craigslist.org/jsy/mnu/d/denver-5-axis-cnc-programmer/6946832021.html", "address": ["\n        ", "\nPrimus Aerospace, founded in 1989, an AS9100/ISO9001 certified employer located in Lakewood, Colorado (Denver West) is a rapidly growing company with significant opportunities for advancement.  Primus Aerospace specializes in high-complexity machining, assembly and integration services for the Aerospace, Defense and Space industries.  We support the majority of prime defense contractors and commercial aerospace companies across the industry.  We are seeking long-term employees who desire to advance their career, further develop their skills and support multi-year contracts with our customer base.  ", "\n", "\nWe have grown by 22% last year and are continuing to grow. We currently have an exciting opportunity for a 5 Axis CNC Programmer. The CNC (5-7-9 Axis) Programmer programs components and tools from customer provided materials or drawings. The Programmer is responsible for creation and revision of CNC programs for various multi-axis, horizontal and vertical machines, mills, lathes and other equipment. The Programmer supports current production and prototype projects while maintaining quality and safety standards. As a member of the Engineering team, the CNC Programmer will work with process engineers, operations, quality and procurement as well as customers and vendors to develop the most efficient manufacturing process possible.", "\n", "\nRequirements", "\n• Write programs on three, four and five axis machines in the language of the machine’s controller and save programs on company systems", "\n• Analyze job orders, drawing, blueprints and specifications and design data to calculate dimensions, tool selections, machine speeds and feed rates", "\n• Determine the sequence of machine operations and select the proper cutting tools needed to machine workpieces, develops proves development", "\n• Write instruction sheets/routers for a machine’s controller to guide setup ", "\n• Develop setup work instructions and trains operators", "\n• Revise programs to eliminate errors and retest programs to check that problems have been solved", "\n• Utilize computer aided manufacturing (CAM) software to produce or develop programs ", "\n• Check completed programs by running simulations or tests", "\n• Consult with engineering personnel in preparing and finalizing programs", "\n• Simplify tooling time for workers to increase productivity and run times", "\n• Monitor all programs to ensure they follow blueprint instructions and safety policies", "\n• Follow established processes and quality and safety standards", "\n• Participate in LEAN manufacturing activities", "\n• Perform preventative maintenance or minor repairs on machines", "\n• Maintain knowledge of industry processes and tool information", "\n", "\nKnowledge/Skills/Abilities", "\n• At least fixe (5) years’ experience programming complex parts for both vertical and horizonal machining centers utilizing 4th and 5th axis machining ", "\n• Fluent in one or more of the following: MasterCam X9/X10, CATIA, Part Maker, Vericut/OptiPath and Solid Works ", "\n• Thorough knowledge and understanding of Geometric Dimensioning and Tolerancing (GD&T)", "\n• Previous experience working with Haas machines lathes and mills , Mazak Horizontals , Dmu 5 axis machines etc. is a plus ", "\n• Ability to setup and run jobs", "\n• Strong acumen of process development ", "\n• Ability to design fixturing", "\n• Knowledge of raw materials, production processes, quality control, costs, and other techniques for maximizing the effective manufacture and distribution of goods", "\n• Basic to intermediate shop math", "\n• Ability to use reasoning to identify the strengths and weaknesses of alternative solutions, conclusions or approaches to problems and implement solutions", "\n• Exceptional problem-solving, organizational and analytical skills", "\n• Solid customer service skills. Ability to communicate complex ideas in an easy to understand fashion", "\n• Lean manufacturing and continuous improvement background", "\n• Ability to work independently yet collaboratively in a team environment ", "\n• Excellent oral and written communication skills with the ability to communicate with all levels of management and team members", "\n• Proficient in Microsoft office suite ", "\n• AS9100 and ISO9001 work experience a plus", "\n• Ability to stand for long periods of time if needed", "\n• Ability to follow PRIMUS core values", "\n", "\nEducation", "\n• Bachelor’s degree in mechanical or manufacturing engineering, or machine tool technology or related field or programming certification with at least 7 years’ experience programming", "\n", "\nTo perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed above are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.", "\n", "\nTo apply click this link: ", " or email your resume to employment@primusaero.com", "\n", "\nWe offer the following to all employees:", "\n• On-the-job training education assistance", "\n• Medical, dental and vision insurance ", "\n• Basic Life/AD&D insurance paid by the company", "\n• Short-term and long-term disability plans", "\n• Company paid Employee Assistance Program (EAP)", "\n• Paid vacation ", "\n• Nine (9) paid holidays per year", "\n• 401K with company match", "\n• Advancement opportunities", "\n• Positive work environment and great west side location", "\n", "\nPrimus Aerospace is an Equal Opportunity Employer (EOE) employer and does not discriminate on the basis of race, color, national origin, religion, gender, age, veteran status, political affiliation, sexual orientation, marital status or disability (in compliance with the Americans with Disabilities Act) with respect to employment opportunities.", "\n    "], "images": [], "type": "full-time"},
{"text": "INTERMEDIATE PROJECT ARCHITECT", "date": "2019-08-09 10:20", "compensation": "Salary plus healthcare benefits", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-city-intermediate-project/6952891884.html", "address": ["\n        ", "\nFor 27 years, Joseph Vance Architects has been designing high end, custom residential projects - brownstone/townhouse gut renovations, lofts, rooftop additions and conversions of manufacturing buildings to residential. We are a small group of creative problem solvers with a taste for well-crafted design. We value hard work to continuously grow and evolve, pushing boundaries until a project is the best it can be.", "\n", "\nCurrent projects include a ground up new 6 story townhouse in the Upper West Side (with a new basketball court beneath), a gut renovation of a townhouse in Chelsea including a totally new facade, a 6,000sf triplex in a new West Village development, and others.", "\n", "\nWe are currently seeking an Intermediate Project Architect to join our ranks.", "\n", "\nAs a member of our team, you will manage your own projects under the direction of the principal, and with the support of the office as needed to help meet deadlines. The format of our firm is such that everyone is expected to run his/her own jobs - generating designs, presentations and drawings, researching codes, managing schedules, and coordinating with clients, contractors, expeditors, city agencies, vendors, consultants, etc. throughout the entire process of the project from initial client meetings to punch-list closeout. The nature of our business requires immense organization, efficiency, and commitment, but we also maintain a very stable work/life balance.", "\n", "\nIdeally you have experience in residential architecture in NYC, some knowledge of NYC DOB and LPC, have worked with 3D modeling/BIM software and the adobe creative suite. We also expect you to have a great design sensibility and critical thinking skills, along with 4-8 years of professional experience.", "\n", "\nIf this sounds like you, then please submit a pdf of your cover letter, resume, and work sample. This is a full time salaried position with medical coverage (no part-time or freelance work). We look forward to hearing from you and appreciate your interest in our firm!", "\n", "\nThis is a full time salaried position with benefits (no part-time or freelance positions). Qualified candidates are currently living in the tri-state area and should submit a resume, work samples and salary requirements via .pdf.", "\n    "], "images": ["https://images.craigslist.org/00j0j_ctv8IY2B9M9_600x450.jpg", "https://images.craigslist.org/00707_2ohiyJZd4NU_600x450.jpg", "https://images.craigslist.org/00R0R_3x7GTRi5u4s_600x450.jpg", "https://images.craigslist.org/00g0g_5muTB0fTtyo_600x450.jpg", "https://images.craigslist.org/00505_b1sgX3jtE3k_600x450.jpg"], "type": "full-time"},
{"text": "Software Engineer", "date": "2019-08-05 08:49", "compensation": "Competitive Salary based on experience", "link": "https://newyork.craigslist.org/wch/sof/d/bronxville-software-engineer/6949804981.html", "address": ["\n        ", "\nSoftware Engineer", "\n ", "\nA growing technology firm in lower Westchester looking to add a Software Developer who can help out with programming, writing and/or editing technical specifications, contributing and reviewing code, and helping manage  off-shore development.   The company has been in business for over twenty years and is a leader in its field.  We are expanding our cloud based SaaS offering and need developers who are interested in working with Azure’s Machine Learning Studio and/or developing an Android/iOS app using Xamarin that interfaces to a cloud based service.   We also have projects in Machine Vision, Facial recognition and OCR.", "\n", "\nOffice is located about 1 block from Bronxville Metro North station.  We can offer flexible working conditions but initially expect you to be in the office to learn about the company, its products and people.  Please click on link below to take a short screening test, complete application and upload your resume.", "\n", "\nPosition Responsibilities will include:", "\nDevelop C# applications for Window and Xamarin Application for Android/iOS", "\nWrite and/or edit Technical Specification used to guide offshore development.", "\nHelp manage offshore developers including contribute to and review offshore coding.", "\nContribute to software architecture, and API.", "\nFront-end application development on iOS and Android platforms.", "\nBasic troubleshooting/support of our software on our customer’s computer and of our products both in-house and via remote software sessions.", "\n", "\nIdeal Candidate Qualifications: ", "\nSelf Learner - Ability and interest in learning new skills and technology  ", "\nBachelor's degree in Computer Science, or related field and/or 5+ years of experience in software development.", "\nGood problem solving, customer service and communication skills ", "\nCandidates will need to pass a background check", "\nApplication development (iOS and Android)", "\nMicrosoft Visual Studio C# and Xamarin for mobile development", "\nExperience in database technologies such as SQL or similar query language. ", "\nKnowledge of server configuration and database architecture especially Azure", "\nFamiliar with mobile architecture, solutions and frameworks.", "\nRequires strong organizational and time management skills, close attention to detail and be able to effectively handle multiple priorities.", "\nMust be collaborative and able to work in a team based environment.", "\nMust have excellent verbal and written communications skills and be able to communicate effectively. Must be an effective listener, able to maintain focus extract necessary information and validate understanding of the information.", "\n", "\n", "\nCompetitive salary depending on qualifications.  Package includes Health/Dental Insurance, 401K and profit-sharing plans", "\n", "\nPlease click on this link to complete an application, 15 minute screening test and upload resume and salary requirements.   Applicants must finish 15 test to upload resume and please include salary requirements.", "\n", "\n", "\n", "\nApplicants are advised to take screening test by themselves as they will be given similar tests during in person interview.   Again - Respondents must use the provided link to apply for this position.", "\n", "\n", "\n    "], "images": [], "type": "full-time"},
{"text": "Mid-Level Architect: 8 to 10 Years of Experience", "date": "2019-08-26 16:46", "compensation": "Competitive", "link": "https://newyork.craigslist.org/que/egr/d/astoria-mid-level-architect-8-to-10/6965250255.html", "address": ["\n        ", "\nSeeking Mid-Level Architect with 8+ years of experience in all phases of design including Schematic Design, Design Development, Construction Documents and a strong background in Construction Administration. The candidate should have the following:", "\n", "\n•\tMust have strong background in Construction Administration", "\n•\tAbility to independently review submittals, respond to RFIs, and issue bulletins", "\n•\tLicensure in New York State is preferred", "\n•\tBachelor’s or Master’s degree in Architecture", "\n•\tProficiency in AutoCAD 2014 or later with BIM experience a plus", "\n•\tAbility to coordinate the work of a multi-disciplinary team", "\n•\tSelf-motivation and the ability to work independently", "\n•\tExperience with Microsoft Office (Word, Excel, PowerPoint) and other graphic / design software including the Adobe Design Suite", "\n", "\nPreferred project experience includes K-12 schools, higher-education projects, and design of large-scale public projects (transit stations, convention centers, and similar).", "\n", "\nExperience and interest in sustainable design/documentation and LEED is strongly encouraged, with applicable accreditations preferred.", "\n", "\nFor application requirements and submission instructions, see the link below:", "\n", "\n", "\n", "\ndi Domenico + Partners, LLP is an equal opportunity employer. The firm offers a full benefits package including health insurance, dental and vision insurance, and 401(k) retirement plan.", "\n    "], "images": [], "type": "full-time"},
{"text": "Career Opportunities in Engineering for Immigrant Professionals", "date": "2019-07-31 13:15", "compensation": "Free Trainings with Job Placement Assistant", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-city-career-opportunities-in/6946473667.html", "address": ["\n        ", "\nThe Cooper Union Retraining Program for Immigrant Engineers at CAMBA assists highly skilled immigrant professionals who are underemployed or unemployed gain access to higher paying jobs through training and job placement assistance. The program includes courses in information technology and mechanical, electrical and civil engineering. Courses are scheduled around the needs of working professionals and offered evenings and weekends. ", "\nSince its inception in 1987, the Retraining Program helped connect more than 4,000 immigrant professionals to science, technology and engineering jobs. ", "\nALL SERVICES ARE FREE", "\nEngineering Classes includes:", "\n", "\nOSHA 30", "\nGreen Building Guidelines & Environmental Safety", "\nBuilding Operation, Maintenance & Safety Regulation", "\nHeating, Ventilation, Air-Condition and Safety Regulation (HVAC)", "\nNational Electrical Code (NEC) and Its Applications", "\nAISC Structural Steel Design", "\nACI Structural Concrete Design", "\nIntroduction to AutoCAD for Engineers", "\nAdvanced AutoCAD and Revit", "\nBuilding Cost Estimating and Bridge, Highway, Railroad Engineering", "\n", "\nInformation Technology classes includes: ", "\n- Cyber Security", "\n- Data Architecture Principles, Data Structure and SQL", "\n- Java Programming", "\n- Microsoft .NET and C#", "\n- Software Quality Assurance—Manual Testing", "\n- Software Quality Assurance—Automated Testing", "\n- Linux (UNIX) Administration", "\n- Android Software Development", "\n", "\n", "\nTo be considered for the program applicants must:", "\n", "\n•Be born outside of the United States", "\n•Be authorized to work in the United States", "\n•Have a bachelor's degree or higher and professional experience in the field of engineering, information technology, or a related field from the country of origin (not from US)", "\n•Have lived in the U.S. less than five full years. (Exceptions for those in the U.S. more than five years may be made on a case-by-case basis)", "\n•Be unemployed, underemployed, or working in a field not related to your education", "\n•Have intermediate+ English fluency", "\n•Demonstrate a financial need", "\n•Be highly motivated to pursue professional job search", "\n", "\nPlease, see our web site for more information and application instructions:  www.cooper.edu/immigrant-retraining  ", "\n", "\n    "], "images": [], "type": "full-time"},
{"text": "QA Automation Engineer for Fortune Firm", "date": "2019-08-27 10:54", "compensation": "$45.00-$60.00 per hour, temp to perm position", "link": "https://newyork.craigslist.org/fct/sof/d/norwalk-qa-automation-engineer-for/6965681794.html", "address": ["\n        ", "\nSee below.  Must be green card holder or US citizen.  Must be strong in automation along with Java and JavaScript.  Client wants right to hire after 6 months.  Temp to perm position, NO REMOTE work.  2 positions open.  One in Norwalk CT and other in NYC.  ", "\n", "\nAs follows:", "\n", "\nYou will be playing a key role in our QA Automation team, mostly you will participate in creating test environment, running test cases and building automation tools & frameworks. We are looking for technically strong and creative individuals that possess a passion for driving quality and ensuring a positive end user experience. You will also help our development teams by creating and delivering automated test solutions with the scalability to serve our expanding product offerings. Key Responsibilities • Quickly ramp up and gain relevant domain and technology knowledge • Define architecture, design, and implementation of Test Automation Framework • Set up Automation Test Environment for multiple application platforms such as Web, iOS, Android • Establish automation test coverage strategy that aligns with the product design and covers the entire software development life cycle. • Create, advocate and coach test automation best practices to team members & development teams • Design, build, and execute Web and API test scripts by translating manual regression test cases into automated test scripts • Set goals with the team, prioritize tasks, and own deliverables • Lead/execute testing for large-scale, web applications, tools, and/or software • Ensure that testing activities allow applications to meet business requirements and systems goals, fulfill end-user requirements, and identify existing or potential issues. • Provide recommendations for improvement of applications to stakeholders. • Collaborate with Development Managers, Product Owners and other teams to ensure the highest quality of the product by architecting automation focused solutions. • Leverage existing Automation Frameworks to build new test scripts while maintaining existing test scripts as per business requirements. • Conduct PoCs on latest test automation tools and technologies.", "\n", "\nSkills/ Experience Required • BA/ BS preferably in Computer Science OR Information Technology • 2+ years of proven experience in defining, developing and owning test automation infrastructure for a large enterprise. • Highly skilled in a variety of languages, frameworks, and tools for automated testing solutions such as • JavaScript, Node.js, Express.js (Highly Preferred)* • Java, TestNG, RestAssured • Selenium, Jasmine, SpecFlow, Cucumber and Protractor (Highly Preferred)* • MongoDB, Hibernate, REDIS • Saucelabs, Browserstack, etc (Highly Preferred)* • Hands on experience in developing test automation frameworks from scratch • Experience building continuous integration and deployment solutions (Jenkins, TeamCity, etc.) that served large software engineering organizations • Proficiency leveraging SoapUI, Postman or similar testing tools for API testing • Understanding of Big Data technologies and Distributed systems is a plus • Excellent knowledge of advanced SQL and relational database concepts • Experience with load/performance testing tools such as JMeter and other open source javascript based libraries. • Should have experience in manual testing • Excellent problem solving and troubleshooting skills. • Flexible in working as both an individual and a team player. • Experience with Github Flow and working with Atlassian tools such as Bamboo, Bitbucket, etc is a plus. • Experience working with a distributed team in an Agile Environment (Highly Preferred)*", "\n", "\n ", "\n", "\n    "], "images": [], "type": "contract"},
{"text": "Lead iOS Engineer", "date": "2019-08-29 17:45", "compensation": "Salary", "link": "https://newyork.craigslist.org/mnh/sof/d/new-york-lead-ios-engineer/6967493795.html", "address": ["\n        ", "\nCuriouser Products, Inc. d/b/a Mirror seeks Lead iOS Engineer; mail resumes to Mirror, ATTN: Kristie D’Ambrosio-Correll, 1261 Broadway, Suite 208, New York, NY 10001 quoting job #LE19.", "\n", "\nResponsibilities: Architect tailored solutions to specific software issues using widely accepted principles, patterns and technologies; build and improve communication channels between iOS client and proprietary technology; write unit and integration tests; research cross-platform technologies and conduct experiments to assist in building Android companion technologies; develop and direct software system testing and validation procedures, programming and documentation; supervise junior engineers; and other duties as assigned.", "\n", "\nEducation: Master* of Science degree in Computer Science, Computer Engineering, or related field (or foreign equivalent).", "\n", "\nRequirements: 2* years in the job offered or related positions.", "\n", "\nOther Special Requirements Include: 2 years of experiencing full mobile development lifecycle; 2 years of experience building iOS and Android applications; 2 years of experience with programming languages such as Swift, Objective-C; and 2 years of experience with SOLID, TDD, and MVVM.", "\n", "\n* In lieu of a Master of Science degree in the above/related fields (or foreign equivalent) and 2 years of experience in the job offered or related positions, Employer will accept candidates with a bachelor’s degree in the above/related fields (or foreign equivalent) and 5 years of progressive, post-baccalaureate experience in the job offered or related positions.    "], "images": [], "type": "full-time"}
]