[
{"text": "Product Software Engineer - up to $250,000 + Equity", "date": "2019-08-28 18:44", "compensation": "Product Software Engineer - up to $250,000 + Equity", "link": "https://sfbay.craigslist.org/sfc/sof/d/san-francisco-product-software-engineer/6966925096.html", "address": ["\n        ", "\nTo learn more or to apply for this position: ", "\n", "\nAs our Product Software Engineer you will have the opportunity to make a significant impact on the way borrowers understand and interact with their debt. In this role you will take on the responsibilities of a Full Stack Engineer, with between 50 - 80% of the work involved being the Front End. You will work directly with the CEO and a small team of engineers to build streamlined, borrower-focused features that will help consumers to understand their entire financial picture. ", "\n", "\nGeneral Requirements", "\n* 3+ years of startup and industry experience in a frontend or full-stack position", "\n* Strong grasp of Web fundamentals including modern Javascript frameworks and web servers", "\n* Self-directed and driven to ship", "\n* Comfortable working across the stack including prototyping, development, testing and deployment", "\n", "\nResponsibilities", "\n* Work on a small, interdisciplinary team to build new features on our web apps from the ground up", "\n* Build out complex products and features for our proprietary loan servicing platform", "\n* Be intellectually curious and honest - we're a \"first principles\" engineering team", "\n* Contribute to each step of the product development process, from ideation to implementation to release", "\n* Mentor more junior engineers, interns, or teammates in a lasting and impactful manner", "\n", "\nRequired Skills", "\n* Ruby ", "\n* Python", "\n* React", "\n* Javascript", "\n* Prototyping", "\n", "\nPreferred Skills", "\n* Strong eye for design and the ability to do basic comps when necessary", "\n* Experience outside of engineering: marketing, sales, design, management", "\n", "\nBenefits", "\n* Equity position", "\n* H1B transfers accepted    "], "images": [], "type": "full-time"},
{"text": "3D Renderer and Drafter", "date": "2019-08-19 13:46", "compensation": "DOE", "link": "https://sfbay.craigslist.org/sfc/egr/d/san-francisco-3d-renderer-and-drafter/6960213245.html", "address": ["\n        ", "\nThe position of 3D Renderer / CAD Drafter contributes to the success of NICOLEHOLLIS, Inc, by creating architectural and interior design renderings for residential and hospitality projects. The ideal candidate will have 5-7 years of experience working in the architectural 3D modeling industry with a solid understanding of applying materials, lighting a scene, and composition. Hand sketching and traditional rendering skills are a plus. ", "\n", "\nFull benefits package of Medical Coverage, 401K Plan, and PTO included.", "\n", "\nRESPONSIBILITIES\t", "\n\t", "\n3D RENDERING", "\n• Produce high quality photorealistic visuals of interior and exterior perspectives for hospitality and residential projects.", "\n• Produce 3D visualization studies of structural options and finish selections.", "\n• Produce custom photorealistic furniture and lighting.", "\n• Build a custom 3D library of objects, furniture, lighting etc. ", "\n• Concept development during pre-production phases with other designers. ", "\n• Involvement in the preparation of client concept presentations.", "\n", "\nCAD DRAFTER", "\n• Draw rough and detailed scale plans for foundations, buildings and structures, based on preliminary concepts, sketches, engineering calculations, specification sheets and other data.", "\n• Lay out and plan interior room arrangements for commercial buildings, using computer-assisted drafting (CAD) equipment and software. Layout proper devices/symbols and wiring on plans;", "\n• Obtain and assemble data to complete architectural designs, visiting job sites to compile measurements as necessary.", "\n• Clean-up the drawings in CAD program, organize layers, set-up the plot style configuration;", "\n• Examines plans for building code compliance, local ordinances, state regulations, DFP Planning & Design standards and general structural analysis in order to issue building plans for the construction or remodeling of homes.", "\n• Interprets code requirements for assists with advising involved parties of updates and changes in the code.", "\n• Prepares construction drawings for high end residential new construction and remodeling projects utilizing AutoCAD.", "\n• Work closely with project management and address questions, changes, or clarifications may come across.", "\n• Follow standard drawing process consistently and checking details for accuracy.", "\n", "\nSKILLS\t\t\t", "\n", "\n• Minimum 5 years of experience.", "\n• Proficiency in AutoCAD, 3D Studio Max, Rhino, Sketchup, and Photoshop. ", "\n• Ability to interact effectively with the design team and understands our team culture. ", "\n• Ability to collaborate with other designers and make revisions accordingly. ", "\n• Ability to multitask and manage multiple projects.", "\n• Have excellent speaking and presentation skills.", "\n• Have excellent self-motivating and driven skills, and core-team values", "\n", "\nTo apply for this position, please reply back with your resume, portfolio, and professional references. Phone calls or walk-in applications will not be accepted.    "], "images": [], "type": "full-time"},
{"text": "Full Stack Engineer / Hacker", "date": "2019-08-20 12:59", "compensation": "Competitive", "link": "https://sfbay.craigslist.org/sfc/sof/d/san-francisco-full-stack-engineer-hacker/6960939582.html", "address": ["\n        ", "\nWANTED", "\nA collaborative, team-oriented, full stack, developer with a hacker mindset wanted for a funded, San Francisco based startup with actual revenue and customers.  Employment is contract to full-time.", "\n", "\nNOT WANTED", "\nResumes, solo / cowboy programmers, NIH attitude", "\n", "\nYOUR MONDAY", "\nMonday morning you wake up, maybe have some coffee and breakfast, drag a comb across your head, and read through your email and Slack messages. You review the issues in our sprint backlog, as you get ready for our weekly 9:00am sprint planning meeting by hangout, which you attend in your pajamas. Maybe we play some planning poker to refine our estimates. After about an hour or so, we lock down the sprint and we're off and running for the week. Maybe you commit to these tasks: (1) writing a new Java servlet to implement a new feature; (2) defending against an attack on our codebase from other programmers, and (3) working closely with one of our customers who runs a top news website, to resolve a JavaScript error we're seeing on their site.", "\n", "\nAt 11:00am we scheduled a meeting to design a major new feature, so over a hangout and using screen shares as needed, we throw around design ideas, maybe you sketch some user interfaces, and draw out a flowchart or interaction diagram to clarify things. After the meeting, you write up the design and then circulate it for review. Once we finalize it, we'll break it down into stories or tasks in the backlog and schedule those in upcoming sprints.", "\n", "\nIt's lunch time, and you're done with 2 of your 3 scheduled meetings for the week. The rest of the week, you're up to your elbows in Java, JavaScript, PHP, Python, HTML, CSS, and various back end services running on AWS like Lambda Functions, CloudFront, Athena, and QuickSight to name a few.", "\n", "\nNow it's 1pm and you're ready to work on that customer issue. You look at the bug report details in Pivotal Tracker, connect into AWS and check our RDS, DynamoDB, and various EC2 and Elastic Beanstalk services to see if any of them are misbehaving. Into the Tomcat logs you go, and what do you spy with your little eye, but a bunch of exceptions and stack traces every time the customer website renders a page. \"Ahah!\" you say, \"The Java code isn't returning valid JSON to the client!\" and you're off and running on a fix. By the end of the day, you have the bug fix completed, and ready to test on our QA servers. Once verified, you check into git, continuous integration does its thing, and we push the change live. This was a good start to the week because fixing that bug directly increased our revenue.", "\n", "\nTomorrow, you'll be using a network analyzer like Fiddler or Charles to examine packets going in and out of our own custom-written proxy server, to figure out why a third party service is returning an error code to the server side of the proxy server, which ultimately ripples back to the client as an error. That'll have you deep into HTTP headers, cookies, content encoding, whether query arguments are encoded properly, and more as you try to figure that one out. That'll be fun.", "\n", "\n====", "\nA WORD FROM YOUR POTENTIAL MANAGER", "\nI've got 45 years of professional software development experience building some of the most successful and well known software in the world at companies like AT&T, Oracle, and Netflix, as well as numerous startups. This taught me that the best teams emerge when you bring together very talented software developers with the right combination of culture and process, and then something magical happens.", "\n", "\nHOW TO APPLY", "\nPlease DO NOT submit a resume. Your application will be turned down if you submit a resume. Instead, please apply by emailing a cover letter, explaining how your background is relevant to this job description, and why we should consider hiring you. You can read more about our business at www.adtoniq.io, and feel free to comment on our business as well. If we think you're a good match, we'll schedule a 90 minute Google Hangout during which we can talk about the position, but the bulk of the time we'll write some code together to see how well we can work together. During the Hangout, you'll be doing the driving and writing the code, but we'll be working together, like pair programming, though that's not usually how we work. If it's a go from both sides after that, we'll have an in person interview in San Francisco where we can explore the details of this position and our company.", "\n", "\nAdtoniq is committed to the principle of equal employment opportunity for all employees and to providing employees with a work environment free of discrimination and harassment. All employment decisions at Adtoniq are based on business needs, job requirements and individual qualifications, without regard to age, gender, gender identity, race, color, religion or belief, veteran status, family or parental status, or any other status protected by the laws or regulations in the locations where we operate. Adtoniq will not tolerate discrimination or harassment based on any of these characteristics. Adtoniq encourages applicants of all ages.", "\n    "], "images": [], "type": "contract"},
{"text": "Medical Device Engineer", "date": "2019-08-14 17:08", "compensation": "Compensation $60K-$80K depending on experience, plus stock options and benefits.", "link": "https://sfbay.craigslist.org/pen/sci/d/brisbane-medical-device-engineer/6956865016.html", "address": ["\n        ", "\nDelpor is a clinical stage life sciences company that utilizes innovative drug delivery technologies in order to develop once yearly therapies for chronic conditions.  We are looking for a full time Medical Device Engineer to join our research team.  The ideal candidate should be either a Mechanical Engineer with medical device background, or a Biomedical Engineer with mechanical engineering background.", "\nThe engineer will assist in product development in a variety of ways.  Tasks will include designing medical devices and related components, interacting with vendors and consultants, sourcing of materials, coordinating the manufacturing of prototype devices, writing reports and technical papers, IP development, addressing CMC issues, etc.", "\n", "\nRequirements:", "\n- A Bachelor’s Degree or a Master’s Degree in Mechanical Engineering, Biomedical Engineering or other related field", "\n- 1 to 4 years industry experience in medical device design and product development", "\n- Proficiency in SolidWorks or other equivalent 3-D CAD modeling software and familiarity with drawing standards", "\n- Experience developing test procedures and reports", "\n- Strong scientific/technical writing ability", "\n- Computer proficiency (MS Office) and ability to enter and manipulate data", "\n- Resourceful and able to work in a fluid startup environment  ", "\n- Strong written and oral communication skills", "\n- Reliable and a team player", "\n- Excellent time management and coordination skills and ability to prioritize workloads and schedules", "\n- Strong problem solving skills with creativity.", "\n- Experience working with vendors", "\n- Self-motivated with a strong work ethic.", "\n", "\nNice to have:", "\n- Working knowledge of Design Control ", "\n- Working knowledge of regulatory guidelines ", "\n- Working knowledge of manufacturing processes", "\n- Conversant with diffusion/membrane transport/filtration theory", "\n", "\n", "\nCompensation $60K-$80K depending on experience, plus stock options and benefits.  If you meet the requirements above, please email a copy of your resume and cover letter to:  hr@delpor.com.", "\n", "\nAbout Delpor:", "\nDelpor is a clinical stage life sciences company that utilizes innovative drug delivery technologies in order to develop once yearly therapies for chronic conditions.  The Company’s lead product is a 6-12-month formulation of Risperidone for the treatment of schizophrenia.  Delpor is also pursuing 6-12 month formulations of other drugs targeting CNS conditions including Neuromuscular Diseases, Neurodegenerative Diseases, Addiction, and other conditions.", "\n    "], "images": [], "type": "full-time"},
{"text": "Medical Device Engineer", "date": "2019-08-14 17:08", "compensation": "Compensation $60K-$80K depending on experience, plus stock options and benefits.", "link": "https://sfbay.craigslist.org/pen/egr/d/brisbane-medical-device-engineer/6956865013.html", "address": ["\n        ", "\nDelpor is a clinical stage life sciences company that utilizes innovative drug delivery technologies in order to develop once yearly therapies for chronic conditions.  We are looking for a full time Medical Device Engineer to join our research team.  The ideal candidate should be either a Mechanical Engineer with medical device background, or a Biomedical Engineer with mechanical engineering background.", "\nThe engineer will assist in product development in a variety of ways.  Tasks will include designing medical devices and related components, interacting with vendors and consultants, sourcing of materials, coordinating the manufacturing of prototype devices, writing reports and technical papers, IP development, addressing CMC issues, etc.", "\n", "\nRequirements:", "\n- A Bachelor’s Degree or a Master’s Degree in Mechanical Engineering, Biomedical Engineering or other related field", "\n- 1 to 4 years industry experience in medical device design and product development", "\n- Proficiency in SolidWorks or other equivalent 3-D CAD modeling software and familiarity with drawing standards", "\n- Experience developing test procedures and reports", "\n- Strong scientific/technical writing ability", "\n- Computer proficiency (MS Office) and ability to enter and manipulate data", "\n- Resourceful and able to work in a fluid startup environment  ", "\n- Strong written and oral communication skills", "\n- Reliable and a team player", "\n- Excellent time management and coordination skills and ability to prioritize workloads and schedules", "\n- Strong problem solving skills with creativity.", "\n- Experience working with vendors", "\n- Self-motivated with a strong work ethic.", "\n", "\nNice to have:", "\n- Working knowledge of Design Control ", "\n- Working knowledge of regulatory guidelines ", "\n- Working knowledge of manufacturing processes", "\n- Conversant with diffusion/membrane transport/filtration theory", "\n", "\n", "\nCompensation $60K-$80K depending on experience, plus stock options and benefits.  If you meet the requirements above, please email a copy of your resume and cover letter to:  hr@delpor.com.", "\n", "\nAbout Delpor:", "\nDelpor is a clinical stage life sciences company that utilizes innovative drug delivery technologies in order to develop once yearly therapies for chronic conditions.  The Company’s lead product is a 6-12-month formulation of Risperidone for the treatment of schizophrenia.  Delpor is also pursuing 6-12 month formulations of other drugs targeting CNS conditions including Neuromuscular Diseases, Neurodegenerative Diseases, Addiction, and other conditions.", "\n    "], "images": [], "type": "full-time"},
{"text": "Senior Mobile Engineer - up to $160,000 + Equity", "date": "2019-08-14 16:32", "compensation": "up to $160,000 + Equity", "link": "https://sfbay.craigslist.org/sfc/sof/d/san-francisco-senior-mobile-engineer-up/6956844326.html", "address": ["\n        ", "\nHiring now, for more information about this job and others like it check out : ", "\n", "\nWe are looking for a product oriented engineer to own and manage the front-end code base as a primary contributor. You have a track record of shipping high quality production code using React Native, Typescript and GraphQL. You will be working as a primary contributor to turn designs into production code, integrate GraphQL end points, and identify and fix front end related bugs.", "\n", "\nGeneral Requirements", "\n* 3+ years experience in mobile app development.", "\n* Familiarity with typescript, expo, apollo client (GraphQL), Jest testing framework", "\n* Experience integrating GraphQL API endpoints", "\n* Computer Science or related degree", "\n", "\nResponsibilities", "\n* Integrate GraphQL end points into mobile app", "\n* Turn designs into a beautiful polished app", "\n* Refactor code and improve user experience", "\n", "\nRequired Skills", "\n* GraphQL", "\n* React Native ", "\n* Typescript", "\n* UX", "\n* Expo", "\n* Apollo ", "\n* Jest testing framework", "\n", "\nPreferred Skills", "\n* Experience working at consumer or fintech startup", "\n* Design and detail oriented    "], "images": [], "type": "full-time"},
{"text": "Staff Engineer (Code/Platform) - HelloSign", "date": "2019-08-20 16:08", "compensation": "Compensation Depends on Experience", "link": "https://sfbay.craigslist.org/sfc/sof/d/san-francisco-staff-engineer-code/6961086492.html", "address": ["\n        ", "\nStaff Engineer (Code/Platform)", "\nSAN FRANCISCO, CA    ENGINEERING  FULL-TIME", "\n", "\nThe Staff Engineer (Code/Platform) will partner with CTO and Product Managers to lay technology foundation/framework for company initiative.", "\n", "\nWhat You'll Do", "\n\"\tWork will include design, development and testing of systems and setting operational specifications and analyzing software requirements re: products' performance, scale and security. ", "\n\"\tWill contribute to code base and provide hands-on technical leadership and architecting of systems throughout the SDLC cycle. ", "\n\"\tWill also work with Engineering Managers, Software Engineers and Product teams to develop a roadmap of technical requirements and projects to scale products. ", "\n\"\tWill drive architectural and design reviews and best practices across engineering organization. ", "\n\"\tMentor other senior and mid-level engineers.", "\n\"\tInvolved in quality and Agile/Kanban best practices; and perform other duties as required.", "\n", "\nRequired: ", "\n\"\tMaster's degree, or equivalent, in Computer Science or related field (Will accept bachelor's degree + five years of experience as equivalent)", "\n\"\tTwo years in position offered or in a solutions/software architect position", "\n\"\tUse of data modeling and SQL", "\n\"\tGo", "\n\"\tJava", "\n\"\tC#.NET", "\n\"\tAWS", "\n\"\tProvide technical expertise for software development team to drive code quality, architecture and design", "\n\"\tWrite prototypes for new generation of applications and improve existing applications as part of refactoring effort", "\n\"\tTesting new application features and develop test plans for QA teams.", "\n", "\nHiring Requirements: Background and Reference Checks + Code Test.", "\n", "\nAbout HelloSign, A Dropbox Company:", "\n", "\nWe believe that the way business gets done today is broken. That's why we're dedicated to simplifying work for everyone - from small startups to large enterprise companies. Millions of individuals and over 80,000 companies world-wide trust the HelloSign platform - which includes eSignature, digital workflow and eFax solutions - to automate and manage their most important business transactions.", "\n", "\nWith a sharp focus on user experience and a lust for innovation, HelloSign is on a mission to Simplify Work.", "\n", "\nLife at HelloSign:", "\nJust over 140 employees, we are growing the company deliberately, with a keen eye towards maintaining a culture that values lifestyle, fun and continuous improvement. We were awarded the Hirepalooza Culture Award for Lifestyle in 2015 and the Healthy Mothers Workplace Bronze Award in 2016 and 2017. In 2018, we won SF Business Times' Best Places to Work Award for Small Employers. We continue to maintain an overwhelmingly positive presence on Glassdoor and The Muse.", "\n", "\nWe have raving fans who love what we make o We're user-focused and product-driven o We're always evolving with an eye towards improvement o We're committed to building a product people want o We thrive on collaboration and learning from each other o We have a supportive, familial atmosphere o We work in an open, airy, creative space o We laugh a lot o We love dogs o And we'll never forget your birthday!", "\n", "\nHelloSign is an equal opportunity employer committed to hiring a diverse team of qualified individuals o HelloSign conducts background checks; pursuant to the San Francisco Fair Chance Ordinance, HelloSign will consider for employment qualified applicants with arrest and conviction records o HelloSign participates in E-Verify.", "\n    "], "images": [], "type": "full-time"},
{"text": "SENIOR DESIGNER (RESIDENTIAL INTERIOR DESIGN)", "date": "2019-08-19 13:31", "compensation": "DOE", "link": "https://sfbay.craigslist.org/sfc/egr/d/san-francisco-senior-designer/6960199992.html", "address": ["\n        ", "\nNICOLEHOLLIS Interior Design seeks a talented and motivated Senior Designer to assist our residential design team.  ", "\n  ", "\nThe ideal candidate will have 5-7 years of experience in residential interior design and excellent presentation and drafting skills.  The Designer will work under the Principal and oversee all aspects of the design process - from schematic design to construction documentation and construction management.  The Designer will be expected to recommend a visual presentation of the concept and communicate the Principal Designer's objectives orally and visually, and will manage a team of 3-5 designers and all project related tasks, client meetings and contractor coordination.", "\n", "\n", "\nSummary of Key Responsibilities & Skills:  Responsibilities, essential job functions, skills and core competencies include but are not limited to the following:      ", "\n•\tResearch and analysis of the client's goals and requirements, and development of documents, drawings and diagrams that outline those needs. Ability to interact effectively with the design team on multiple projects. ", "\n•\tFormulate preliminary space plans, two and three dimensional design concept studies and sketches that integrate the client's needs and are based on knowledge of the principles of interior design and theories of human behavior.  ", "\n•\tOversee the implementation of interior design solutions for each project from concept stage through installation.  ", "\n•\t Confirm that preliminary space plans and design concepts are safe, functional, aesthetically appropriate, and meet all public health, safety and welfare requirements.  ", "\n•\tSelect colors, materials and finishes to appropriately convey the design concept, functional, life-cycle performance, environmental, and safety requirement. ", "\n•\t Manage the interior design resource library and maintains vendor contracts for interior furnishings, fixtures and finishes.    ", "\n•\tSelect and specify furniture, fixtures, equipment and millwork, including layout drawings and detailed product description; and provision of contract documentation to facilitate pricing, procurement and installation of furniture. ", "\n•\tPrepare specifications and schedules with accurate product information for all furniture, plumbing, appliances, lighting and finishes.  ", "\n•\tPrepare construction documents, consisting of plans, elevations, details and specifications, to illustrate non-structural and/or non-seismic partition layouts; power and communications locations; reflected ceiling plans and lighting designs; materials and finishes; and furniture layouts. Ability to field measure and document building condition ", "\n•\tPreparation of construction documents to adhere to regional building and fire codes, municipal codes, and any other jurisdictional statutes, regulations and guidelines applicable to the interior space.  ", "\n•\tCoordination and collaboration with other design professionals who may be retained to provide consulting services, including but not limited to architects, structural, mechanical and electrical engineers, and various specialty consultants. ", "\n•\tObservation and reporting on the implementation of projects while in progress and upon completion, as a representative of and on behalf of the client; and punch list items.", "\n•\tPrepare project cost, fee analysis and proposals, and oversee and review project billings with consideration of roles, responsibilities and add service requests as outlines in project contract.", "\n•\tEfficiently manage project designers, assistants and interns on project team; demonstrate strong managerial and communication skills.  ", "\n", "\n", "\nSkills:", "\n", "\n•\tDegree in Interior Design ", "\n•\tMinimum of 5 years interior design experience", "\n•\tExcellent presentation skills, including space planning and drawing", "\n•\tProficiency in AutoCAD, AutoCAD LT ", "\n•\tAbility to create a set of construction drawings, specifications and schedule", "\n•\tAbility to create and manage Excel spreadsheets", "\n•\tKnowledge of Adobe Illustrator, InDesign and Photoshop", "\n•\tKnowledge of and/or ability to learn time-keeping and billing software", "\n•\tExperience selecting and specifying lighting, furnishings, hardware, floor/window coverings, materials, and finishes.", "\n•\tAbility to interact effectively with the design team on multiple projects", "\n•\tExperience with purchasing and budgets ", "\n•\tKnowledge of trade resources and vendors", "\n", "\n", "\nWe offer a full benefits package including comprehensive medical, dental, 401k plan, and PTO.", "\n", "\nTo Apply:  Please reply to this post with your resume, cover letter, references and desired salary.  Thank you for your interest.", "\n    "], "images": [], "type": "full-time"},
{"text": "Solar PV and Energy Storage Designer", "date": "2019-08-15 10:49", "compensation": "$19.00 – $36.00 per hour", "link": "https://sfbay.craigslist.org/sfc/egr/d/san-francisco-solar-pv-and-energy/6957293730.html", "address": ["\n        ", "\nThis is your chance to change the way the San Francisco Bay Area powers its homes and businesses. Luminalt, San Francisco’s leading solar design and installation company (CSLB #845219) is looking for a Solar Designer to join us in designing residential and commercial solar photovoltaic installations.", "\n", "\nAbout Luminalt", "\n", "\nLocally owned and operated, Luminalt designs and builds solar systems for single and multi-family homes, businesses, and non-profits in the San Francisco Bay Area. Certified as San Francisco's only Woman Business Enterprise solar installation company, Luminalt is also a San Francisco certified green business.", "\n", "\nLuminalt's outstanding installation quality and award winning customer service sets us apart. We are committed to increasing diversity in the solar industry and are an equal opportunity employer. Luminalt's office is fast paced, results oriented and growing. Our office is professional, but casual.", "\n", "\nVisit ", " for more information about Luminalt.", "\n", "\nAbout You", "\n• You have a strong desire to work in the solar and energy storage fields", "\n• You have a strong desire to learn and continuously improve", "\n• You are self directed, independent, and solution oriented", "\n• You are technically minded", "\n• You are highly motivated and ethical", "\n• You are reliable and punctual", "\n• You are committed to working hard, doing great work, and achieving your objectives", "\n• You value trust, honesty, and teamwork", "\n• You value outstanding customer service", "\n", "\nQualifications", "\n• 1+ years of experience working with AutoCAD in a similar or related field", "\n• Proficient with spreadsheets such as Microsoft Excel or Google Sheets", "\n• Able to read and interpret building plans, building codes, technical bulletins, code books and related construction documents", "\n• Valid CA driver's license with a clean driving record", "\n• Ability to climb ladders and lift up to 25 lbs", "\n• Proficient in English with excellent written communication", "\n", "\nDesired Characteristics", "\n• 4 year degree in engineering or related field", "\n• NABCEP certification", "\n• Understanding of the national electrical code", "\n• Working knowledge of residential and commercial wiring", "\n• Previous design and or construction experience in the solar industry", "\n• Experience with Saleseforce or similar customer relationship management software", "\n", "\nJob Description", "\n", "\nThe Solar Designer plays a key role in maintaining Luminalt’s excellent customer experience while taking projects from sales through permitting to complete installation. The Solar Designer works on all aspects of designing, drawing, and obtaining permits for solar photovoltaic (PV) and energy storage projects. The Solar Designer will also help with pre-sale project estimating for commercial projects including development of preliminary designs, creating proposals, and responding to RFQs. On-the-job training can be provided for areas outside of the candidate’s expertise.", "\n", "\nThe Solar Designer will", "\n• Plan and design PV and energy storage systems", "\n• Draft PV and energy storage system permit documents including electrical plans and to-scale site plans using AutoCAD", "\n• Create job site work instructions for the installation team", "\n• Use shade analysis to optimize system design", "\n• Work with local building departments to apply for and obtain building permits", "\n• Work with local permitting jurisdictions to assure that our proposals and designs meet their requirements", "\n• Generate accurate Bill Of Materials (BOMs) for installations", "\n• Complete service load calculations for adding loads or downsizing main breakers", "\n• Maintain permitting jurisdiction and building department files and notes", "\n• Review site intake sheets provided by outside sales consultants, completing a preliminary design, and drafting sales proposals", "\n• Work with clients to determine their needs, send design revisions, and help the outside sales consultants ", "\n• Keep apprised of design, financial, and general market considerations with a goal of staying competitive and offering efficient options for our clients", "\n• Interact with customers and other project stakeholders in person, on the phone, and via email", "\n• Travel to project sites to gather site-specific data", "\n• Work both in a team environment and with little supervision", "\n• Keep a record of work and complete accurate timesheets", "\n", "\n", "\nPlease apply with your resume and cover letter to hiringdesigner@luminalt.com", "\n", "\nThe successful candidate will be required to pass a drug screen prior to starting", "\n", "\nThe successful candidate will be willing to undergo a background check in accordance with local laws and regulations", "\n", "\nThe successful candidate will be authorized to work in the United States", "\n    "], "images": [], "type": "full-time"},
{"text": "Back-End Engineer", "date": "2019-08-16 16:16", "compensation": "Determine on Experience", "link": "https://sfbay.craigslist.org/sfc/sof/d/san-francisco-back-end-engineer/6958287329.html", "address": ["\n        ", "\nWhil is the leader in digital wellbeing and mindfulness training. We have a wellbeing platform with daily sessions and 250+ science-based mini-courses for mindfulness, sleep, emotional intelligence skills, and more. In addition, we have 1,800 audio/video sessions based in neuroscience, mindfulness, emotional intelligence, and positive psychology. We’re committed to improving company cultures and helping all employees live healthier, happier, and more engaged lives!", "\n", "\nWe’re looking for a talented scala developer to join our collaborative engineering team.  You will continue our rapid growth by building solutions that add significant value to our product with a goal of increasing customer satisfaction and engagement. We are looking for someone to help simplify infrastructure and assist with back-end refactoring. ", "\n", "\nRequirements:", "\n-B.S. in Computer Science, Engineering or equivalent", "\n-5+ years of software development experience, releasing commercial products or web-based high volume transaction systems", "\n-Prior experience with Scala or Functional Programming", "\n-Strong experience with web frameworks, databases and API development", "\n-Strong foundation in OOP, REST, SQL, messaging systems and streaming data", "\n-Strong experience working in virtualized environments like Docker", "\n-Work with data sets of varying sizes and complexity, including both structured and unstructured data", "\n-Excellent communication skills and proactive in suggesting improvements", "\n-Ability to plan and deliver on-time and under pressure", "\n-Good sense of humor with a great ability to work with others", "\n", "\nPreferred Experience:", "\n-Experience with Akka, Spray or OAuth is a big plus", "\n-Strong knowledge of and interest in microservices and reactive programming", "\n-Experience building application metrics, user analytics and dashboards", "\n-Experience with Business Intelligence systems (Looker, BO, Tableau)", "\n-Previous entrepreneurial venture or early stage startup experience", "\n-Experience in SSO integrations, web services & technology", "\n-AWS: EC2, Lambda, VPC, S3, EBS, EMR, CloudWatch, Redshift, Aurora", "\n-Experience with Scrum processes & systems (sprints, JIRA, Confluence)", "\n-Ops: Salt Stack, ThreatStack, Nagios, Slack integrations", "\n-Misc: Akka Persistence, protobuf, Cassandra, Kafka, Spark Streaming", "\n-Regulations: GDPR, SOC 2, HIPAA", "\n", "\n ", "\nPerks and Benefits:", "\n-Competitive compensation and benefits package (i.e. free healthcare, 401K, etc.)", "\n-Start-up perks, including ping-pong, shuffleboard, daily mindfulness meditation using our product, catered lunches, a stocked snack cabinet, and coffee", "\n-Free parking in the lot behind our building", "\n-Funds for annual career development and team bonding", "\n-4-weeks annual PTO + 1 day for each year worked", "\n-10 paid holidays", "\n-We’re in a fast-paced growth mode and each team has high-performing, great people!", "\n", "\nWe know great work isn’t done alone. We’re building a team of individuals with different strengths to benefit our employees and members. We strongly believe that different backgrounds and ideas are a competitive advantage; we hire candidates of any race, color, ancestry, religion, sex, national origin, sexual orientation, gender identity, age, marital or family status, disability, Veteran status, and any other status. Whil Concepts is proud to be an Equal Opportunity and Affirmative Action Employer and will consider qualified applicants with criminal histories in a manner consistent with the San Francisco Fair Chance Ordinance. If you have a disability or special need that requires accommodation, please let us know.", "\n    "], "images": [], "type": "full-time"},
{"text": "JavaScript Application Developer  (React)", "date": "2019-08-24 00:17", "compensation": "Base salary plus stock options and benefits", "link": "https://sfbay.craigslist.org/pen/sof/d/south-san-francisco-java-application/6963485932.html", "address": ["\n        ", "\n", "\n", "\n", "\nThe Application Software Engineer develops the ECL Command Center and the multiple internal applications on which the ECL runs. The Command Center is a desktop application built with web technologies. It offers scientists a broad suite of tools for designing experiments on the ECL, tracking their progress, and analyzing their results, all within the collaborative context of working alongside other researchers. Projects include: the notebook interface to Emerald’s Symbolic Lab Language (SLL); team-based features for managing projects and end-to-end research workflows; point-and-click command builders that onboard users into the capabilities of SLL; building out the platform for running the web application on the desktop.", "\n", "\nWe’re a small team, which means it is essential for every team member to be ready to take ownership and lead projects. Feature development and proximity to overall UX are both central in this role, so the Application Engineer works very closely alongside the outstanding ECL Design team.", "\n", "\nAs an early team member helping to build the Engineering team as well as the product, you will also be encouraged to contribute to the software engineering practices we maintain in our own work, and which we bring to ECL as a whole. We strive to be continually critical of our process, cutting cruft and homing in on performance multipliers (such as continuous integration and agile development practices).  ", "\n", "\n", "\n", "\nOur applications are web apps (React / HTML5 / CSS3) running on the desktop using NW.js, across Windows and Mac OS. Our back-end services are written in Go, and deployed on AWS infrastructure in Docker containers, with container orchestration through Kubernetes. Our source code control is on Github, with integration with Travis CI for continuous testing. The Symbolic Lab Language is written in the Wolfram Language. Our stack is always evolving, and we welcome new ideas and technologies which enhance our ability to deliver incredible software.", "\n", "\nThe Application Engineering role operates primarily in front-end technologies like React and Redux. More broadly, developing the software to enable cloud-based science is an expansive, diverse challenge. A core component of our job is consistently determining the right tools for the job at hand, and diving in to learn these new technologies along the way.", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\nThe Emerald Cloud Laboratory (ECL) enables life scientists to move out of the lab, and to conduct research entirely from a computer. Stepping away from manual completion of experiments at the bench, scientists on the ECL leverage the remote, automated execution of all standard biology and chemistry experiments in Emerald’s industrial lab facilities, working within a software platform for all stages of research workflows, from experimental design to data analysis.", "\n", "\n", "\n", "\n", "\nIf you would like to apply and learn more, we’d love to hear from you! ", "\n", "\nApply Here: ", "\n", "\n", "\n", "\nPlease visit our Careers section to view more career opportunities. ", "\n", "\n", "\n    "], "images": [], "type": "full-time"},
{"text": "Truck Driver - Automated Vehicle Operator (AVO)", "date": "2019-08-30 14:45", "compensation": "Excellent salary, benefits, and equity", "link": "https://sfbay.craigslist.org/sfc/trp/d/san-francisco-truck-driver-automated/6968200725.html", "address": ["\n        ", "\nIke’s mission is to make trucks safer, truckers more valuable, and trucking more efficient. We are bringing together the world’s leading experts in transportation and robotics to transform the way the world moves and build a real commercial product at scale. ", "\n", "\nAbout Your Team", "\n", "\nThe Vehicle Operations team is responsible for safely guiding ours trucks down the road as they learn and adapt to the changing highway environment. You will be in the driver’s seat testing the most exciting application of automation technology on commercial vehicles.", "\n", "\nAbout Your Role", "\n", "\nIke is looking for experienced commercial drivers that are technically savvy and eager to learn. Our robotic trucks will gather information used for automated vehicle development. It is imperative that we find competent, safety-minded operators that are willing to do whatever it takes to meet our mission needs.", "\n", "\nAbout Your Work", "\n", "\n- Safely operating a Class-8 tractor for extended periods of time", "\n- Utilize proprietary software to gather data and troubleshoot in a variety of real world situations, while simultaneously providing detailed and accurate feedback to our engineers", "\n- Collaborate closely with our talented software and hardware engineers to advance our technologies and internal workflows, and ultimately help shape our product roadmap", "\n- Develop and maintain positive, cooperative and team-oriented relationships", "\n- Assist in developing new procedures and policies for the development of the vehicle on-road", "\n- Availability to travel away from home for 1-2 weeks at a time", "\n", "\nAbout You", "\n", "\n- Valid Class A Commercial Driver’s License (CDL) with 3+ years experience (OTR preferred)", "\n- Clean driving record", "\n- Meet all DOT requirements ", "\n- Pass a criminal background and pre-employment drug check", "\n- Willing to be enrolled in Employee Pull Notice program (EPN)", "\n- Pass a number of training checkpoints both in and out of the vehicle", "\n- Possess a professional attitude and ability to work as part of a team ", "\n- Able to learn new software applications and processes", "\n- Troubleshoot and solve software and hardware related issues", "\n- Have flexibility to work different shifts including mornings and nights", "\n- Outspoken about safety", "\n- Bonus: previous autonomous vehicle industry experience", "\n", "\n===", "\n", "\nApply on our website at ikerobotics (dot) com or through this link: ", "    "], "images": ["https://images.craigslist.org/00c0c_dMlfGtr1INT_600x450.jpg", "https://images.craigslist.org/00D0D_5oKQFVsaA4H_600x450.jpg"], "type": "full-time"},
{"text": "Senior Software Engineer - Infrastructure", "date": "2019-08-06 14:03", "compensation": "DOE", "link": "https://sfbay.craigslist.org/sfc/sof/d/san-francisco-senior-software-engineer/6951021070.html", "address": ["\n        ", "\nData analysis is plagued by a fundamentally flawed workflow that leads to slow turnaround times, high error rates, and fewer insights. By combining analytics tools with a collaborative user experience, Mode is alleviating the most pressing bottleneck for analytical organizations. We are looking for a web infrastructure engineer to join us in revolutionizing the way the world analyzes data. This person will be an integrated part of our core engineering team.", "\n", "\nWhat you'll do:", "\nWork with the rest of our software engineers to build application services that power our core product", "\nResearch and evaluate technologies for what we build--determine priorities by estimating projects' potential impact", "\nConfiguration management", "\nExpand and improve our build and release automation process", "\nWork with our team to define and implement security practices", "\nLearn from others and teach those around you", "\n", "\nWhat we look for:", "\nStrong software development background", "\nYou love to automate yourself out of a job", "\nTons of experience with configuration management tools", "\nExperience with testing, continuous integration, and continuous deployment", "\n", "\nTools we use:", "\nAnsible and Cloud Formation for configuration management for orchestration", "\nDocker and Kubernetes", "\nA wide array of AWS services including EC2, RDS and Redshift", "\nNew Relic and Wavefront for monitoring", "\nGithub and Travis CI", "\n", "\nAbout Mode:", "\nMode is building the most advanced cloud analytics platform to make businesses and communities more data driven. Analysts and Data Scientists use Mode to analyze data, build visualizations, and share work with colleagues. Companies love the product because their analysts are able to quickly make data more useful to more people.", "\n", "\nIn everything we do, we strive to put the people we do it for first. This starts internally: together we're building a culture that embraces diversity and learning, humility and gratitude. At the same time, we try not to take ourselves too seriously and strive for a healthy balance between work and personal pursuits.", "\n", "\nBenefits you can expect as a Mode employee:", "\nGenerous, flexible PTO and family leave", "\nFlexible work schedules—we trust you to know what will make yourself most productive", "\nGenerous professional development policy that includes funds earmarked for each employee's discretionary professional growth—Have a conference you want to attend? A class you want to take? If it's helping take your career to the next level, it's on us.", "\nExcellent health coverage for team members and their families (Mode pays the 100% of the premiums)", "\nSupportive work environment and a manager who is focused on your professional growth", "\nCompany events that highlight our team's passions and hobbies", "\nSnacks and in-office lunches shared at our ever-growing lunch table", "\n", "\nMode is committed to building an inclusive and diverse workforce. We are an Equal Opportunity Employer and welcome people from all backgrounds, experiences, abilities and perspectives.    "], "images": [], "type": "full-time"},
{"text": "Game Developer (Unity 3D)", "date": "2019-08-26 15:57", "compensation": "Market Competitive", "link": "https://sfbay.craigslist.org/sfc/sof/d/san-francisco-game-developer-unity-3d/6965353177.html", "address": ["\n        ", "\nGame Developer (Unity 3D)", "\n", "\n", "\nJOB DESCRIPTION:", "\nThe largest independent mobile games studio is looking for a talented and accomplished Unity Games Developer. You will be working in a team of very technical, motivated and experienced individuals ranging from Software Engineers to Game Developers and Technical Artists, in order to develop, maintain and grow our base of mobile games.", "\nThe ideal candidate has experience working in Unity, is passionate about creating games in a Production Environment and a team player.", "\n", "\n", "\nQUALIFICATIONS:", "\n-- You have an engineering or technical art background, preferably a Computer Science degree or Games Development Degree, with a strong knowledge of Unity3d for game development", "\n-- If you do not have a background in engineering then we at least require you to have 2 years in the industry of game development", "\n-- If you do not have the experience of working in a games company, we require an ample list of personal projects and games that you have worked or contributed to in the past", "\n-- You understand how to improve Unity performance", "\n-- You have experience with UGUI", "\n-- You have experience with C# programming", "\n-- You’ve used Unity3D for 2D games", "\n-- You love to learn new things and expand your skills as an engineer", "\n-- You love games", "\n-- You are a fast learner, self motivated person who likes to work in a production environment focused on results", "\n", "\nOptional:", "\n-- Knowledge of (if not, we’ll be happy to teach you):", "\n       Ruby", "\n       Objective-C", "\n       Java", "\n-- Experience developing Shaders, Shuriken Particle System, ", "\n", "\nCOMPENSATION:", "\n$70,000 - $130,000", "\n", "\nUS:", "\nSuper Lucky Casino is the largest independent developer of social casino games in the world.  We’re profitable and have been around for a while.  We produce some of the most fun and successful social casino apps on iTunes, Google Play, and Amazon!", "\n", "\nWe work as a team. Everyone helps everyone. Everyone is a teacher. Everyone is a student. Overall, our goal is to make our team better at what we do.", "\n", "\n", "\nPERKS:", "\nThis position is full-time with some schedule flexibility. We offer market-competitive compensation, full benefits, 401K, and PTO. We encourage personal growth and provide everyone an opportunity to grow in whichever direction they are most interested!", "\n", "\nRecruiters of any sort are NOT welcome to contact us about filling our open positions.", "\n", "\nTO APPLY:", "\nPlease visit our Game Developer job posting on our website at www.superluckycasino.com.    "], "images": [], "type": "full-time"},
{"text": "Senior Back-End Services Engineer", "date": "2019-08-06 13:43", "compensation": "DOE", "link": "https://sfbay.craigslist.org/sfc/sof/d/san-francisco-senior-back-end-services/6951003685.html", "address": ["\n        ", "\nMode is changing how organizations make decisions by equipping every single person with the power to collaborate on analytics and share insights at the pace of work today. We're building the most advanced web-based environment for creating, sharing, and discussing ad-hoc analysis using a variety of technologies. We have a rapidly expanding list of happy customers who love our product and we're growing to serve even more.", "\n", "\nAs a Back-End Services Engineer at Mode, you'll work closely with other Engineers, PM's, and Designers to build a powerful application, enabling anyone to build complex data visualizations and manipulations. From building Visual Data Modeling tools to working on our Data Engine that will power millions of queries a day, your work will impact the way our customers understand and share their data. ", "\n", "\nWhat you'll do:", "\nDevelop the services that power our Web Application and API's for data analysts and business users", "\nDefine and maintain development practices that let us move fast with quality", "\nWork with a wide range of tools and technologies and be able to evaluate technologies for what we are building", "\nDetermine priorities by estimating the potential impact of projects", "\nLearn from others and teach those around you", "\n", "\nWhat we look for:", "\nYou have built and shipped services that support Web Applications and/or API's", "\nExpert-level aptitude with several programming languages. Right now our services team is primarily using Go and Java but across the application stack we use TypeScript and Ruby on Rails. We are open to hiring people with backgrounds in any languages", "\nExperience with testing, continuous integration, and continuous deployment", "\nAlignment with Mode's values", "\n", "\nAbout Mode:", "\nMode is a collaborative analytics platform that brings teams together around data to make game-changing decisions.", "\n", "\nIn everything we do, we strive to put the people we do it for first. This starts internally: together we're building a culture that embraces diversity and learning, humility and gratitude. At the same time, we try not to take ourselves too seriously and strive for a healthy balance between work and personal pursuits.", "\n", "\nBenefits you can expect as a Mode employee:", "\nGenerous, flexible PTO and family leave", "\nFlexible work schedules—we trust you to know what will make yourself most productive", "\nGenerous professional development policy that includes funds earmarked for each employee's discretionary professional growth—Have a conference you want to attend? A class you want to take? If it's helping take your career to the next level, it's on us.", "\nExcellent health coverage for team members and their families (Mode pays the 100% of the premiums)", "\nSupportive work environment and a manager who is focused on your professional growth", "\nCompany events that highlight our team's passions and hobbies", "\nSnacks and in-office lunches shared at our ever-growing lunch table", "\n", "\nMode is committed to building an inclusive and diverse workforce. We are an Equal Opportunity Employer and welcome people from all backgrounds, experiences, abilities and perspectives.    "], "images": [], "type": "full-time"},
{"text": "Junior Product Manager", "date": "2019-08-26 11:21", "compensation": "TBD", "link": "https://sfbay.craigslist.org/sfc/sof/d/san-francisco-junior-product-manager/6965117060.html", "address": ["\n        ", "\n", ":  ", "\n", "\nWorking with the VP of Business Development, the Junior Product Manager will help define the user experience, monitor product use and performance, author detailed specifications and requirements, and ensure that the delivered product meets the business goals for CollegeData, 1st Financial Bank USA’s affiliate site.", "\n ", "\nThis position requires being proficient in the tools of product management and a deep working knowledge of user experience, interaction design, web technology, user acquisition, mobile applications, and online marketing, including Search Engine Optimization (SEO). This needs to be coupled with proficient web skills and the ability to connect the design of the site to the business goals of the site.", "\n ", "\nThe individual hired will also incorporate product solutions and strategy, ensuring that their product road map supports CollegeData’s business goals and overall marketing strategy.", "\n ", "\nThis position will have a significant impact on the future success of CollegeData, developing new site features and discovering ways to enhance the existing tools on the site to provide our users with an exceptional college planning resource.", "\n", "\n", ":", "\n", "\n•\tReport to and work with VP of Business Development to define product vision and product road map that supports CollegeData’s design, marketing, and overall goals", "\n•\tUnder the supervision of the VP of Business Development, conduct requirements gathering and create project documentation (project charters with clear outlined scope, detailed requirements, use cases, user flows and reporting). ", "\n•\tServe as IT’s link to the business, acting as the subject matter expert for the functional operation of CollegeData’s software applications and business processes ", "\n•\tWork closely with internal project managers and engineers to execute the product road map ", "\n•\tProvide functional guidance to engineers to resolve issues ", "\n•\tLeverage web analytics, visitor analytics, and customer data analytics to develop an understanding of user behavior and to recommend strategies that will help the site achieve its business goals ", "\n•\tDefine success metrics for projects, ensuring that relevant data is collected in analytics ", "\n•\tCreate page wireframes to explore multiple user experience options ", "\n•\tWork closely with CollegeData’s content creators, user interface design, engineers, and quality assurance to ensure that projects achieve the desired business goals ", "\n•\tPrioritize product enhancements and triage bugs ", "\n•\tWork with CollegeData’s UI/Visual designers, providing support, prioritizing design tasks, and reviewing work progress ", "\n•\tComplete user acceptance testing of new features and enhancements  ", "\n", "\n", ":", "\n", "\n", ": Bachelor’s degree in computer science or equivalent experience", "\n ", "\n", ":", "\no\tMinimum of 2-4 years product management experience with consumer facing websites, with a focus on content-rich, data-driven web applications and mobile applications", "\no\tAbility to create a clean user experience from complex requirements", "\no\tFamiliarity with new and emerging website design approaches ", "\no\tStrong desire to leverage data and analytics to achieve business goals", "\no\tSuperior written and oral communication skills ", "\no\tTechnical aptitude and ability to collaborate with a development team", "\no\tAbility to create wireframes and mockups", "\no\tDemonstrated experience working with the full product development life cycle", "\n ", "\n", ":", "\no\tFamiliarity with website infrastructure ", "\no\tFamiliarity with best practices in Search Engine Optimization (SEO)", "\no\tExperience extending website functionality by integrating with Facebook, Instagram, Twitter and other social networks and third party APIs ", "\no\tExperience with email marketing and online advertising networks ", "\no\tHTML and CSS coding experience ", "\n", "\n", ":", "\no\tExceptional problem-solving skill and ability to effectively collaborate with cross-functional global teams ", "\no\tDemonstrated experience collaborating closely with content creators, marketers, UI designers, engineers, database administrators and quality assurance personnel ", "\no\tAbility to identify, analyze and clarify multiple options for new product development ", "\no\tAbility to meet project deadlines and commitments", "\no\tA strong desire to work with, and be a reliable member of a small team, wearing multiple hats to get things done ", "\no\tComfortable building knowledge in areas beyond current area of expertise", "\no\tExcellent presentation and communication skills. ", "\no\tExperience working with or developing web applications for college bound high school students ", "\no\tKnowledge of college planning, admission and financial aid from professional experience", "\n", "\n", "\n", "\nWe provide a highly competitive and comprehensive compensation and benefits program including affordable medical/dental/vision insurance, generous paid leave program, 401(k), health savings account, tuition reimbursement, financial childcare assistance and much more!", "\n", "\n1fb.net inc is an EO employer - M / F / Vets / Disabled.", "\n    "], "images": [], "type": "full-time"},
{"text": "Senior Back-End Application Engineer", "date": "2019-08-06 13:47", "compensation": "DOE", "link": "https://sfbay.craigslist.org/sfc/sof/d/san-francisco-senior-back-end/6951007056.html", "address": ["\n        ", "\nData analysis is plagued by a fundamentally flawed workflow that leads to slow turnaround times, high error rates, and fewer insights. By combining analytics tools with a collaborative user experience Mode is alleviating the most pressing bottleneck for analytical organizations. We are looking for a senior back-end web engineer to join us in revolutionizing the way the world analyzes data.", "\n", "\nWhat you'll do:", "\nDevelop our core web applications for data analysts and business users", "\nDefine and maintain development practices that let us move fast with quality", "\nWork with a wide range of tools and technologies (from SQL to Javascript) and be able to evaluate technologies for what we are building", "\nDetermine priorities by estimating the potential impact of projects", "\nLearn from others and teach those around you", "\n", "\nWhat we look for:", "\nYou have built and shipped web applications", "\nExpert level aptitude with several programming languages (we hire people with backgrounds in any languages, but right now we are primarily using Ruby, Go, Java and Javascript)", "\nExperience with testing, continuous integration, and continuous deployment", "\nAlignment with Mode's values", "\n", "\nAbout Mode:", "\nMode is a collaborative analytics platform that brings teams together around data to make game-changing decisions.", "\n", "\nIn everything we do, we strive to put the people we do it for first. This starts internally: together we're building a culture that embraces diversity and learning, humility and gratitude. At the same time, we try not to take ourselves too seriously and strive for a healthy balance between work and personal pursuits.", "\n", "\nBenefits you can expect as a Mode employee:", "\nGenerous, flexible PTO and family leave", "\nFlexible work schedules—we trust you to know what will make yourself most productive", "\nGenerous professional development policy that includes funds earmarked for each employee's discretionary professional growth—Have a conference you want to attend? A class you want to take? If it's helping take your career to the next level, it's on us.", "\nExcellent health coverage for team members and their families (Mode pays the 100% of the premiums)", "\nSupportive work environment and a manager who is focused on your professional growth", "\nCompany events that highlight our team's passions and hobbies", "\nSnacks and in-office lunches shared at our ever-growing lunch table", "\n", "\nMode is committed to building an inclusive and diverse workforce. We are an Equal Opportunity Employer and welcome people from all backgrounds, experiences, abilities and perspectives.    "], "images": [], "type": "full-time"},
{"text": "Zynga - Space & Design Planner Returnship", "date": "2019-08-27 11:11", "compensation": "Depending on experience", "link": "https://sfbay.craigslist.org/sfc/egr/d/san-francisco-zynga-space-design/6965867181.html", "address": ["\n        ", "\nZynga is pleased to offer our return to work program with Path Forward, which supports experienced professionals as they re-enter the workforce after taking time off to care for a child or family member. We welcome professionals who have been out of the workforce for at least two years, and have at least five years of experience, to apply for this position. ", "\n", "\nAt Zynga, we are excited to be part of the Path Forward program because we appreciate the skills you can offer, the perspective you provide, and the contributions you will make. This program offers you a chance to revamp your skills, update your resume with new experience, and make connections with other women and men transitioning back to the workforce. It also offers support through Path Forward, a nonprofit organization on a mission to empower people who’ve been focused on caregiving transition back to the paid workforce. Zynga’s Returnship program offers a supportive environment that helps make the on-ramp to work as smooth as possible. We provide returnees with a development program that allows them to be healthy and productive. ", "\n", "\nAs a Workplace Space and Design Planner with Zynga, Inc., you will report to the Facilities Manager at Workplace Services in managing the day-to-day space planning, furniture reconfigurations, and MAC projects. This key role will analyze space data that drive overall business decisions. ", "\n", "\nResponsibilities:", "\n", "\n-  Manage and maintain headcount and space analysis (occupancy vs. capacity) to drive business strategy", "\n-  Develop and implement efficient space plans and furniture system plans that meet the needs of the Company’s operation and satisfy all regulatory requirements", "\n-  Manage the current HQ and global space portfolio in the Archibus (CAFM) system equating to approximately 186,000 SF and 16 locations", "\n-  Manage office/cube allocation, relocation and reconfiguration projects; plans, coordinates and executes internal moves; models space designs in AutoCAD", "\n-  Establishes and communicates move processes and procedures including employee, team, IT and contractor requirements", "\n-  Oversees move management company including project planning and execution, weekly service day coordination, special requests and/or purchases", "\n-  Work with Finance and Business Units to understand headcount forecasts, as it relates to space planning", "\n-  Determine and execute short term allocation plans for the temporary utilization of space", "\n-  Determine long term space strategies; recommendations made to all levels of management", "\n-  First point of contact for space-related issues and/or requests; quickly and efficiently respond to all staff inquiries and concerns to ensure complete customer satisfaction", "\n-  Partner with stakeholders, Facilities, and business units to consult with and solicit feedback on the design of their workplaces", "\n-  Coordinate with design consultants and Facilities team for FF&E specifications", "\n-  Provide local support on design issues during design and construction, including input on relevant projected costs, coordination of programming requirements and problem solving", "\n-  Coordinate presentations to clients & senior management, including renderings, material finishes, colours, and FF&E items", "\n- Asset and furniture storage management", "\n-  Recommend, sources and procure furniture", "\n-  Oversees furniture repairs including warranty issues", "\n-  Partner with teams to ensure accurate space management database", "\n-  Oversees updates, revisions and reporting", "\n-  Review and recommend best in tools space management tools for efficiency", "\n-  Partners with vendors to coordinate cabling, painting and carpet requirements", "\n-  Interface with local business unit leadership to ensure customer satisfaction with delivery of services and provide leadership in monitoring and increasing customer satisfaction", "\n-  Work closely with a variety of vendors, consultants and service providers to ensure efficiency, competitive pricing, innovation and exemplary customer service; source new or replacement vendors", "\n-  Effectively reconciles work orders and invoices and manages to an established budget", "\n-  Assist with Ergonomic equipment", "\n", "\nQualifications & Requirements: ", "\n", "\n-  6+ years in Facility Management and space planning experience or related industry experience with demonstrated leadership ability", "\n-  Out of the workforce for 2+ years for caregiving reasons ", "\n-  Experience managing operating & capital budgets", "\n-  Space planning, programming and design capabilities, ability to read and interpret design and construction documents", "\n-  Previous experience and a proven track record leading multi-disciplinary project teams and managing change", "\n-  Proven capacity to develop interpersonal relationships with business partners to foster a culture of collaboration and be positioned as a trusted leader", "\n-  Ability to work in a team setting with a customer service focus and deep understanding of delivering world-class customer service in a dynamic, ever-changing environment; Corporate Culture Ambassador", "\nExperience with strategic space planning and execution of moves, reconfigurations, and renovations; knowledge of infrastructure and power distribution requirements and planning", "\n-  Knowledge of various furniture systems, their components, capabilities and applications", "\n-  Familiar with Internet tools and proficient in Word, Excel, Outlook, Publisher, PowerPoint", "\n-  Proficient in CAD; proficiency in other facilities/design-specific software systems an asset", "\n-  Familiarity in workplace environment optimization", "\n-  Understanding of workplace trends including knowledge of workspace strategy and furniture systems", "\n-  Experience dealing with/sourcing service contractors. Including but not limited to- quoting, bidding, negotiating, purchase request/PO process", "\n-  Proven vendor management capabilities", "\n-  Creative-thinking and problem-solving skills", "\n-  Strong organizational skills and collaborative work style", "\n-  Strong communication skills, both written and verbal", "\n ", "\nPlease apply here: ", "\n", "\n", "    "], "images": [], "type": "contract"},
{"text": "Senior DevOps Engineer", "date": "2019-08-06 13:51", "compensation": "DOE", "link": "https://sfbay.craigslist.org/sfc/sof/d/san-francisco-senior-devops-engineer/6951010656.html", "address": ["\n        ", "\nData analysis is plagued by a fundamentally flawed workflow that leads to slow turnaround times, high error rates, and fewer insights. By combining analytics tools with a collaborative user experience, Mode is alleviating the most pressing bottleneck for analytical organizations. We are looking for a DevOps web engineer to join us in revolutionizing the way the world analyzes data. This person will be an integrated part of our core engineering team.", "\n", "\nWhat you'll do:", "\nWork with the rest of our software engineers to build application services that power our core product", "\nResearch and evaluate technologies for what we build - determine priorities by estimating projects' potential impact", "\nConfiguration management", "\nExpand and improve our build and release automation process", "\nLearn from others and teach those around you", "\n", "\nWhat we look for:", "\nStrong software development background with experience in at least one scripting language", "\nYou love to automate yourself out of a job", "\nTons of experience with configuration management tools", "\nExperience with testing, continuous integration, and continuous deployment", "\nFamiliarity with security and networking a plus", "\nAlignment with Mode's values", "\n", "\nTools we use:", "\nSaltStack and AWS CloudFormation for configuration management and orchestration", "\nDocker", "\nA wide array of AWS services including EC2, RDS, DynamoDB and Redshift", "\nHoneycomb, New Relic and Wavefront for monitoring", "\nSumoLogic for log management", "\nGitHub and Concourse", "\n", "\nAbout Mode:", "\nMode is a collaborative analytics platform that brings teams together around data to make game-changing decisions.", "\n", "\nIn everything we do, we strive to put the people we do it for first. This starts internally: together we're building a culture that embraces diversity and learning, humility and gratitude. At the same time, we try not to take ourselves too seriously and strive for a healthy balance between work and personal pursuits.", "\n", "\nBenefits you can expect as a Mode employee:", "\nGenerous, flexible PTO and family leave", "\nFlexible work schedules—we trust you to know what will make yourself most productive", "\nGenerous professional development policy that includes funds earmarked for each employee's discretionary professional growth—Have a conference you want to attend? A class you want to take? If it's helping take your career to the next level, it's on us.", "\nExcellent health coverage for team members and their families (Mode pays the 100% of the premiums)", "\nSupportive work environment and a manager who is focused on your professional growth", "\nCompany events that highlight our team's passions and hobbies", "\nSnacks and in-office lunches shared at our ever-growing lunch table", "\n", "\nMode is committed to building an inclusive and diverse workforce. We are an Equal Opportunity Employer and welcome people from all backgrounds, experiences, abilities and perspectives.    "], "images": [], "type": "full-time"},
{"text": "SENIOR DRAFTERS & ARCHITECTS (Stonestown Mall)", "date": "2019-08-05 19:36", "compensation": "Competitive Salary + Commission", "link": "https://sfbay.craigslist.org/pen/egr/d/san-francisco-senior-drafters/6950460658.html", "address": ["\n        ", "\nSENIOR DRAFTERS & ARCHITECTS ", "\n", "\nAre you a senior drafter or Architect with at least 15 years of experience?  We have a great opportunity for you!  ", "\n", "\nIntroducing SKSI PLANS & PERMITS, the first national brand in Architectural plans & building permits.    ", "\n", "\nSKSI innovated a structure fusing the benefits and pride of being self-employed with security of working for a big company.  We give you the most attractive high profile office, promote you, pay competitive wages and give you commissions on customers we supply you with.  Your fully equipped high tech office will be inside the front entrance to the STONESTOWN MALL, and you will have use of any of our other offices and network of colleagues at 18+ fashion malls throughout the Southeast Region (we are quickly growing nationally).  ", "\n", "\nVideo of an SKSI location: ", "\n", "\nLOCATIONS", "\n", "\n•\tValley Plaza Mall in Bakersfield", "\n•\tOtay Ranch Town Center in Chula Vista", "\n•\tGlendale Galleria", "\n•\tThe Shoppes at Carlsbad in Carlsbad", "\n•\tGalleria at Tyler in Riverside", "\n•\tVisalia Mall in Visalia", "\n•\tSouthland Mall in Hayward", "\n•\tStonestown Mall in San Francisco", "\n•\tNorthridge Mall in Northridge", "\n•\tMeadows Mall in Las Vegas ", "\n", "\nREQUIREMENTS", "\n", "\n•\tMin 15 years’ Experience", "\n•\tDrafting of complete construction plan sets (excluding Title 24 and engineering calcs)", "\n•\tDrafting MEP's (bonus but not required)", "\n•\tResidential: Renovation, Additions, New Construction, ADUs", "\n•\tCommercial: Tenant Improvements, Additions, New Construction", "\n•\tWork with clients", "\n•\tSelling / closing new agreements ", "\n•\tDesign sessions", "\n•\tEngineering details", "\n•\tSite Inspections", "\n•\tPermit Expediting / working with building departments", "\n•\tAutoCAD / Revit / Sketchup / Chief Architect", "\n", "\nEXPECTATIONS", "\n", "\n•\tIntegrity", "\n•\tCreativity", "\n•\tCompletion", "\n•\tCompetence", "\n•\tCollaboration", "\n•\tProfessionalism", "\n", "\nCOMPENSATION", "\n", "\n•\tSalary (competitive based on experience and skill)", "\n•\tCommissions", "\n", "\nABOUT SKSI", "\n", "\nVideo about SKSI: ", "\n", "\nSKSI Plans and Permits (SKSI), the first National brand offering construction plans and permit expediting services announced nine new stores in California and Los Vegas for its innovative retail concept chain by the end of the year.", "\n", "\nSKSI Plans & Permits provides expert, fast, affordable and extremely accessible construction plans, engineering, Title 24 and permit expediting services for residential & commercial projects. SKSI helps builders, contractors, developers and property owners and managers save money and time without sacrificing quality by expediting planning and permitting for construction and property development. SKSI’s proprietary processes include the use of custom-developed software that streamlines the design and permit processes. ", "\n", "\nSKSI makes the process of creating and approving construction plans and permits extraordinary accessible and efficient for contractors, realtors and real estate investors, leasing companies and property managers, business and retail store owners, commercial landlords and homeowners. SKSI’s proprietary processes include the use of custom-developed software that streamlines the design and permit processes. ", "\n", "\nCLIENT LIST INCLUDES", "\n", "\n•\tHomeowners", "\n•\tLeasing & management companies", "\n•\tBrookfield Properties", "\n•\tWestfield Malls", "\n•\tApple Stores", "\n•\tAMC Theaters", "\n•\tBloomingdales", "\n•\tMacy’s", "\n•\tVan’s", "\n•\tStarbucks", "\n•\tVictoria’s Secret", "\n•\tGold’s Gym", "\n•\tPanda Express", "\n•\t… about 500 other top brands    "], "images": ["https://images.craigslist.org/01414_aMVU8tcrT1v_600x450.jpg", "https://images.craigslist.org/00o0o_7XGTlue7XLh_600x450.jpg", "https://images.craigslist.org/00303_a1KfF4pnRCa_600x450.jpg", "https://images.craigslist.org/00D0D_7d8ndQMf7JD_600x450.jpg", "https://images.craigslist.org/00303_gjwE28OZ3Lr_600x450.jpg", "https://images.craigslist.org/00W0W_52IsrwbYO0X_600x450.jpg"], "type": "full-time"},
{"text": "Senior Front-End Engineer", "date": "2019-08-06 13:53", "compensation": "DOE", "link": "https://sfbay.craigslist.org/sfc/sof/d/san-francisco-senior-front-end-engineer/6951012780.html", "address": ["\n        ", "\nData analysis is plagued by a fundamentally flawed workflow that leads to slow turnaround times, high error rates, and fewer insights. By combining analytics tools with a collaborative user experience Mode is alleviating the most pressing bottleneck for analytical organizations. We are looking for a front-end engineer to join us in revolutionizing the way the world analyzes data.", "\n", "\nWhat you'll do:", "\nDevelop our core web applications for data analysts and business users", "\nDefine and maintain development practices that let us move fast with quality", "\nWork with a wide range of tools and technologies (from SQL to Javascript) and be able to evaluate technologies for what we are building", "\nDetermine priorities by estimating the potential impact of projects", "\n", "\nWhat we look for:", "\nYou have built and shipped web applications", "\nExpert understanding of HTML, Javascript/Typescript, CSS and/or related technologies", "\nExperience with testing, continuous integration, and continuous deployment", "\nExperience with front-end frameworks such as angular, react, backbone, etc.", "\nAlignment with Mode's values", "\n", "\nAbout Mode:", "\nMode is a collaborative analytics platform that brings teams together around data to make game-changing decisions.", "\n", "\nIn everything we do, we strive to put the people we do it for first. This starts internally: together we're building a culture that embraces diversity and learning, humility and gratitude. At the same time, we try not to take ourselves too seriously and strive for a healthy balance between work and personal pursuits.", "\n", "\nBenefits you can expect as a Mode employee:", "\nGenerous, flexible PTO and family leave", "\nFlexible work schedules—we trust you to know what will make yourself most productive", "\nGenerous professional development policy that includes funds earmarked for each employee's discretionary professional growth—Have a conference you want to attend? A class you want to take? If it's helping take your career to the next level, it's on us.", "\nExcellent health coverage for team members and their families (Mode pays the 100% of the premiums)", "\nSupportive work environment and a manager who is focused on your professional growth", "\nCompany events that highlight our team's passions and hobbies", "\nSnacks and in-office lunches shared at our ever-growing lunch table", "\n", "\nMode is committed to building an inclusive and diverse workforce. We are an Equal Opportunity Employer and welcome people from all backgrounds, experiences, abilities and perspectives.    "], "images": [], "type": "full-time"},
{"text": "Senior DevOps Engineer - Remote", "date": "2019-08-06 14:01", "compensation": "DOE", "link": "https://sfbay.craigslist.org/sfc/sof/d/san-francisco-senior-devops-engineer/6951019056.html", "address": ["\n        ", "\nData analysis is plagued by a fundamentally flawed workflow that leads to slow turnaround times, high error rates, and fewer insights. By combining analytics tools with a collaborative user experience, Mode is alleviating the most pressing bottleneck for analytical organizations. We are looking for a DevOps web engineer to join us in revolutionizing the way the world analyzes data. This person will be an integrated part of our core engineering team.", "\n", "\nWhat you'll do:", "\nWork with the rest of our software engineers to build application services that power our core product", "\nResearch and evaluate technologies for what we build - determine priorities by estimating projects' potential impact", "\nConfiguration management", "\nExpand and improve our build and release automation process", "\nLearn from others and teach those around you", "\n", "\nWhat we look for:", "\nStrong software development background with experience in at least one scripting language", "\nYou love to automate yourself out of a job", "\nTons of experience with configuration management tools", "\nExperience with testing, continuous integration, and continuous deployment", "\nFamiliarity with security and networking a plus", "\nAlignment with Mode's values", "\n", "\nTools we use:", "\nSaltStack and AWS CloudFormation for configuration management and orchestration", "\nDocker", "\nA wide array of AWS services including EC2, RDS, DynamoDB and Redshift", "\nHoneycomb, New Relic and Wavefront for monitoring", "\nSumoLogic for log management", "\nGitHub and Concourse", "\n", "\nAbout Mode:", "\nMode is a collaborative analytics platform that brings teams together around data to make game-changing decisions.", "\n", "\nIn everything we do, we strive to put the people we do it for first. This starts internally: together we're building a culture that embraces diversity and learning, humility and gratitude. At the same time, we try not to take ourselves too seriously and strive for a healthy balance between work and personal pursuits.", "\n", "\nBenefits you can expect as a Mode employee:", "\nGenerous, flexible PTO and family leave", "\nFlexible work schedules—we trust you to know what will make yourself most productive", "\nGenerous professional development policy that includes funds earmarked for each employee's discretionary professional growth—Have a conference you want to attend? A class you want to take? If it's helping take your career to the next level, it's on us.", "\nExcellent health coverage for team members and their families (Mode pays the 100% of the premiums)", "\nSupportive work environment and a manager who is focused on your professional growth", "\nCompany events that highlight our team's passions and hobbies", "\nSnacks and in-office lunches shared at our ever-growing lunch table", "\n", "\nMode is committed to building an inclusive and diverse workforce. We are an Equal Opportunity Employer and welcome people from all backgrounds, experiences, abilities and perspectives.    "], "images": [], "type": "full-time"},
{"text": "PROJECT DESIGNER (RESIDENTIAL INTERIOR DESIGN)", "date": "2019-08-19 13:34", "compensation": "DOE", "link": "https://sfbay.craigslist.org/sfc/med/d/san-francisco-project-designer/6960202597.html", "address": ["\n        ", "\nPROJECT DESIGNER", "\n", "\nThe Project Designer position is available at a mid-size San Francisco residential and commercial interior design firm.  ", "\n", "\nThe ideal candidate will have a minimum of three years of experience in the architecture and design industry, focusing on high-end residential design. ", "\n", "\nRESPONSIBILITIES AND ESSENTIAL JOB FUNCTIONS INCLUDE BUT ARE NOT LIMITED TO THE FOLLOWING:   ", "\n", "\n•\tResearch and analysis: Research and analysis of the client's goals and requirements; development of documents, drawings and diagrams that outline those needs. Ability to interact effectively with the design team on multiple projects.", "\n•\tPlanning: Formulate preliminary space plans and two- and three-dimensional design concept studies and sketches that integrate the client's needs and are based on knowledge of the principles of interior design and theories of human behavior. ", "\n•\tOversee: Oversee the implementation of interior design solutions for each project from concept stage through installation. ", "\n•\tConfirmation: Confirm that preliminary space plans and design concepts are safe, functional, aesthetically appropriate, and meet all public health, safety and welfare requirements. ", "\n•\tSelection: Select colors, materials and finishes to appropriately convey the design concept, functional, life-cycle performance, environmental, and safety requirement.", "\n•\tManagement: Manage the interior design resource library and maintain vendor contacts for interior furnishings, fixtures and finishes.   ", "\n•\tFurniture and Fixtures: Select and specify furniture, fixtures, equipment and millwork, including layout drawings and detailed product description; and provision of contract documentation to facilitate pricing, procurement and installation of furniture.", "\n•\tSpecifications and Schedules: Prepare specifications and schedules with accurate product information for all furniture, plumbing, appliances, lighting and finishes. ", "\n•\tConstruction Documents: Prepare construction documents, consisting of plans, elevations, details and specifications, to illustrate non-structural and/or non-seismic partition layouts; power and communications locations; reflected ceiling plans and lighting designs; materials and finishes; and furniture layouts. Ability to field measure and document building condition.", "\n•\tRegulations: Preparation of construction documents to adhere to regional building and fire codes, municipal codes, and any other jurisdictional statutes, regulations and guidelines applicable to the interior space. ", "\n•\tCoordination: Coordination and collaboration with other design professionals who may be retained to provide consulting services, including but not limited to architects; structural, mechanical and electrical engineers, and various specialty consultants.", "\n•\tObservation and Reporting: Observation and reporting on the implementation of projects and punch list items while in progress and upon completion, as a representative of and on behalf of the client.", "\n•\tAdministration: Prepare project proposals, costs, and fee analysis; review project billing.", "\n", "\nSKILLS", "\n", "\n•\tDegree in Interior Design ", "\n•\tMinimum of 3 years interior design experience", "\n•\tExcellent presentation skills, including space planning and drawing", "\n•\tProficiency in AutoCAD, AutoCAD LT ", "\n•\tAbility to create a set of construction drawings, specifications and schedule", "\n•\tAbility to create and manage Excel spreadsheets", "\n•\tKnowledge of Adobe Illustrator, InDesign and Photoshop", "\n•\tKnowledge of and/or ability to learn time-keeping and billing software", "\n•\tExperience selecting and specifying lighting, furnishings, hardware, floor/window coverings, materials, and finishes.", "\n•\tAbility to interact effectively with the design team on multiple projects", "\n•\tExperience with purchasing and budgets ", "\n•\tKnowledge of trade resources and vendors", "\n", "\nCORE COMPETENCIES", "\n", "\n•\tTask Focus: Delivers legendary service to clients and vendors that meets and exceeds expectations.", "\n•\tEthics & Integrity: Adheres to NHID values, beliefs, and principles of innovation and excellence in design. ", "\n•\tComposure: Remains calm, maintains perspective, and responds in a professional manner when faced with tough situations.  ", "\n•\tPersonal Learning: Takes personal responsibility for the continuous learning of new knowledge, skills, and experiences. ", "\n•\tDealing with Ambiguity: Able to successfully function during times of uncertainty and changing priorities.", "\n•\tDecision-Making: Makes keen, timely decisions based on a mixture of analysis, wisdom, experience and judgment.   ", "\n•\tInterpersonal Savvy: Builds effective relationships with all people--up, down and sideways, inside and outside of NHID.", "\n•\tResults Oriented: Gets results and achieves goals.", "\n", "\nThis position is full time, permanent, and with full medical, dental, life, vision, and commuter benefits.  ", "\n", "\nTo apply for this position, reply back with your resume, portfolio, and professional references. Phone calls or walk-in applications will not be accepted.", "\n    "], "images": [], "type": "full-time"},
{"text": "Junior Product Manager", "date": "2019-08-26 11:21", "compensation": "TBD", "link": "https://sfbay.craigslist.org/sfc/web/d/san-francisco-junior-product-manager/6965117062.html", "address": ["\n        ", "\n", ":  ", "\n", "\nWorking with the VP of Business Development, the Junior Product Manager will help define the user experience, monitor product use and performance, author detailed specifications and requirements, and ensure that the delivered product meets the business goals for CollegeData, 1st Financial Bank USA’s affiliate site.", "\n ", "\nThis position requires being proficient in the tools of product management and a deep working knowledge of user experience, interaction design, web technology, user acquisition, mobile applications, and online marketing, including Search Engine Optimization (SEO). This needs to be coupled with proficient web skills and the ability to connect the design of the site to the business goals of the site.", "\n ", "\nThe individual hired will also incorporate product solutions and strategy, ensuring that their product road map supports CollegeData’s business goals and overall marketing strategy.", "\n ", "\nThis position will have a significant impact on the future success of CollegeData, developing new site features and discovering ways to enhance the existing tools on the site to provide our users with an exceptional college planning resource.", "\n", "\n", ":", "\n", "\n•\tReport to and work with VP of Business Development to define product vision and product road map that supports CollegeData’s design, marketing, and overall goals", "\n•\tUnder the supervision of the VP of Business Development, conduct requirements gathering and create project documentation (project charters with clear outlined scope, detailed requirements, use cases, user flows and reporting). ", "\n•\tServe as IT’s link to the business, acting as the subject matter expert for the functional operation of CollegeData’s software applications and business processes ", "\n•\tWork closely with internal project managers and engineers to execute the product road map ", "\n•\tProvide functional guidance to engineers to resolve issues ", "\n•\tLeverage web analytics, visitor analytics, and customer data analytics to develop an understanding of user behavior and to recommend strategies that will help the site achieve its business goals ", "\n•\tDefine success metrics for projects, ensuring that relevant data is collected in analytics ", "\n•\tCreate page wireframes to explore multiple user experience options ", "\n•\tWork closely with CollegeData’s content creators, user interface design, engineers, and quality assurance to ensure that projects achieve the desired business goals ", "\n•\tPrioritize product enhancements and triage bugs ", "\n•\tWork with CollegeData’s UI/Visual designers, providing support, prioritizing design tasks, and reviewing work progress ", "\n•\tComplete user acceptance testing of new features and enhancements  ", "\n", "\n", ":", "\n", "\n", ": Bachelor’s degree in computer science or equivalent experience", "\n ", "\n", ":", "\no\tMinimum of 2-4 years product management experience with consumer facing websites, with a focus on content-rich, data-driven web applications and mobile applications", "\no\tAbility to create a clean user experience from complex requirements", "\no\tFamiliarity with new and emerging website design approaches ", "\no\tStrong desire to leverage data and analytics to achieve business goals", "\no\tSuperior written and oral communication skills ", "\no\tTechnical aptitude and ability to collaborate with a development team", "\no\tAbility to create wireframes and mockups", "\no\tDemonstrated experience working with the full product development life cycle", "\n ", "\n", ":", "\no\tFamiliarity with website infrastructure ", "\no\tFamiliarity with best practices in Search Engine Optimization (SEO)", "\no\tExperience extending website functionality by integrating with Facebook, Instagram, Twitter and other social networks and third party APIs ", "\no\tExperience with email marketing and online advertising networks ", "\no\tHTML and CSS coding experience ", "\n", "\n", ":", "\no\tExceptional problem-solving skill and ability to effectively collaborate with cross-functional global teams ", "\no\tDemonstrated experience collaborating closely with content creators, marketers, UI designers, engineers, database administrators and quality assurance personnel ", "\no\tAbility to identify, analyze and clarify multiple options for new product development ", "\no\tAbility to meet project deadlines and commitments", "\no\tA strong desire to work with, and be a reliable member of a small team, wearing multiple hats to get things done ", "\no\tComfortable building knowledge in areas beyond current area of expertise", "\no\tExcellent presentation and communication skills. ", "\no\tExperience working with or developing web applications for college bound high school students ", "\no\tKnowledge of college planning, admission and financial aid from professional experience", "\n", "\n", "\n", "\nWe provide a highly competitive and comprehensive compensation and benefits program including affordable medical/dental/vision insurance, generous paid leave program, 401(k), health savings account, tuition reimbursement, financial childcare assistance and much more!", "\n", "\n1fb.net inc is an EO employer - M / F / Vets / Disabled.", "\n    "], "images": [], "type": "full-time"},
{"text": "Front-End Engineer", "date": "2019-08-06 13:58", "compensation": "DOE", "link": "https://sfbay.craigslist.org/sfc/sof/d/san-francisco-front-end-engineer/6951016456.html", "address": ["\n        ", "\nMode is changing how organizations make decisions by equipping every single person with the power to collaborate on analytics and share insights at the pace of work today. We're building the most advanced web-based environment for creating, sharing, and discussing ad-hoc analysis using a variety of technologies. We have a rapidly expanding list of happy customers who love our product and we're growing to serve even more.", "\n", "\nAs a Front-End Engineer on Mode's Engineering team, you'll work closely with other Engineers, PM's, and Designers to build impactful applications with thoughtfully designed user interfaces that will help analysts get the most of Mode. ", "\n", "\nWhat you'll do:", "\nCollaborate with a small cross-functional team of Engineers, Product Managers, and Designers to build, test, and ship new user facing code", "\nDevelop our core web applications for data analysts and business users", "\nDefine and maintain development practices that let us move fast with quality", "\nWork with a wide range of tools and technologies (from Ruby to TypeScript) and be able to evaluate technologies for what we are building", "\n", "\nWhat we look for:", "\nWorking knowledge of HTML, Javascript/TypeScript, CSS/SASS and/or related technologies", "\nExperience with building customer facing web applications", "\nExperience with testing, continuous integration, and continuous deployment", "\nExperience with front-end frameworks such as Angular, React, VueJS, etc.", "\nAlignment with Mode's values", "\n", "\nAbout Mode:", "\nMode is a collaborative analytics platform that brings teams together around data to make game-changing decisions.", "\n", "\nIn everything we do, we strive to put the people we do it for first. This starts internally: together we're building a culture that embraces diversity and learning, humility and gratitude. At the same time, we try not to take ourselves too seriously and strive for a healthy balance between work and personal pursuits.", "\n", "\nBenefits you can expect as a Mode employee:", "\nGenerous, flexible PTO and family leave", "\nFlexible work schedules—we trust you to know what will make yourself most productive", "\nGenerous professional development policy that includes funds earmarked for each employee's discretionary professional growth—Have a conference you want to attend? A class you want to take? If it's helping take your career to the next level, it's on us.", "\nExcellent health coverage for team members and their families (Mode pays the 100% of the premiums)", "\nSupportive work environment and a manager who is focused on your professional growth", "\nCompany events that highlight our team's passions and hobbies", "\nSnacks and in-office lunches shared at our ever-growing lunch table", "\n", "\nMode is committed to building an inclusive and diverse workforce. We are an Equal Opportunity Employer and welcome people from all backgrounds, experiences, abilities and perspectives.    "], "images": [], "type": "full-time"},
{"text": "Junior Product Manager", "date": "2019-08-26 11:21", "compensation": "TBD", "link": "https://sfbay.craigslist.org/sfc/edu/d/san-francisco-junior-product-manager/6965117058.html", "address": ["\n        ", "\n", ":  ", "\n", "\nWorking with the VP of Business Development, the Junior Product Manager will help define the user experience, monitor product use and performance, author detailed specifications and requirements, and ensure that the delivered product meets the business goals for CollegeData, 1st Financial Bank USA’s affiliate site.", "\n ", "\nThis position requires being proficient in the tools of product management and a deep working knowledge of user experience, interaction design, web technology, user acquisition, mobile applications, and online marketing, including Search Engine Optimization (SEO). This needs to be coupled with proficient web skills and the ability to connect the design of the site to the business goals of the site.", "\n ", "\nThe individual hired will also incorporate product solutions and strategy, ensuring that their product road map supports CollegeData’s business goals and overall marketing strategy.", "\n ", "\nThis position will have a significant impact on the future success of CollegeData, developing new site features and discovering ways to enhance the existing tools on the site to provide our users with an exceptional college planning resource.", "\n", "\n", ":", "\n", "\n•\tReport to and work with VP of Business Development to define product vision and product road map that supports CollegeData’s design, marketing, and overall goals", "\n•\tUnder the supervision of the VP of Business Development, conduct requirements gathering and create project documentation (project charters with clear outlined scope, detailed requirements, use cases, user flows and reporting). ", "\n•\tServe as IT’s link to the business, acting as the subject matter expert for the functional operation of CollegeData’s software applications and business processes ", "\n•\tWork closely with internal project managers and engineers to execute the product road map ", "\n•\tProvide functional guidance to engineers to resolve issues ", "\n•\tLeverage web analytics, visitor analytics, and customer data analytics to develop an understanding of user behavior and to recommend strategies that will help the site achieve its business goals ", "\n•\tDefine success metrics for projects, ensuring that relevant data is collected in analytics ", "\n•\tCreate page wireframes to explore multiple user experience options ", "\n•\tWork closely with CollegeData’s content creators, user interface design, engineers, and quality assurance to ensure that projects achieve the desired business goals ", "\n•\tPrioritize product enhancements and triage bugs ", "\n•\tWork with CollegeData’s UI/Visual designers, providing support, prioritizing design tasks, and reviewing work progress ", "\n•\tComplete user acceptance testing of new features and enhancements  ", "\n", "\n", ":", "\n", "\n", ": Bachelor’s degree in computer science or equivalent experience", "\n ", "\n", ":", "\no\tMinimum of 2-4 years product management experience with consumer facing websites, with a focus on content-rich, data-driven web applications and mobile applications", "\no\tAbility to create a clean user experience from complex requirements", "\no\tFamiliarity with new and emerging website design approaches ", "\no\tStrong desire to leverage data and analytics to achieve business goals", "\no\tSuperior written and oral communication skills ", "\no\tTechnical aptitude and ability to collaborate with a development team", "\no\tAbility to create wireframes and mockups", "\no\tDemonstrated experience working with the full product development life cycle", "\n ", "\n", ":", "\no\tFamiliarity with website infrastructure ", "\no\tFamiliarity with best practices in Search Engine Optimization (SEO)", "\no\tExperience extending website functionality by integrating with Facebook, Instagram, Twitter and other social networks and third party APIs ", "\no\tExperience with email marketing and online advertising networks ", "\no\tHTML and CSS coding experience ", "\n", "\n", ":", "\no\tExceptional problem-solving skill and ability to effectively collaborate with cross-functional global teams ", "\no\tDemonstrated experience collaborating closely with content creators, marketers, UI designers, engineers, database administrators and quality assurance personnel ", "\no\tAbility to identify, analyze and clarify multiple options for new product development ", "\no\tAbility to meet project deadlines and commitments", "\no\tA strong desire to work with, and be a reliable member of a small team, wearing multiple hats to get things done ", "\no\tComfortable building knowledge in areas beyond current area of expertise", "\no\tExcellent presentation and communication skills. ", "\no\tExperience working with or developing web applications for college bound high school students ", "\no\tKnowledge of college planning, admission and financial aid from professional experience", "\n", "\n", "\n", "\nWe provide a highly competitive and comprehensive compensation and benefits program including affordable medical/dental/vision insurance, generous paid leave program, 401(k), health savings account, tuition reimbursement, financial childcare assistance and much more!", "\n", "\n1fb.net inc is an EO employer - M / F / Vets / Disabled.", "\n    "], "images": [], "type": "full-time"},
{"text": "Lead Full Stack Engineer", "date": "2019-08-13 16:06", "compensation": "very lucrative compensation package", "link": "https://sfbay.craigslist.org/sfc/sof/d/san-francisco-lead-full-stack-engineer/6956092397.html", "address": ["\n        ", "\n", "    "], "images": [], "type": "full-time"},
{"text": "Philanthropy Manager for NonProfit Leading Economic Justice Work!", "date": "2019-08-27 11:31", "compensation": "70,000 - 75,000", "link": "https://sfbay.craigslist.org/sfc/wri/d/san-francisco-philanthropy-manager-for/6965886094.html", "address": ["\n        ", "\nDo you love to convince people to take action and leverage resources for the greater good? Do you love to tell a good story? Are you amazingly talented at keeping track of all kinds of tiny details? Do you want to be challenged, learn a ton of skills, be on the cutting edge of economic justice work, have a good laugh, brainstorm a lot, get frustrated sometimes but inspired frequently, and be on the right side of history?", "\n", "\nMAF is looking for a Philanthropy Manager who wants an opportunity to learn and develop within an organization that has a great reputation and leads with big ideas. The Manager will be joining a thriving Fundraising Team, handling important details necessary to a well-functioning department. You’ll bring analytic and project management skills to round out a dynamic team dedicated to philanthropy who are skilled writers and communicators including our CEO, Engagement Manager, Development Coordinator, and grant writer. MAF intends to invest in the professional development of this position so that they can grow and develop, gaining increasing levels of responsibility and opportunity over time.", "\n", "\n", "\nOur story: In this political climate, the need to pivot quickly and be responsive to the needs of low-income and immigrant communities is crucial. This fall, MAF’s Fundraising team took on a big, hairy, audacious goal: quickly fundraise to help Dreamers in the wake of the presidential administration’s attempt to end the program. And that we did. We raised over $4M in 24 days - doubling the amount of our operating budget. It was nothing short of amazing. It meant bringing on brand new exciting funders, people thrilled about our work and our mission, and lots of opportunity and growth. ", "\n", "\nMission Asset Fund (MAF) is a groundbreaking non-profit on a mission to create a fair financial marketplace for hardworking families. We’re a recognized nationwide leader in developing innovative and successful asset-building strategies. A hybrid between a tech start-up and a nonprofit, MAF is a great place to work for both nonprofit or for-profit professionals who are interested in tech for social good.", "\n", "\nAs MAF grows, we need a passionate Philanthropy Manager who can work with our team to shape the future of our organization. This is a great opportunity for someone who wants not just a job, but also an opportunity to build the financial power in communities of color and be part of a community and culture that is committed to social good. ", "\n", "\nAn awesome place to work: We’re right in the middle of the Mission District in San Francisco, it’s awesome here, with diverse restaurants, bars, and shops. We’ve got great team outings (fighting zombies, putt-putt and bowling to name a few). And the team is ridiculously dedicated to the mission and fun to work with. Plus, you’ll get to hobnob with a certified MacArthur Genius and learn from him every day. (It also helps that we have the best snacks.) We have a super beautiful office setting, with lots of bright colors and natural light. As a nonprofit and tech startup, we attract people who like to jump in with both feet and who aren’t afraid of learning how to do better. With an open office environment, collaboration and teamwork are more than just values - they’re a way of life. Hailing from many different cultural and professional backgrounds, we are drawn together by a passion for embracing technology and creativity to make the world a better place for hardworking families.", "\n", "\nReports to: Chief Development Officer", "\n----", "\n", "\nESSENTIAL RESPONSIBILITIES", "\n", "\nFundraising Support (75%):", "\n", "\nResearch, identify and apply for grant opportunities. Develop, prepare, and edit grant proposals for foundations, corporations, and government grants.", "\nDevelop, prepare, and edit grant reports for foundations and corporations.", "\nServe as a liaison to all funding agencies, partner organizations and individuals donors, and other key stakeholders as needed.", "\nProvide support for fundraising efforts, donor communications, track deadlines, and special events related to the organization’s fundraising plan.", "\nResponsible for the integrity of systems and data, including acknowledgment of gifts, donor data tracking, reviewing dashboards, grant reporting, and all record-keeping, are maintained in an accurate and timely way and proactively make improvements to systems and infrastructure", "\nCollaborate with a first-rate grant writer to ensure on-time submission of letters of inquiry, grant proposals, and reports to foundations, corporations, and government supporters", "\nSupport the team to manage an active portfolio of government, corporate donors, private and family foundations and prospects and prepare and run accurate, monthly fundraising reports to track progress towards goals", "\nBe the center of our philanthropy department and work as a cross-functional superhero within the organization", "\nEngage key constituents as ambassadors for the organization, including chairing a volunteer advisory council", "\n", "\nCommunications Support (20%):", "\n", "\nMaintain & develop the funder communications plan, website, social media, marketing materials, and other fundraising tools.", "\nExecute communication strategies for developing and/or strengthening relationships with donors including annual reports (including working with a team of volunteer software engineers, drafting content, etc.)", "\nWrite blog posts and other written pieces for print or website, and provide feedback on others’ writing to help them improve.", "\nHelp consistently capture and share lessons learned.", "\nHelp organize occasional special events, including helping to manage logistics, communications, sponsors", "\nGeneral Operations (5%)", "\n", "\nCollaborate with staff in making strategic decisions affecting MAF’s future", "\nEngage in professional development opportunities, participating in trainings and conferences provided to staff", "\nParticipate in staff meetings, attend events, and otherwise contribute to strengthening the roots within our community", "\n----", "\n", "\nYou’ll thrive in this role if:", "\n", "\nPassionate about the role that data and outcomes can play in fueling social change", "\nA detail-oriented problem solver who enjoys an entrepreneurial environment", "\nLove of creating and managing systems and knows how to move a complex project forward", "\nTalented when it comes to writing and telling stories", "\nPassionate about economic/social justice issues", "\nCommitted to our values of respect, meeting people where they are, and building on what they have", "\nHave an eye for creating efficiencies and keeping track of details", "\nAbility to develop trusting relationships with diverse individuals from many different backgrounds", "\nFlexible and adaptable (constantly learning new things)", "\nAble to work some evenings and weekends", "\nHave a B.A. or equivalent experience and/or 2-5 years experience in nonprofit fundraising or other relevant experience (for example, sales, project or program management, program evaluation, business development or analytical background)", "\nComfort with computers and a variety of online platforms including comfort using CRM/donor databases (Salesforce, Google Drive, Excel, PowerPoint, Word)", "\nProficiency in Spanish is a plus", "\n-----", "\n", "\nCOMPENSATION AND BENEFITS", "\nThis is a full-time position with an anticipated salary range of $70,000-75,000. Salary & title will be dependent on experience.", "\nWe believe in work-life balance and are committed to keeping the workload in alignment with this value.", "\nWe provide 20 days of Paid Time Off (160 hours)/year accrued for the first two years of full-time employment, 13 paid holidays, and a flexible, family-friendly schedule.", "\nWe provide generous medical (HMO and PPO options), dental, vision, disability, life, flexible spending account, and AD&D insurance.", "\nWe care about your financial future. We provide a matching 401K plan that is immediately vested. We will match up to 4% of your compensation/year.", "\nCommuter benefits & flexible savings accounts: pre-tax benefit accounts used to pay for expenses like healthcare or commuter expenses like parking, vanpool, public transit—including train, subway, bus, and ferry.", "\n----", "\n", "\nOUR HIRING PROCESS & TIMELINE:", "\nWe will read your cover letter first; it’s important for us to understand whether this is the right fit for you. In your cover letter, please be sure to tell us why you are interested in this job, what you like about MAF, and share examples of past work you’ve done that makes you a strong candidate. This position doesn’t require a ton of fundraising experience, so we do not expect you to have a ton, but some helps; feel free to share examples of work done in school or as a volunteer if that makes more sense.", "\nWe will review applications on a rolling basis until the position is filled.", "\nWe will begin scheduling phone interviews in late August.", "\nWe will begin in-person one-hour interviews in late August/early September. If you are invited for an in-person interview, we will ask for 1-2 work samples relevant to this position, e.g. a process you created, a writing sample, or other relevant materials.", "\nFinalists will be invited to a second-round one-hour interview, and we will make an offer shortly thereafter.", "\nWe would like to have the selected candidate start as soon as possible - starting in September. ", "\nEqual Opportunity Employment: Mission Asset Fund is an equal opportunity employer; people of color and individuals from diverse backgrounds are encouraged to apply. Mission Asset Fund does not discriminate on the basis of race, color, national origin, ethnic background, religion, sex, sexual orientation, age, or disability.", "\n", "\nSan Francisco Fair Chance Ordinance: Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.", "\n", "\nDeadline: Applications are processed on a rolling basis. The position will remain open until filled.", "\n", "\nYou must apply through our website: ", "\n", "\nNo phone calls.", "\nRecruiters, please don't contact this job poster.", "\nDo NOT contact us with unsolicited services or offers.    "], "images": [], "type": "full-time"},
{"text": "Philanthropy Manager for NonProfit Leading Economic Justice Work!", "date": "2019-08-27 11:31", "compensation": "70,000 - 75,000", "link": "https://sfbay.craigslist.org/sfc/npo/d/san-francisco-philanthropy-manager-for/6965886093.html", "address": ["\n        ", "\nDo you love to convince people to take action and leverage resources for the greater good? Do you love to tell a good story? Are you amazingly talented at keeping track of all kinds of tiny details? Do you want to be challenged, learn a ton of skills, be on the cutting edge of economic justice work, have a good laugh, brainstorm a lot, get frustrated sometimes but inspired frequently, and be on the right side of history?", "\n", "\nMAF is looking for a Philanthropy Manager who wants an opportunity to learn and develop within an organization that has a great reputation and leads with big ideas. The Manager will be joining a thriving Fundraising Team, handling important details necessary to a well-functioning department. You’ll bring analytic and project management skills to round out a dynamic team dedicated to philanthropy who are skilled writers and communicators including our CEO, Engagement Manager, Development Coordinator, and grant writer. MAF intends to invest in the professional development of this position so that they can grow and develop, gaining increasing levels of responsibility and opportunity over time.", "\n", "\n", "\nOur story: In this political climate, the need to pivot quickly and be responsive to the needs of low-income and immigrant communities is crucial. This fall, MAF’s Fundraising team took on a big, hairy, audacious goal: quickly fundraise to help Dreamers in the wake of the presidential administration’s attempt to end the program. And that we did. We raised over $4M in 24 days - doubling the amount of our operating budget. It was nothing short of amazing. It meant bringing on brand new exciting funders, people thrilled about our work and our mission, and lots of opportunity and growth. ", "\n", "\nMission Asset Fund (MAF) is a groundbreaking non-profit on a mission to create a fair financial marketplace for hardworking families. We’re a recognized nationwide leader in developing innovative and successful asset-building strategies. A hybrid between a tech start-up and a nonprofit, MAF is a great place to work for both nonprofit or for-profit professionals who are interested in tech for social good.", "\n", "\nAs MAF grows, we need a passionate Philanthropy Manager who can work with our team to shape the future of our organization. This is a great opportunity for someone who wants not just a job, but also an opportunity to build the financial power in communities of color and be part of a community and culture that is committed to social good. ", "\n", "\nAn awesome place to work: We’re right in the middle of the Mission District in San Francisco, it’s awesome here, with diverse restaurants, bars, and shops. We’ve got great team outings (fighting zombies, putt-putt and bowling to name a few). And the team is ridiculously dedicated to the mission and fun to work with. Plus, you’ll get to hobnob with a certified MacArthur Genius and learn from him every day. (It also helps that we have the best snacks.) We have a super beautiful office setting, with lots of bright colors and natural light. As a nonprofit and tech startup, we attract people who like to jump in with both feet and who aren’t afraid of learning how to do better. With an open office environment, collaboration and teamwork are more than just values - they’re a way of life. Hailing from many different cultural and professional backgrounds, we are drawn together by a passion for embracing technology and creativity to make the world a better place for hardworking families.", "\n", "\nReports to: Chief Development Officer", "\n----", "\n", "\nESSENTIAL RESPONSIBILITIES", "\n", "\nFundraising Support (75%):", "\n", "\nResearch, identify and apply for grant opportunities. Develop, prepare, and edit grant proposals for foundations, corporations, and government grants.", "\nDevelop, prepare, and edit grant reports for foundations and corporations.", "\nServe as a liaison to all funding agencies, partner organizations and individuals donors, and other key stakeholders as needed.", "\nProvide support for fundraising efforts, donor communications, track deadlines, and special events related to the organization’s fundraising plan.", "\nResponsible for the integrity of systems and data, including acknowledgment of gifts, donor data tracking, reviewing dashboards, grant reporting, and all record-keeping, are maintained in an accurate and timely way and proactively make improvements to systems and infrastructure", "\nCollaborate with a first-rate grant writer to ensure on-time submission of letters of inquiry, grant proposals, and reports to foundations, corporations, and government supporters", "\nSupport the team to manage an active portfolio of government, corporate donors, private and family foundations and prospects and prepare and run accurate, monthly fundraising reports to track progress towards goals", "\nBe the center of our philanthropy department and work as a cross-functional superhero within the organization", "\nEngage key constituents as ambassadors for the organization, including chairing a volunteer advisory council", "\n", "\nCommunications Support (20%):", "\n", "\nMaintain & develop the funder communications plan, website, social media, marketing materials, and other fundraising tools.", "\nExecute communication strategies for developing and/or strengthening relationships with donors including annual reports (including working with a team of volunteer software engineers, drafting content, etc.)", "\nWrite blog posts and other written pieces for print or website, and provide feedback on others’ writing to help them improve.", "\nHelp consistently capture and share lessons learned.", "\nHelp organize occasional special events, including helping to manage logistics, communications, sponsors", "\nGeneral Operations (5%)", "\n", "\nCollaborate with staff in making strategic decisions affecting MAF’s future", "\nEngage in professional development opportunities, participating in trainings and conferences provided to staff", "\nParticipate in staff meetings, attend events, and otherwise contribute to strengthening the roots within our community", "\n----", "\n", "\nYou’ll thrive in this role if:", "\n", "\nPassionate about the role that data and outcomes can play in fueling social change", "\nA detail-oriented problem solver who enjoys an entrepreneurial environment", "\nLove of creating and managing systems and knows how to move a complex project forward", "\nTalented when it comes to writing and telling stories", "\nPassionate about economic/social justice issues", "\nCommitted to our values of respect, meeting people where they are, and building on what they have", "\nHave an eye for creating efficiencies and keeping track of details", "\nAbility to develop trusting relationships with diverse individuals from many different backgrounds", "\nFlexible and adaptable (constantly learning new things)", "\nAble to work some evenings and weekends", "\nHave a B.A. or equivalent experience and/or 2-5 years experience in nonprofit fundraising or other relevant experience (for example, sales, project or program management, program evaluation, business development or analytical background)", "\nComfort with computers and a variety of online platforms including comfort using CRM/donor databases (Salesforce, Google Drive, Excel, PowerPoint, Word)", "\nProficiency in Spanish is a plus", "\n-----", "\n", "\nCOMPENSATION AND BENEFITS", "\nThis is a full-time position with an anticipated salary range of $70,000-75,000. Salary & title will be dependent on experience.", "\nWe believe in work-life balance and are committed to keeping the workload in alignment with this value.", "\nWe provide 20 days of Paid Time Off (160 hours)/year accrued for the first two years of full-time employment, 13 paid holidays, and a flexible, family-friendly schedule.", "\nWe provide generous medical (HMO and PPO options), dental, vision, disability, life, flexible spending account, and AD&D insurance.", "\nWe care about your financial future. We provide a matching 401K plan that is immediately vested. We will match up to 4% of your compensation/year.", "\nCommuter benefits & flexible savings accounts: pre-tax benefit accounts used to pay for expenses like healthcare or commuter expenses like parking, vanpool, public transit—including train, subway, bus, and ferry.", "\n----", "\n", "\nOUR HIRING PROCESS & TIMELINE:", "\nWe will read your cover letter first; it’s important for us to understand whether this is the right fit for you. In your cover letter, please be sure to tell us why you are interested in this job, what you like about MAF, and share examples of past work you’ve done that makes you a strong candidate. This position doesn’t require a ton of fundraising experience, so we do not expect you to have a ton, but some helps; feel free to share examples of work done in school or as a volunteer if that makes more sense.", "\nWe will review applications on a rolling basis until the position is filled.", "\nWe will begin scheduling phone interviews in late August.", "\nWe will begin in-person one-hour interviews in late August/early September. If you are invited for an in-person interview, we will ask for 1-2 work samples relevant to this position, e.g. a process you created, a writing sample, or other relevant materials.", "\nFinalists will be invited to a second-round one-hour interview, and we will make an offer shortly thereafter.", "\nWe would like to have the selected candidate start as soon as possible - starting in September. ", "\nEqual Opportunity Employment: Mission Asset Fund is an equal opportunity employer; people of color and individuals from diverse backgrounds are encouraged to apply. Mission Asset Fund does not discriminate on the basis of race, color, national origin, ethnic background, religion, sex, sexual orientation, age, or disability.", "\n", "\nSan Francisco Fair Chance Ordinance: Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.", "\n", "\nDeadline: Applications are processed on a rolling basis. The position will remain open until filled.", "\n", "\nYou must apply through our website: ", "\n", "\nNo phone calls.", "\nRecruiters, please don't contact this job poster.", "\nDo NOT contact us with unsolicited services or offers.    "], "images": [], "type": "full-time"},
{"text": "Office Assistant & Residential Design Architect", "date": "2019-08-27 11:50", "compensation": "Salary will commensurate with experience", "link": "https://sfbay.craigslist.org/sfc/egr/d/san-francisco-office-assistant/6965902925.html", "address": ["\n        ", "\nBecome a part of our dynamic and growing firm conveniently located in SOMA District (one block from Civic Center BART Station). We provide a full range of architectural design and structural engineering services throughout the SF Bay Area with emphasis on new residential buildings and alterations and seismic upgrades of existing structures. We also participate in architectural design for well-rounded industry knowledge, construction management, and real estate development.  ", "\n", "\nThe firm is seeking full time Office Assistant. The ideal candidate must be eager and open to learn a variety of new skills", "\n", "\n• Assist the President with project management software, employee benefit plans and human resources", "\n• Perform clerical duties, such as filing, scanning, and data entry, light errands", "\n• Monitor office supplies and maintenance and cleaning", "\n• Learn minor design work on AutoCad software", "\n• Assist in property management duties", "\n", "\nQualifications:", "\n• Proficiency in typing and internet research,  MS Office (ideally Excel and Word), BillQuick software and AutoCAD a plus", "\n• Excellent written and verbal communication skills", "\n• Detail-oriented with superb organizational skills", "\n• Ability to multi-task efficiently", "\n• Sense of urgency, punctual and reliable", "\n", "\nThe firm is seeking experienced or licensed architect to lead our architectural department:", "\n", "\n* BS in architecture from an accredited university ", "\n•\tPrefer California licensed architect, or 5+ years of residential design experience in the SF Bay Area with particular knowledge with SFBC (San Francisco Planning codes and residential design guidelines), CBC and IBC", "\n•\tVersatile in AutoCAD, Revit, 3D rendering, Excel, Word", "\n•\tExcellent verbal and written skills for leadership", "\n•\tDetail oriented and self-motivated and disciplined", "\n•\tAbility to work effectively as a part of team and independently", "\n", "\n", "\nTo Apply: ", "\n", "\nPlease forward your resume and introductory letter.", "\n    "], "images": [], "type": "full-time"},
{"text": "Senior Back-End Application Engineer - Remote", "date": "2019-08-28 10:52", "compensation": "DOE", "link": "https://sfbay.craigslist.org/sfc/sof/d/san-francisco-senior-back-end/6966590731.html", "address": ["\n        ", "\nData analysis is plagued by a fundamentally flawed workflow that leads to slow turnaround times, high error rates, and fewer insights. By combining analytics tools with a collaborative user experience Mode is alleviating the most pressing bottleneck for analytical organizations. We are looking for a senior back-end web engineer to join us in revolutionizing the way the world analyzes data.", "\n", "\nWhat you'll do:", "\nDevelop our core web applications for data analysts and business users", "\nDefine and maintain development practices that let us move fast with quality", "\nWork with a wide range of tools and technologies (from SQL to Javascript) and be able to evaluate technologies for what we are building", "\nDetermine priorities by estimating the potential impact of projects", "\nLearn from others and teach those around you", "\n", "\nWhat we look for:", "\nYou have built and shipped web applications", "\nExpert level aptitude with several programming languages (we hire people with backgrounds in any languages, but right now we are primarily using Ruby, Go, Java and Javascript)", "\nExperience with testing, continuous integration, and continuous deployment", "\nDemonstrated experience working remote and communicating effectively", "\nAlignment with Mode's values", "\n", "\nAbout Mode:", "\nMode is a collaborative analytics platform that brings teams together around data to make game-changing decisions.", "\n", "\nIn everything we do, we strive to put the people we do it for first. This starts internally: together we're building a culture that embraces diversity and learning, humility and gratitude. At the same time, we try not to take ourselves too seriously and strive for a healthy balance between work and personal pursuits.", "\n", "\nBenefits you can expect as a Mode employee:", "\nGenerous, flexible PTO and family leave", "\nFlexible work schedules—we trust you to know what will make yourself most productive", "\nGenerous professional development policy that includes funds earmarked for each employee's discretionary professional growth—Have a conference you want to attend? A class you want to take? If it's helping take your career to the next level, it's on us.", "\nExcellent health coverage for team members and their families (Mode pays the 100% of the premiums)", "\nSupportive work environment and a manager who is focused on your professional growth", "\nCompany events that highlight our team's passions and hobbies", "\nSnacks and in-office lunches shared at our ever-growing lunch table", "\n", "\nMode is committed to building an inclusive and diverse workforce. We are an Equal Opportunity Employer and welcome people from all backgrounds, experiences, abilities and perspectives.    "], "images": [], "type": "full-time"},
{"text": "Senior Back-End Services Engineer - Remote", "date": "2019-08-28 11:01", "compensation": "DOE", "link": "https://sfbay.craigslist.org/sfc/sof/d/san-francisco-senior-back-end-services/6966598799.html", "address": ["\n        ", "\nMode is changing how organizations make decisions by equipping every single person with the power to collaborate on analytics and share insights at the pace of work today. We're building the most advanced web-based environment for creating, sharing, and discussing ad-hoc analysis using a variety of technologies. We have a rapidly expanding list of happy customers who love our product and we're growing to serve even more.", "\n", "\nAs a Back-End Services Engineer at Mode, you'll work closely with other Engineers, PM's, and Designers to build a powerful application, enabling anyone to build complex data visualizations and manipulations. From building Visual Data Modeling tools to working on our Data Engine that will power millions of queries a day, your work will impact the way our customers understand and share their data. ", "\n", "\nWhat you'll do:", "\nDevelop the services that power our Web Application and API's for data analysts and business users", "\nDefine and maintain development practices that let us move fast with quality", "\nWork with a wide range of tools and technologies and be able to evaluate technologies for what we are building", "\nDetermine priorities by estimating the potential impact of projects", "\nLearn from others and teach those around you", "\n", "\nWhat we look for:", "\nYou have built and shipped services that support Web Applications and/or API's", "\nExpert-level aptitude with several programming languages. Right now our services team is primarily using Go and Java but across the application stack we use TypeScript and Ruby on Rails. We are open to hiring people with backgrounds in any languages", "\nExperience with testing, continuous integration, and continuous deployment", "\nDemonstrated experience working remote and communicating effectively", "\nAlignment with Mode's values", "\n", "\nAbout Mode:", "\nMode is a collaborative analytics platform that brings teams together around data to make game-changing decisions.", "\n", "\nIn everything we do, we strive to put the people we do it for first. This starts internally: together we're building a culture that embraces diversity and learning, humility and gratitude. At the same time, we try not to take ourselves too seriously and strive for a healthy balance between work and personal pursuits.", "\n", "\nBenefits you can expect as a Mode employee:", "\nGenerous, flexible PTO and family leave", "\nFlexible work schedules—we trust you to know what will make yourself most productive", "\nGenerous professional development policy that includes funds earmarked for each employee's discretionary professional growth—Have a conference you want to attend? A class you want to take? If it's helping take your career to the next level, it's on us.", "\nExcellent health coverage for team members and their families (Mode pays the 100% of the premiums)", "\nSupportive work environment and a manager who is focused on your professional growth", "\nCompany events that highlight our team's passions and hobbies", "\nSnacks and in-office lunches shared at our ever-growing lunch table", "\n", "\nMode is committed to building an inclusive and diverse workforce. We are an Equal Opportunity Employer and welcome people from all backgrounds, experiences, abilities and perspectives.    "], "images": [], "type": "full-time"},
{"text": "Senior Front-End Engineer - Remote", "date": "2019-08-28 11:07", "compensation": "DOE", "link": "https://sfbay.craigslist.org/sfc/sof/d/san-francisco-senior-front-end-engineer/6966603887.html", "address": ["\n        ", "\nData analysis is plagued by a fundamentally flawed workflow that leads to slow turnaround times, high error rates, and fewer insights. By combining analytics tools with a collaborative user experience Mode is alleviating the most pressing bottleneck for analytical organizations. We are looking for a front-end engineer to join us in revolutionizing the way the world analyzes data.", "\n", "\nWhat you'll do:", "\nDevelop our core web applications for data analysts and business users", "\nDefine and maintain development practices that let us move fast with quality", "\nWork with a wide range of tools and technologies (from SQL to Javascript) and be able to evaluate technologies for what we are building", "\nDetermine priorities by estimating the potential impact of projects", "\n", "\nWhat we look for:", "\nYou have built and shipped web applications", "\nExpert understanding of HTML, Javascript/Typescript, CSS and/or related technologies", "\nExperience with testing, continuous integration, and continuous deployment", "\nExperience with front-end frameworks such as angular, react, backbone, etc.", "\nDemonstrated experience working remote and communicating effectively", "\nAlignment with Mode's values", "\n", "\nAbout Mode:", "\nMode is a collaborative analytics platform that brings teams together around data to make game-changing decisions.", "\n", "\nIn everything we do, we strive to put the people we do it for first. This starts internally: together we're building a culture that embraces diversity and learning, humility and gratitude. At the same time, we try not to take ourselves too seriously and strive for a healthy balance between work and personal pursuits.", "\n", "\nBenefits you can expect as a Mode employee:", "\nGenerous, flexible PTO and family leave", "\nFlexible work schedules—we trust you to know what will make yourself most productive", "\nGenerous professional development policy that includes funds earmarked for each employee's discretionary professional growth—Have a conference you want to attend? A class you want to take? If it's helping take your career to the next level, it's on us.", "\nExcellent health coverage for team members and their families (Mode pays the 100% of the premiums)", "\nSupportive work environment and a manager who is focused on your professional growth", "\nCompany events that highlight our team's passions and hobbies", "\nSnacks and in-office lunches shared at our ever-growing lunch table", "\n", "\nMode is committed to building an inclusive and diverse workforce. We are an Equal Opportunity Employer and welcome people from all backgrounds, experiences, abilities and perspectives.    "], "images": [], "type": "full-time"},
{"text": "Senior Systems Technical Analyst", "date": "2019-08-29 15:44", "compensation": "$70 - $95/Hour Commensurate with education and experience, W-2, 1099, or C2C, must be in US without sponsorship", "link": "https://sfbay.craigslist.org/sfc/sof/d/san-francisco-senior-systems-technical/6967533895.html", "address": ["\n        ", "\nSierra Cybernetics is seeking Senior Systems Technical Analyst to work for us at our government client’s site in downtown San Francisco. Your duties will be to assist in the development and implementation of technical projects.", "\n", "\nYou will be part of a team providing a broad range of technical subject matter expertise for multiple technology projects in support of application, infrastructure and service deployments in conjunction with a team of project managers, network engineers, vendors and local client IT staff. ", "\n", "\nYou will also liaison with 3rd party vendors, assist with the documentation of technical assessments, validate business requirements, generate conceptual, logical and physical design diagrams, provide subject matter expertise on shared infrastructure, and ensure project compliance with IT security policies, industry best practice and branch standards", "\n", "\nThis assignment is expected to last 1 – 3 years or more.", "\n", "\nMinimum Job-Specific Skills/Qualifications Required (in order of relative importance):\t", "\n•\tMinimum of 10 years technical experience with network infrastructure, information security architecture and application system deployment projects. ", "\n•\tMinimum of 5 years technical experience with state government IT projects.", "\n•\tMinimum of 3 years working experience in a government agency and interfacing with other government agencies or entities.", "\n•\tMinimum of 3 years technical experience with various data center environments.", "\n•\tExperience working on multiple simultaneous IT projects throughout the entire life cycle from design to deployment.", "\n•\tExperience managing technical projects, including conflict resolution, issue escalations, status reporting and resource management.", "\n•\tKnowledgeable of enterprise network infrastructure design concepts such as ", "\no\tMulti-tier application system design", "\no\tClient / server system architecture", "\no\tSystem security policies and procedures", "\no\tData center technology infrastructure", "\no\tWeb-based application deployment", "\no\tMulti-vender platform integration", "\no\tPKI administration", "\no\tInfrastructure capacity planning", "\no\tTelecommunication infrastructure", "\no\tNetworking concepts: routing, switching, security, remote access, proxy", "\no\tCloud migration", "\n•\tAbility to convert business requirements into a technical design and implementation plan.", "\n•\tAbility to analyze issues from system documentation and recommend solutions.", "\n•\tHigh level of technical writing experience.", "\n•\tExcellent oral, written, analytical and communication skills with the ability to lead a technical discussion to both technical and non-technical staff.", "\n•\tExcellent presentation skills for both technical and non-technical audiences, including creating and presenting executive summaries to management and technical committees.", "\n•\tExcellent analytical, verbal and conflict resolution skills.", "\n•\tExtensive experience with Microsoft Office 365 including migration to, domain name services, managed file transfer systems, and firewall access control lists.", "\n", "\nAdditional desired qualifications include previous project experience with any of the following state agencies and their systems: ", "\n•\tCalifornia Department of Motor Vehicles", "\n•\tCalifornia Department of Justice", "\n•\tExperience with local or Federal IT Projects", "\n•\tExperience with SNA Gateway technologies such as Microsoft HIS", "\n•\tExperience with Cloud computing", "\n•\tConceptual understanding of Amazon Web Services, Microsoft Azure, Google Cloud, IBM and Oracle Cloud Platforms ", "\n•\tSamples of relevant published work are desired such as technical implementation plans, architectural as-built documentation, test plans, scope of work, project summary sheets, high level network diagrams, etc.", "\n", "\nCandidate must be a United States citizen or green card holder.    "], "images": [], "type": "contract"},
{"text": "Senior DevOps Engineer - up to $185,000", "date": "2019-08-31 12:26", "compensation": "up to $185,000", "link": "https://sfbay.craigslist.org/sfc/sof/d/san-francisco-senior-devops-engineer-up/6968767754.html", "address": ["\n        ", "\nTo learn more and to apply: ", "\n", "\nWe are looking for software and hardware engineers interested in working on the systems that underpin modern robotics: high performance sensors, localization, mapping, object detection, tracking and classification. We are looking for experienced DevOps engineers to drive efficiency improvements throughout our deep technology stack. ", "\n", "\nGeneral Requirements", "\n* 2+ years of experience with a major cloud provider (GCP, AWS, Azure)", "\n* 2+ years experience with Python development", "\n* 2+ years experience with Bash scripting in Linux environment", "\n* Communication and documentation skills", "\n* Strong attention to detail", "\n* Expertise with cloud services or technologies (Terraform, GCP Deployment Manager, AWS CloudFormation, GCP Stackdriver, ELK stack, AWS CloudWatch)", "\n* BS or MS in computer science or equivalent education", "\n", "\nResponsibilities", "\n* Design and implement solutions that broadly improve developer productivity and operation efficiency", "\n* Collaborate with engineers and researchers to deploy their work into production", "\n* Drive and implement DevOps best practices: CI/CD, automation, continuous testing, monitoring, alerting", "\n* Communicate clearly and effectively with team members across diverse disciplines", "\n* Mentor junior team members", "\n* Participate in on-call rotation", "\n", "\nRequired Skills", "\n* Python", "\n* Bash ", "\n* AWS", "\n* CI/CD", "\n* Ansible", "\n* Jenkins", "\n* Docker", "\n* Terraform", "\n* NoSQL", "\n", "\nPreferred Skills", "\n* Continuous integration using Jenkins", "\n* Containerization using Docker", "\n* Expertise with the following cloud services or technologies", "\n* GCP Kubernetes Engine, AWS ECS, Kubernetes", "\n* GCP Cloud SQL, AWS, RDS, SQL database", "\n* GCP Cloud Storage, AWS", "\n* Infrastructure automation using Ansible    "], "images": [], "type": "full-time"},
{"text": "SYSTEMS ENGINEER – ALL COVERED / KONICA MINOLTA", "date": "2019-08-31 14:03", "compensation": "This is a salaried position", "link": "https://sfbay.craigslist.org/sby/sad/d/san-francisco-systems-engineer-all/6968837001.html", "address": ["\n        ", "\nSYSTEMS ENGINEER – ALL COVERED", "\nKonica Minolta Business Solutions U.S.A., Inc. Foster City, CA, US", "\n", "\nAll Covered, IT Services Division of Konica Minolta Business Solutions (KMBS), is the leading national IT services company serving SMB to enterprise markets. Offering a wide variety of career opportunities, All Covered is an excellent choice for motivated IT professionals interested in a stimulating and progressive work environment. With over 1,000 employees across the U.S. and Canada, All Covered has a highly skilled team of professionals focusing on superior quality service delivery to our customers. We offer hands-on technical training on the most relevant technologies in the industry and career path advancement in all levels of the company. Please join us in our exciting growth and pursue a rewarding career with All Covered!", "\n", "\n", "\nPosition Objective:", "\n•\tThe primary focus of the Systems Engineer position is to provide technical knowledge and support for the IT needs (software, hardware, on-premise systems, cloud-based systems, and end-user support) for our “SMB” (Small to Medium Business) customers in the Bay Area.", "\n", "\nEssential Job Functions:", "\n•\tDocument, test, and modify network operating systems to enhance efficiency and reliability.", "\n•\tDiagnose and resolve on-premise, cloud-based, hardware, software, network and user issues.", "\n•\tImplement client projects by drawing upon a variety of prior technical experience.", "\n•\tMaximize network and systems performance through proactive design, build and monitoring.", "\n•\tDevelop and maintain accurate and timely guidebooks for clients.", "\n•\tMaintain 76% overall utilization.", "\n•\tProvide on-the-job training (via shadowing) to Support Specialists.", "\n•\tProduce up-to-date records of clients' environments as they grow.", "\n", "\nRequired Competencies:", "\n•\tAt least 5 years’ experience in: Windows Server 2008/2012/2016/2019, Windows 8/10, VMware 6.5, Office 2016, Office 365 Pro and Administration, Exchange 2016", "\n•\tAt least 5 years’ experience with TCP/IP, AD, DNS, DHCP, PowerShell, AD, GPO’s, GPResult, RSOP", "\n•\tAt least 3 years’ experience in: Mimecast, Hyper-V, Nutanix, Meraki, Axcient, Crashplan, Mozypro, Box, Veeam, Palo Alto Global Protect, Fortigate, Linux, Mac OSX, and Android.", "\n", "\nDesired Additional Competencies:", "\n•\tExperience with Server/Workstation Imaging software such as Clonezilla, SSCM, MDT, etc.", "\n•\tExperience with Remedy, Service-Now, N-Able, OpsRamp, Continuum and Bomgar.", "\n", "\nRequirements", "\n•\tPossess valid and clear drivers' license.", "\n•\tAbility to lift and carry at least 0 pounds.", "\n", "\nExperience, Educational Requirements and Certifications", "\n•\tMCSE/MCSA 2012 or higher", "\n•\tMCTS/MCP Server 2008 or above", "\n•\tMCTS/MCP Exchange 2007 or above", "\n•\tCompTIA Server+", "\n•\tCisco Certified Network Administrator (CCNA)", "\n•\tApple Certified Technical Coordinator (ACTC)", "\n", "\nWork Style:", "\n•\tProven dedication to enabling continuous operations.", "\n•\tProven ability to operate productively in a virtual office environment, delivering reliable follow-up and using off-site connectivity and wireless communications tools.", "\n•\tSuccessful at working in a team culture.", "\n•\tExcellent verbal and written communication skills.", "\n", "\n", "\nKonica Minolta Offers:", "\n•\tCompetitive salary (base salary + commissions). Strong results are well rewarded; President's Club winners have earned trips to Ireland, Panama, Banff and this year, Atlantis, Bahamas.", "\n•\tOutstanding benefits package (including medical, dental, vision, life insurance)", "\n•\t401(k) plan with matching company contribution", "\n•\tGenerous holiday and paid time off schedules", "\n•\tTuition Reimbursement Program", "\n•\tOngoing professional development training", "\n", "\n", "\nKonica Minolta is an equal opportunity and affirmative action employer. We consider all qualified applicants for employment without regard to race, color, religion, creed, national origin, sex, pregnancy, age, sexual orientation, transgender status, gender identity, disability, alienage or citizenship status, marital status or partnership status, genetic information, veteran status or any other characteristic protected under applicable law.    "], "images": [], "type": "full-time"},
{"text": "Senior Software Engineer", "date": "2019-08-16 15:22", "compensation": "DOE", "link": "https://sfbay.craigslist.org/sfc/sof/d/san-francisco-senior-software-engineer/6958251653.html", "address": ["\n        ", "\nWho we are", "\nSofar is powered by the dream to build the world’s best ocean data platform. Our team combines expertise in ocean science, technology, and innovation to develop new solutions for ocean exploration and observation. We are a bunch of ocean nerds and keep our offices close to the water (literally).", "\n", "\nWe’re a scrappy startup that values teamwork, transparency, and innovation.  We maintain a work atmosphere that’s light-hearted and jovial, but when we need to get something done, we can switch gears and move fast.", "\n", "\nWe are deeply passionate about making ocean data widely available to ocean communities and enthusiasts with powerful tools and visualizations.", "\n", "\nWho you are", "\nYou are a problem-solving, self-motivated team-player who wants to see their engineering talents have a direct impact on the success of your team and company.  ", "\n", "\nYou care most about the success of the greater team and the impact of what we build together.  When somebody is struggling with their part of the project, you are helpful and work with them to get their work across the finish line.  ", "\n", "\nWhen you get up in the morning, you show up for work because you are excited about the people you work with and the projects you’re working on.", "\n", "\nThe position", "\nAs a senior full stack engineer, you’ll be most heavily engaged with the rest of our software team on a day-to-day basis.  Your projects will vary based on current company priorities - sometimes they shift quickly, but hey, we’re a start-up, that’s expected - and consequently you’ll get a lot of opportunities to work on different technologies, platforms, and layers of our applications.", "\n", "\nWe have a small fleet of customer facing apps that are in production - spotter dashboard, sofar spotter app, and the trident controller to name a few - and we’ve got a lot more exciting projects in the works that we haven’t made public yet. You’ll get opportunities to apply your engineering talents to all of them and help us build out the supporting infrastructure - think DevOps.  You’ll get ownership of how you write your code (as long as the linter ok’s it) and get to make technical decisions on implementations on all projects you contribute to.", "\n", "\nWe try to structure our company time with the maker’s schedule in mind - we don’t like to schedule meetings if at all possible.  We’ve implemented a lightweight flavor of a kanban agile environment that only requires attending a daily standup.", "\n", "\nAs a senior engineer, you’ll get opportunities to demonstrate both technical leadership on our projects as well as being a cultural role model for the team and company.", "\n", "\n", "\nEssential Job Functions", "\n-Architect, design, and implement systems applying advanced understanding of backend, database, and APIs/web services best-practices and architecture.", "\n-Apply working knowledge of VCS’s best practices to develop and maintain code.", "\n-Demonstrate knowledge of SDLC and Agile software development methodologies.", "\n-Take projects from idea inception to code complete.", "\n-Quickly pick up new languages and frameworks.", "\n", "\nBonus Points", "\n-Experience with large time series databases.", "\n-Experience in mathematics, science, or signal processing.", "\n-Experience with data science and machine learning.", "\n-Familiarity with front-end frameworks. (Angular, React, Vue, etc.)", "\n-Experience and/or passion for DevOps and CI.", "\n-Familiarity with Node.js.", "\n", "\nMinimum Job Qualifications", "\n-College Degree or equivalent learning experience required.", "\n-4+ years professional experience.", "\n-Strong interpersonal and communication skills.", "\n-Deep technical knowledge of common software languages, web systems, technology infrastructure and technical frameworks.", "\n-Strong analytical and quantitative skills, with ability to use data and analytics to understand and improve performance.", "\n-A flexible work schedule and be on-call during evenings and weekends, as needed.", "\n-Demonstrate initiative and self-motivation, conscientious and provide complete follow-through on areas of responsibility.", "\n", "\nEmployee Conduct", "\nIt is the responsibility of every employee to contribute to a positive work environment through cooperative and professional interactions with co-workers, customers and vendors.", "\n", "\nEqual Employment Opportunity", "\nAll qualified applicants will receive consideration for employment without discrimination on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, disability, or any other factors prohibited by law.", "\n", "\nApplicant must be eligible to work in US.", "\n", "\nHow to Apply", "\nIf this job aligns with your passion and experience, we would love to hear from you!", "\n", "\nEmail your resume and a short cover letter explaining why you’re excited about the open position and we will get back to you ASAP", "\n", "\n    "], "images": [], "type": "full-time"},
{"text": "Software Engineer in Test (Systems) - HelloSign", "date": "2019-08-20 16:10", "compensation": "Compensation Depends on Experience", "link": "https://sfbay.craigslist.org/sfc/sof/d/san-francisco-software-engineer-in-test/6961087324.html", "address": ["\n        ", "\n", "\nSAN FRANCISCO, CA    ENGINEERING  FULL-TIME", "\n", "\nThe Software Engineer in Test (Systems) will focus on testing and design of systems, and include performing functional, regression, sanity testing of company products.", "\n", "\nWhat You'll Do", "\n\"\tWill develop automation framework of the products; and document test cases in TestRail to capture the user story requirements. ", "\n\"\tWill also test new API features and work with developers, QA engineers, and product managers in a 3-week release cycle. ", "\n\"\tWill follow Agile development process. ", "\n\"\tWill document bugs in JIRA as needed and participate in bug triage meetings and in daily stand ups. ", "\n\"\tWill perform other quality assurance duties as required.", "\n", "\nRequired: ", "\n\"\tMaster's degree in Computer or Software Engineering ", "\n\"\tAt least 1 year in position offered or as a QA Engineer position", "\n\"\tAutomate functional, regression and integration test cases, using Selenium WebDriver and TestNG Framework", "\n\"\tDevelop and establish QA measures testing standards", "\n\"\tBuild Acceptance/Smoke", "\n\"\tDevelop automated scripts using Java in Eclipse IDE", "\n\"\tJenkins, GIT", "\n\"\tEclipse/IntelliJ", "\n\"\tPython, JavaScript, HTML and/or JSON", "\n\"\tSQL and relational databases", "\n\"\tRestful APIs", "\n\"\tQA checkouts on Production Servers", "\n\"\tBug review and daily Scrum stand-up meetings", "\nHiring Requirements: Background and Reference Checks + Technical Skills Assessment", "\n", "\nAbout HelloSign, A Dropbox Company:", "\nWe believe that the way business gets done today is broken. That's why we're dedicated to simplifying work for everyone - from small startups to large enterprise companies. Millions of individuals and over 80,000 companies world-wide trust the HelloSign platform - which includes eSignature, digital workflow and eFax solutions - to automate and manage their most important business transactions.", "\nWith a sharp focus on user experience and a lust for innovation, HelloSign is on a mission to Simplify Work.", "\n", "\nLife at HelloSign:", "\nJust over 140 employees, we are growing the company deliberately, with a keen eye towards maintaining a culture that values lifestyle, fun and continuous improvement. We were awarded the Hirepalooza Culture Award for Lifestyle in 2015 and the Healthy Mothers Workplace Bronze Award in 2016 and 2017. In 2018, we won SF Business Times' Best Places to Work Award for Small Employers. We continue to maintain an overwhelmingly positive presence on Glassdoor and The Muse.", "\n", "\nWe have raving fans who love what we make o We're user-focused and product-driven o We're always evolving with an eye towards improvement o We're committed to building a product people want o We thrive on collaboration and learning from each other o We have a supportive, familial atmosphere o We work in an open, airy, creative space o We laugh a lot o We love dogs o And we'll never forget your birthday!", "\n", "\nHelloSign is an equal opportunity employer committed to hiring a diverse team of qualified individuals o HelloSign conducts background checks; pursuant to the San Francisco Fair Chance Ordinance, HelloSign will consider for employment qualified applicants with arrest and conviction records o HelloSign participates in E-Verify.", "\n    "], "images": [], "type": "full-time"}
]